pico-8 cartridge // http://www.pico-8.com
version 42
__lua__

local real_assert = assert
function assert(cond, num)
    if (num == 38 or num == 68 or num == 69) return cond -- nothing serious, just undocumented minutae
    return real_assert(cond, num)
end function const(x) return function() return x end end
function deserialize(data)
	data = all(split(data, 0x4000, false))
	local pos, refs, chunk = 0x4000, {}

	local function advance()
		if (pos == 0x4000) chunk, pos = data(), 0
	end
	local function byte()
		advance()
		pos += 1
		return ord(chunk, pos)
	end
	local function short() return byte() | byte() << 8 end
	local function word() return byte() >>> 16 | byte() >>> 8 | short() end
	
	local function dive()
		local function hash(res)
			res = res or add(refs, {})
			for k,v in function()
				local key = dive()
				return key, key ~= nil and dive()
			end do res[k] = v end
			return res
		end

		local ctl = byte()
		local v = ctl&252 ~= 252 and ctl>>>2&63
		return select(ctl%4+1,
			function()
				return v and v-31 or word()
			end,
			function()
				local len, res = v and v>>>16 or word(), ""
				repeat
					advance()
					local consumed = min(len, 0x4000-pos>>>16)<<16
					res ..= sub(chunk, pos+1, pos+consumed)
					pos += consumed
					len -= consumed>>16
				until len <= 0
				return add(refs, res)
			end,
			function()
				local res = add(refs, {})
				for i=1,v or short() do res[i] = dive() end
				return hash(res)
			end,
			function()
				return select(v,
					const(), const(true), const(false),
					function()
						local id = short()
						return refs[id]
					end,
					hash)()
			end)()
	end

	return dive()
end
function ps8_asm(n, a, b, c)
	if (n>0) return ps8_ops[a[1]](unpack(a,2)), ps8_asm(n-1, b, c)
	return const(a), const(b), const(c)
end

function run_ps8(fir)
	ps8_inst, ps8_binder = {}, const
	return ps8_asm(1, fir)(ps8_binder())()(--[[$force-safe]]_ENV)
end

ps8_ops = {function(a)
	return function() return ps8_inst[a] end
end}

for i,n in inext, split"0,0,0,2,2,2,2,1,0,2,2,2,2,2,1,2,1,1,0,2,2,3,2,1,2,2,2,2,2,1,2,2,3,0,2,1,0,1,3"do
	add(ps8_ops, function(...)
		return const(add(ps8_inst,
			(select(i, ps8_runtime(ps8_asm(n, ...))))))
	end)
end

function ps8_runtime(--[[$rename::a]]a, --[[$rename::b]]b, --[[$rename::c]]c)
	local step = ps8_binder
	function ps8_binder()
		a, b, c = a(), b(), c()
		return step()
	end return function()return a end,
function()end,
function(f)return f end,
function(f)return a(f),b(f)end,
function(f)return a(f)(b(f))end,
function(f)return a(f)==b(f)end,
function(f)return a(f)and b(f)end,
function(f)return{a(f)}end,
function(f)return f[a][b]end,
function(f)a(f)return b(f)end,
function(f)f[c]={a(f)}return b(f)end,
function(...)return a(...)+b(...)end,
function(...)return a(...)*b(...)end,
function(f)local u={__index=a({}, f)}return function(...)return b(setmetatable(pack(...),u))end end,
function(f)return(a(f))end,
function(f)return a(f)>b(f)end,
function(f)return -a(f)end,
function(f)f[b]=a(f)end,
function(f)return f[a]end,
function(f)return a(f)or b(f)end,
function(...)return a(...)-b(...)end,
function(t,f)t[a(f)]=b(f)return c(t,f)end,
function(f)return a({b(f)},f)end,
function(f)return #a(f)end,
function(...)return a(...)<<b(...)end,
function(...)return a(...)&b(...)end,
function(...)return a(...)^b(...)end,
function(f)return a(f)~=b(f)end,
function(f)local o=a(f)return o[c](o, b(f))end,
function(t,f)t[b]=f[c]return a(t,f)end,
function(...)return a(...)>>>b(...)end,
function(f)return a(f)<b(f)end,
function(f)if a(f)then return b(f)end return c(f)end,
function(f,v)return v end,
function(f)a(f)[c]=b(f)end,
function(f)return a(f)[b]end,
function(f)return unpack(f,a,f.n)end,
function(f)f[b][c]=a(f)end,
function(f)local t,k=a(f),b(f)t[k]=c(f,t[k])end end run_ps8(deserialize("ᵉま⁶☉⁷□て\nア█⁷ᵉそ□ュ\0\0$\0ᵉさ██⁷\n██⁷。ps8_asm⁷ᵉそ□ュ\0\0$\0\n█☉⁷⁙⁸\0。run_ps8⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙⁸\0!ps8_inst⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙⁸\0)ps8_binder⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙⁸\0。ps8_ops⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙⁸\0-ps8_runtime⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0\n░█⁷⁵x⁷ᵉそᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0」assert⁷ᵉ…\n░ᵇ⁷\n█さ⁷⁷⁷ᵉそᵉ⬆️\n█て⁷ᵉ…ᵉ▤ᵉュ\0\0%\0⁙ᶜ\0⁙。\0⁷⁙$\0⁷\n░░⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\n░!\0ᶜ3\n	⁵Aa⁷\n█オ⁷⁷\n░ュ\0█²\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\n░■'\"\\'⁷\n█ノ⁷⁷\n░☉⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\n░	]]⁷\n█ヲ⁷⁷\n░😐⁷⁷⁷ᵉそ\n█そ⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙$\0■e2e3⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉう\n█ら⁷ᵉ▤ᵉュ\0\0%\0⁙ᶜ\0⁙H\0⁷⁙$\0⁷⁷\n░…⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤\n░ュ\0ユᶠ\0⁷\n█ュ\0\0+\0⁷⁷ᵉ▤\n░ュ\0@²\0⁷\n█ュ\0\0-\0⁷⁷⁷\n░⬆️⁷⁷⁷ᵉそ□てᵉ…⁙$\0ᵉ…\nき⁙⁸\0⁷\n█ム⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉさ|█⁷⁵a⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉさ|░⁷⁵b⁷□ュ\0\0$\0⁙ᶜ\0ᵉさ|☉⁷⁵c⁷⁷⁷|⁷ᵉそ□てᵉ…ᵉュ\0\0%\0⁙ᶜ\0⁙l\0⁷ᵉ…\n█ろ⁷ᵉ…\n█ュ\0\0!\0⁷ᵉュ\0\0%\0⁙ᶜ\0⁙e\0⁷⁷⁷⁷ᵉそ\n█ュ\0\0007\0⁷ᵉそ□ュ\0\0$\0ᵉュ\0\0%\0⁙ᶜ\0⁙i\0⁷\n█ュ\0\0008\0⁷⁵n⁷ᵉそ□ュ\0\0$\0\n█ュ\0\0D\0⁷\n█ュ\0\0:\0⁷█⁷□ュ\0\0$\0⁙ᶜ\0ᵉさ|😐⁷⁙l\0⁷⁷⁷⁷|⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉうᵉうᵉ▤\n█ュ\0\0@\0⁷⁙a\0⁷ᵉ▤\n█ュ\0\0?\0⁷⁙$\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙○\0⁙|\0⁷⁙r\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙○\0█⁷⁙t\0⁷⁷\n░う⁷⁷⁷ᵉそᵉっᵉぬ⁙⌂\0⁙$\0⁷x⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\nアx⁷⁙t\0⁷\n░き⁷⁷⁷ᵉそᵉっᵉひ\n█ュ\0\0[\0⁷⁙r\0⁷t⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\nアt⁷\n█ュ\0\0V\0⁷⁷\n░ュ▥」	\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…\n█ュ\0\0M\0⁷\n░ュ33	\0⁷⁷⁷ᵉそᵉっ⁙ᶜ\0p⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\nアp⁷⁙ᶜ\0⁷\n░さ⁷⁷⁷ᵉそᵉっ⁙⁸\0l⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\nアl⁷⁶░⁷⁷\n░そ⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0ᵉ…⁙$\0ᵉ…⁙r\0⁙a\0⁷⁷⁷⁵f⁷□てᵉ…\n░|⁷ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙り\0⁷⁙⁸\0⁷⁷ᵉそᵉっ\n█ュ\0\0006\0⁷h⁷ᵉそᵉっ⁙{\0d⁷ᵉそᵉっ⁙█\0`⁷ᵉそᵉっ\n█ュ\0\0G\0⁷\\⁷ᵉそᵉっᵉさ|…⁷X⁷ᵉそᵉっᵉさ|⬆️⁷T⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉうᵉうᵉうᵉうᵉ▤\nアh⁷\n█ュ\0\0{\0⁷⁷ᵉ▤\nアd⁷⁙$\0⁷⁷ᵉ▤\nア`⁷⁙r\0⁷⁷ᵉ▤\nア\\⁷⁙a\0⁷⁷ᵉ▤\nアX⁷\n█ュ\0\0r\0⁷⁷⁷ᵉ▤\nアT⁷⁙マ\0⁷⁷\n░て⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0\nュ\0\0&\0█⁷⁷⁙り\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉ⬆️\n█ュ\0\0|\0⁷\n█ュ\0\0x\0⁷⁷⁙$\0⁷\n░ぬ⁷⁷⁷ᵉそ□て\nもᵉ⬆️⁙ワ\0ᵉ…⁙$\0⁙r\0⁷⁷⁷ᵉそ⁙w\0\n█ュ\0\0009\0⁷⁷|⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤⁙⌂\0⁙$\0⁷ᵉ▤⁙○\0⁙マ\0⁷⁷\n░ひ⁷⁷⁷ᵉそ□てᵉ…\n█ュ\0\0さ\0⁷⁙a\0⁷\n█ュ\0\0す\0⁷|⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉう\n█ュ\0\0そ\0⁷ᵉ▤⁙○\0⁙a\0⁷⁷\n░ま⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉュ\0\0%\0ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0■pack⁷ᵉ⬆️⁙ワ\0ᵉ…⁙$\0ᵉ…⁙r\0ᵉ…⁙マ\0ᵉ…⁙a\0ᵉ…⁙マ\0⁙マ\0⁷⁷⁷⁷⁷⁷⁷⁙|\0⁷\n█ュ\0\0000\0⁷⁷\n░も⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0ᵉ…\n█ュ\0\0い\0⁷ᵉ…⁙(¹⁙(¹⁷⁷⁷⁙り\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉュ\0\0%\0ᵉ⬆️\n█ュ\0\0ふ\0⁷\n█ュ\0\0お\0⁷⁷⁙|\0⁷\n█ュ\0\0(\0⁷⁷\n░ら⁷⁷⁷ᵉそᵉっ⁙$\0P⁷□ュ\0\0\"\0ᵉら\nアP⁷⁙a\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0」select⁷ᵉ…⁙t\0⁙1¹⁷⁷⁙r\0⁷\n░っ⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙ニ\0⁵j⁷ᵉそᵉっ\nろ⁙r\0⁷L⁷□ュ\0\0\"\0ᵉら\nアL⁷⁙ニ\0⁷ᵉそᵉっ⁙2¹H⁷□ュ\0\0\"\0ᵉら\nアH⁷⁙$\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉュ\0\0%\0⁙ᶜ\0⁙D¹⁷⁙$\0⁷\n░ュ\0█⁘\0⁷⁷⁷ᵉそᵉっ⁙2¹D⁷□ュ\0\0\"\0ᵉら\nアD⁷⁙$\0⁷ᵉそ\n█ュ\0\0サ\0⁷□てᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0」ipairs⁷\nきᵉ…⁙t\0⁙2¹⁷⁷⁷□てᵉ⬆️ᵉさ@█⁷ᵉ…ᵉさ@░⁷ᵉさ@☉⁷⁷⁷ᵉそᵉっ⁙ゃ\0<⁷ᵉそᵉっ⁙{\0008⁷□ュ\0\0\"\0ᵉ▤\nア<⁷⁙⁸\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\n█ュ\0\0テ\0⁷⁙r\0⁷\n░ュ\0█◀\0⁷⁷⁷□ュ\0\0\"\0\n█ュ\0\0リ\0⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉぬ⁙t¹⁙$\0⁷⁙D¹⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙t¹⁙a\0⁷\n░ュ\0█▶\0⁷⁷⁷□ュ\0\0\"\0⁙w¹ᵉそᵉ⬆️⁙'\0ᵉ…\n░ᶠ⁷\n░チ⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙t¹⁙t\0⁷\n░ュ▥▥「\0⁷⁷⁷□ュ\0\0\"\0⁙w¹ᵉそᵉ⬆️⁙'\0ᵉ…\n█ュ\0\0ョ\0⁷\n░ナ⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙t¹⁙2¹⁷\n░ュ\0█」\0⁷⁷⁷□ュ\0\0\"\0⁙w¹ᵉそᵉ⬆️⁙'\0ᵉ…⁙◆¹\n░ュアア」\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙t¹⁙\"¹⁷\n░ュfヒ」\0⁷⁷⁷□ュ\0\0\"\0\n█ュ\0\0ᶠ¹⁷ᵉそ⁙\\¹ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙$\0⁙D¹⁷ᵉそᵉ⬆️⁙'\0ᵉ…\n█ュ\0\0ト\0⁷\n░ヘ⁷⁷⁷□ュ\0\0\"\0\n█ュ\0\0⁸¹⁷ᵉそᵉ⬆️⁙'\0ᵉ…⁙◆¹\n░ム⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…⁙w¹\n░ユ⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙$\0⁵k⁷□ュ\0\0\"\0ᵉら⁙t¹⁙ニ\0⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉケ⁙t¹⁙$\0⁷⁙D¹⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉひᵉュ\0\0%\0⁙ᶜ\0⁙へ¹⁷⁙r\0⁷⁙へ¹⁷\n█ュ\0\0ら⁴⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤\n█ュ\0\0!¹⁷⁙t\0⁷ᵉ▤⁙t¹⁙ニ\0⁷⁷\n░ル⁷⁷⁷□ュ\0\0\"\0ᵉら⁙を¹⁙ニ\0⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉケ⁙を¹⁙$\0⁷⁙へ¹⁷ᵉそ\n█ュ\0\0ヲ\0⁷\n█ュ\0\0ゆ⁴⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉう\n█ュ\0\0¹¹⁷ᵉ▤⁙を¹⁙ニ\0⁷⁷\n░ヲ⁷⁷⁷□ュ\0\0\"\0\n█ュ\0\0゛¹⁷ᵉそ\n█ュ\0\0 ¹⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉぬ⁙を¹⁙$\0⁷⁙へ¹⁷□ュ\0\0\"\0ᵉ▤⁙を¹⁙a\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉう⁙そ¹\n█ュ\0\0008¹⁷⁷\n░ュ\0\0 \0⁷⁷⁷ᵉそ⁙エ¹ᵉそ\n█ュ\0\0.¹⁷□ュ\0\0\"\0ᵉオ⁙そ¹\n█ュ\0\0ン\0⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉう⁙ム¹ᵉ▤⁙を¹⁙$\0⁷⁷\n░ュ\0\0!\0⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0⁙⁸\0⁷⁙り\0⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0\n█ュ\0\0C¹⁷⁵g⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤\n█ュ\0\0}\0⁷⁙マ\0⁷ᵉ▤ᵉュ\0\0%\0ᵉ⬆️⁙0¹⁙◝¹⁷⁙|\0⁷⁙ニ\0⁷⁷\n░ュ\0\0\"\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙ン¹⁷⁙⁸\0⁷⁙マ\0⁷ᵉ▤ᵉュ\0\0%\0ᵉ⬆️⁙0¹\n█ュ\0\0O¹⁷⁷⁙|\0⁷⁙ニ\0⁷⁷\n░ュ\0\0#\0⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0\n█ュ\0\0う\0⁷⁵h⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉチ□ス\n░⁙e\0⁷⁙$\0□ス\n░⁙i\0⁷⁙r\0□ス\n█ュ\0\0▤\0⁷⁙t\0⁶😐⁷⁷⁷⁷ᵉ…⁙$\0ᵉ…⁙r\0ᵉ…⁙a\0ᵉ…⁙t\0ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙⁙²⁷ᵉ…⁙2¹ᵉ…⁙\"¹ᵉ…⁙マ\0⁙さ\0⁷⁷⁷⁷⁷⁷⁷⁷⁷⁙e\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉうᵉうᵉうᵉうᵉ▤ᵉュ\0\0%\0⁙⌂\0█⁷⁙$\0⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0░⁷⁙r\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0☉⁷⁙a\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0😐⁷⁙t\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0…⁷⁙2¹⁷⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0⬆️⁷⁙\"¹⁷⁷\n░ュ\0\0$\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉうᵉうᵉうᵉ▤ᵉュ\0\0%\0⁙⌂\0▤⁷⁙マ\0⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0う⁷⁙さ\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0⁙e\0⁷⁙$\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0⁙i\0⁷⁙r\0⁷⁷ᵉ▤ᵉュ\0\0%\0⁙⌂\0て⁷⁙t\0⁷⁷\n░ュ\0\0%\0⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0\nき⁙(¹⁷⁷⁙⁙²⁷ᵉそᵉっ⁙⁸\0004⁷ᵉそᵉっᵉま⁙⁸\0ᵉチ□ス\n█ュ\0\0Y¹⁷⁙a\0\n█ュ\0\0[¹⁷⁷⁙(¹⁷⁷4⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤\nナᵉ⬆️\nア4⁷\n█ュ\0\0こ\0⁷⁷⁷⁙$\0⁷ᵉ▤ᵉュ\0\0%\0\n█ュ\0\0▤¹⁷⁙e\0⁷⁙a\0⁷⁷\n░ュ\0\0&\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\nナᵉ⬆️\n█ュ\0\0_¹⁷⁙c²⁷⁷⁙r\0⁷\n░ュ\0\0'\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤ᵉぬ⁙$\0ᵉひ⁙t\0⁙2¹⁷⁷\n░オ⁷⁷ᵉ▤ᵉヘ\n░ュ\0\0ラ¹⁷ᵉノ\n░ュ\0\0◝\0⁷⁙t\0⁷⁷\n░ュ\0\0ユ¹⁷⁷⁷\n░ュ\0\0(\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤ᵉひᵉぬ⁙$\0⁙t\0⁷⁙2¹⁷\n█ュ\0\0⁵¹⁷⁷ᵉ▤ᵉノᵉヘ\n█ュ\0\0つ¹⁷\n█ュ\0\0て¹⁷⁷⁙t\0⁷\n░ュ\0\0 ᶠ⁷⁷⁷\n░ュ\0\0)\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤\nろᵉム⁙r\0⁙t\0⁷⁷\nろ\n█ュ\0\0よ\0⁷⁷⁷ᵉ▤ᵉム\n█ュ\0\0シ\0⁷⁙t\0⁷⁙∧²⁷⁷\n░ュ\0\0*\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉオᵉうᵉユ⁙$\0⁙r\0⁷\n█ュ\0\0ゅ¹⁷⁷ᵉ⬆️⁙'\0ᵉ…⁙◆¹\n░ュ\0\0+\0⁷⁷⁷⁷\n░ュ▥」+\0⁷⁷⁷ᵉそᵉっᵉチ□ス\n░⁙り\0⁷ᵉま⁙⁸\0ᵉさ█⁵z⁷⁷□ス\n░⁙と²⁷⁙a\0⁙Z²⁷⁷⁙⁸\0⁷\\⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤□ル\n█ュ\0\0◆\0⁷⁙⁸\0⁙り\0⁷⁙a\0⁷ᵉ▤ᵉ⬆️ᵉさ\\⁙り\0⁷ᵉチ□ス\n█ュ\0\0サ¹⁷⁙t\0⁙Z²⁷⁙⁸\0⁷⁷⁙t\0⁷⁷\n░ュ\0\0,\0⁷⁷⁷ᵉそᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0001setmetatable⁷ᵉ…⁙へ²ᵉチ□ス\n░。__index⁷ᵉま⁙⁸\0\nア░⁷⁷⁙Z²⁷⁙⁸\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉさ\\\rboo⁷\n░⁙ウ²⁷⁷\n░ュ\0\0-\0⁷⁷⁷ᵉそ□ュ\0\0'\0⁙へ²\\⁙ン¹⁷ᵉそ□ュ\0\0$\0ᵉュ\0\0%\0ᵉさ\\⁙ン¹⁷⁙ン¹⁷ᵉま⁙⁸\0\n█░⁷⁷⁙と²⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉ⬆️ᵉさ\\⁙と²⁷⁙◆¹⁷⁙◆¹⁷\n░ュ\0\0.\0⁷⁷⁷ᵉそ□ュ\0\0$\0\n█ュ\0\0ロ¹⁷ᵉま⁙⁸\0ᵉ…⁙ス²\n█ュ\0\0ヘ¹⁷⁷⁷\rzoo⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤□ル⁙へ²\n█ぬ⁷⁙ヒ²⁷⁙へ²⁷ᵉ▤ᵉ⬆️\n█ュ\0\0エ\0⁷ᵉ…⁙r\0\n█ュ\0\0²²⁷⁷⁷⁙メ²⁷⁷\n░ュ\0\0/\0⁷⁷⁷ᵉそᵉっ⁙$\0h⁷ᵉそᵉっᵉぬ\n█ュ\0\0♥\0⁷⁙$\0⁷h⁷□ュ\0\0\"\0ᵉ▤⁙ン²⁙t\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…\n█ュ\0\0ᵉ²⁷\n░ュ\0\0000\0⁷⁷⁷ᵉそᵉっ⁙ニ\0h⁷□てᵉ…ᵉュ\0\0%\0⁙ᶜ\0■next⁷\nき⁙2¹⁷⁷□てᵉ⬆️ᵉさ0█⁷ᵉ…ᵉさ0░⁷ᵉさ0☉⁷⁷⁷ᵉそᵉっ⁙ゃ\0,⁷ᵉそᵉっ⁙{\0(⁷□ュ\0\0\"\0ᵉ▤\nア,⁷⁙⁸\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙ン²⁙$\0⁷\n░ュ\0█2\0⁷⁷⁷□てᵉ…ᵉュ\0\0%\0⁙ᶜ\0\radd⁷ᵉチ□ス\n░⁙!\0⁷⁙'\0⁙Z²⁷⁙⁸\0⁷⁷ᵉそᵉっ⁙ゃ\0$⁷ᵉそᵉっ⁙{\0 ⁷ᵉそᵉ⬆️\nア$⁷ᵉ…\nア ⁷⁙a\0⁷⁷ᵉそᵉ⬆️ᵉさ ⁙!\0⁷ᵉ…ᵉ▤ᵉさ █⁷⁙a\0⁷\n░ュ\0\0003\0⁷⁷⁷ᵉそᵉっ⁙⁸\0、⁷ᵉそᵉっᵉま□ヲ⁙Z²x█⁷□ュ\0\0'\0⁙ス²x█⁷⁷、⁷ᵉそᵉっ⁙ᶜ\0「⁷ᵉそᵉ⬆️\nア、⁷ᵉチ□ス\n█ュ\0\0$²⁷⁙'\0□ス\n░\ruvw⁷\n░ュ\0\0{\0⁷⁙Z²⁷⁷⁙⁸\0⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉュ\0\0%\0⁙ᶜ\0⁙B³⁷\n█ュ\0\0<²⁷⁷\n░ュ\0\0004\0⁷⁷⁷ᵉそᵉ⬆️\n█ュ\0\0:²⁷\nア「⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0ᵉ…\n█ュ\0\0]\0⁷ᵉ…⁙ニ\0⁙$\0⁷⁷⁷⁙り\0⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0ᵉ⬆️⁙ス²⁙⁸\0⁷⁷⁵s⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま⁙⁸\0\nも\n█ュ\0\0L²⁷⁷⁷⁵r⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤ᵉュ\0\0%\0ᵉ⬆️⁙0¹ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙Y³⁷⁙ワ\0⁷⁷⁙|\0⁷⁙a\0⁷ᵉ▤ᵉュ\0\0%\0ᵉ⬆️⁙0¹ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙_³⁷⁙ワ\0⁷⁷⁙|\0⁷⁙$\0⁷⁷\n░ュ\0\0005\0⁷⁷⁷ᵉそᵉっ\n░ュ\0\0H\0⁷h⁷ᵉそᵉっᵉケ⁙ン²ᵉひ⁙t\0⁙r\0⁷⁷h⁷ᵉそᵉっᵉュ\0\0 \0⁙ン²⁙∧²⁷h⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙ン²\n░ュ@\0\0\0⁷⁷\n░ュ\0\0006\0⁷⁷⁷□ュ\0\0\"\0ᵉュ\0\0!\0⁙ン²⁙$\0⁷□ュ\0\0\"\0\n█ュ\0\0☉\0⁷ᵉそᵉっ⁙I³h⁷ᵉそᵉ⬆️⁙'\0ᵉ…\n█ュ\0\0h²⁷\n░ュ\0\0007\0⁷⁷⁷ᵉそᵉっ⁙$\0⁘⁷ᵉそᵉっ⁙ヲ¹⁘⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉュ\0\0%\0⁙ᶜ\0■zoom⁷⁙マ\0⁷\n░ュ\0\0008\0⁷⁷⁷ᵉそ\n█ュ\0\0ᵇ²⁷ᵉそᵉっ⁙r\0▮⁷□ュ\0\0\"\0ᵉ⬆️⁙'\0ᵉ…ᵉ▤\nア▮⁷⁙r\0⁷\n░ュ\0\0009\0⁷⁷⁷ᵉそᵉっ⁙r\0ᶜ⁷ᵉそᵉっ⁙a\0⁸⁷□ュ\0\0\"\0ᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉひ\nアᶜ⁷\nア⁸⁷⁷⁙\"¹⁷\n░ュ\0█9\0⁷⁷⁷□て⁙⁸\0ᵉそ□ュ\0\0'\0ᵉま⁙⁸\0⁙a\0⁷⁴█⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉぬ\nろᵉ⬆️ᵉさ⁴█⁷⁙⁸\0⁷⁷\n█ュ\0\0⌂²⁷⁷⁙ニ\0⁷\n░ュ\0\0:\0⁷⁷⁷ᵉそᵉっ⁙⁸\0\0⁷ᵉそᵉっᵉま□ヲ⁙Z²x⁴⁷ᵉさx█⁷⁷\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉ⬆️ᵉ⬆️\nア\0⁷⁙⁸\0⁷⁙⁸\0⁷⁙a\0⁷\n░ュ\0\0;\0⁷⁷⁷□て⁙⁸\0ᵉそ□ュ\0\0'\0ᵉま□ヲ⁙Z²tュ\0\0ナ◝⁷□て⁙ス²ᵉそᵉっᵉま\n█ュ\0\0005²⁷ᵉそ□ュ\0\0'\0ᵉぬ\n█ュ\0\0⧗²⁷⁙$\0⁷x█⁷⁙コ³⁷⁷x⁷□ュ\0\0\"\0ᵉう⁙ハ²ᵉら⁙ハ²⁙ニ\0⁷⁷ᵉ…⁙お\0ᵉ⬆️ᵉさt█⁷ᵉ…ᵉひ⁙ᶜ\0⁙r\0⁷ᵉケ⁙ハ²⁙$\0⁷⁷⁷⁷⁙お\0⁷⁷█⁷⁷ュ\0\0ナ◝█⁷□てᵉ…ᵉ⬆️ᵉさュ\0\0ナ◝█⁷\n█ュ\0\0m\0⁷⁷ᵉ…ᵉ⬆️\n█ュ\0\0ぬ²⁷\n░ア⁷⁷ᵉ⬆️⁙ヒ³ᵉ…\n█ュ\0\0)¹⁷⁙$\0⁷⁷⁷⁷ᵉそᵉっ⁙ゃ\0ュ\0\0ト◝⁷ᵉそᵉっ⁙{\0ュ\0\0テ◝⁷ᵉそᵉっ⁙█\0ュ\0\0ツ◝⁷ᵉそᵉっ⁙オ\0ュ\0\0チ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉうᵉうᵉうᵉうᵉうᵉうᵉうᵉうᵉ▤ᵉ⬆️\nアュ\0\0ト◝⁷⁙⁸\0⁷\n█ュ\0\0t\0⁷⁷ᵉ▤ᵉ⬆️\nアュ\0\0テ◝⁷⁙⁸\0⁷\n█ュ\0\0た¹⁷⁷⁷ᵉ▤ᵉ⬆️ᵉ⬆️⁙ヒ³⁙ニ\0⁷⁙⁸\0⁷⁙$\0⁷⁷ᵉ▤ᵉ⬆️\nアュ\0\0ツ◝⁷⁙⁸\0⁷\n█ュ\0\0003¹⁷⁷⁷ᵉ▤ᵉ⬆️\nアュ\0\0チ◝⁷⁙⁸\0⁷\n░ュ\0\0=\0⁷⁷⁷ᵉ▤\n█ュ\0\0や²⁷⁙、²⁷⁷ᵉ▤\n█ュ\0\0ら²⁷\n░ケ⁷⁷⁷\n█ュ\0\0わ²⁷⁷ᵉ▤\n█ュ\0\0っ²⁷\n█ュ\0\0:¹⁷⁷⁷ᵉ▤\n█ュ\0\0ア²⁷\n░ュ\0\0>\0⁷⁷⁷\n░ュ\0\0<\0⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0\n█ュ\0\0ワ¹⁷	uu⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙\"⁴⁷\n░	me⁷⁷\n█ュ\0\0ナ²⁷⁷\n█ュ\0\0ヌ²⁷⁷\n█ュ\0\0イ²⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉチ□ス\n░⁙\"⁴⁷\n█ュ\0\0ホ¹⁷⁙Z²⁷⁙⁸\0⁷	uo⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤□ルᵉュ\0\0%\0⁙ᶜ\0⁙5⁴⁷⁙,⁴⁙\"⁴⁷⁙,⁴⁷ᵉ▤\nナ□ル\n█ュ\0\0マ²⁷\n█ュ\0\0003\0⁷⁙\"⁴⁷⁷⁙ニ\0⁷⁷\n█ュ\0\0ス²⁷⁷⁷□ュ\0\0\"\0⁙メ²□ュ\0\0\"\0ᵉ▤⁙$\0⁙$\0⁷ᵉそᵉっ⁙$\0ュ\0\0タ◝⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま□ヲ⁙Z²xュ\0\0タ◝⁷⁙お\0⁷\rspa⁷ᵉそᵉっ⁙r\0ュ\0\0ソ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙L⁴⁷⁙⁸\0⁷⁙$\0⁷\n░ュ\0\0?\0⁷⁷⁷ᵉそᵉっ⁙$\0ュ\0\0セ◝⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま□ヲ⁙Z²xュ\0\0セ◝⁷⁙お\0⁷\rspb⁷ᵉそᵉっ⁙r\0ュ\0\0ス◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙\\⁴⁷⁙⁸\0⁷⁙$\0⁷\n░ュ\0\0@\0⁷⁷⁷□て⁙c²ᵉそᵉっ⁙ゃ\0ュ\0\0シ◝⁷ᵉそᵉっ⁙{\0ュ\0\0サ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\nアュ\0\0サ◝⁷⁙r\0⁷\n░ュ\0\0A\0⁷⁷⁷□ュ\0\0\"\0ᵉら\nアュ\0\0シ◝⁷⁙$\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0\rfff⁷⁙⁸\0⁷⁙t\0⁷\n█ュ\0\0\r³⁷⁷\n░ュ\0\0B\0⁷⁷⁷ᵉそᵉっ⁙$\0ュ\0\0ケ◝⁷□て\nアュ\0\0ケ◝⁷ᵉそᵉっ\n█ュ\0\0⁙³⁷\0⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま□ヲ⁙Z²xュ\0\0ク◝⁷\n█ュ\0\0き²⁷⁷⁙{⁴⁷ᵉそᵉっᵉぬ\n█ュ\0\0•³⁷⁙$\0⁷ュ\0\0ケ◝⁷□ュ\0\0\"\0ᵉ▤⁙♪⁴⁙a\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉうᵉうᵉうᵉ▤\n█ュ\0\0⁘³⁷⁙a\0⁷\n█ュ\0\0‖³⁷⁷ᵉ▤\n█ュ\0\0❎²⁷⁙r\0⁷⁷ᵉ▤⁙▤⁴⁙2¹⁷⁷ᵉ▤⁙い⁴⁙a\0⁷⁷\n░ュ\0\0C\0⁷⁷⁷□ュ\0\0\"\0\n█ュ\0\0リ²⁷□て⁙ニ\0ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま□ヲ⁙カ³tュ\0\0カ◝⁷ᵉそᵉ⬆️ᵉュ\0\0%\0⁙コ³⁙!\0⁷ᵉ…ᵉ▤\n█ュ\0\0し²⁷⁙ス²⁷\n░ュ\0\0D\0⁷⁷⁷ᵉそ□ュ\0\0'\0ᵉぬ⁙つ⁴⁙$\0⁷t█⁷⁙ハ²⁷⁷⁷\rord⁷ᵉそᵉっ⁙A⁴ュ\0\0オ◝⁷ᵉそ□てᵉ…ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0⁙ぬ⁴⁷ᵉ…⁙r\0⁙r\0⁷⁷ᵉ⬆️ᵉ⬆️\n█ュ\0\0;³⁷ᵉ…⁙a\0\n█ュ\0\0♥²⁷⁷⁷ᵉ…ᵉ⬆️⁙め⁴ᵉ…⁙t\0⁙$\0⁷⁷ᵉ⬆️⁙め⁴ᵉ…⁙2¹⁙$\0⁷⁷⁷⁷⁷ᵉそ□ュ\0\0$\0ᵉ⬆️⁙め⁴ᵉ…⁙ニ\0\nアュ\0\0オ◝⁷⁷⁷⁙ゃ\0⁙。\0⁷□ュ\0\0$\0ᵉ⬆️⁙め⁴ᵉ…⁙$\0\n█ュ\0\0G³⁷⁷⁷⁙{\0⁙。\0⁷⁷|⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉさュ\0\0オ◝⁙。\0⁷⁙r\0⁷\n░ュ\0\0E\0⁷⁷⁷□て⁙c²ᵉそᵉっ⁙ゃ\0ュ\0\0エ◝⁷ᵉそᵉっ⁙{\0ュ\0\0ウ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\nアュ\0\0ウ◝⁷⁙r\0⁷\n░ュ\0\0F\0⁷⁷⁷ᵉそ□ュ\0\0'\0ᵉま⁙カ³ᵉ⬆️\n█ュ\0\0/³⁷ᵉ…ᵉ▤⁙ハ²⁙r\0⁷\n░ュ\0\0G\0⁷⁷⁷⁷⁴█⁷ᵉそᵉ⬆️\n█ュ\0\0웃²⁷⁙c²⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙ニ\0\rffg⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0\nきᵉ…⁙ネ³\n█ュ\0\000の²⁷⁷⁷\rfft⁷ᵉそᵉっᵉま⁙カ³ᵉそ□ュ\0\0$\0⁙コ³ᵉぬᵉュ\0\0%\0⁙コ³⁙マ⁴⁷⁙$\0⁷⁙マ⁴⁷\n█ュ\0\0g³⁷⁷⁷\0⁷ᵉそ□ュ\0\0(\0ᵉュ\0\0%\0⁙ᶜ\0⁙ユ⁴⁷⁙い⁴ᵉぬ⁶ュ\0\0#\0⁷⁙$\0⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤ᵉュ\0\0%\0\n█ュ\0\0m³⁷█⁷⁙²⁴⁷ᵉ▤ᵉュ\0\0%\0⁙⁴⁵░⁷⁙ヤ⁴⁷⁷\n█ュ\0\0`²⁷⁷⁷ᵉそᵉっ⁙ニ\0ュ\0\0ウ◝⁷ᵉそᵉっᵉぬ\n█ュ\0\0W³⁷⁙∧²⁷ュ\0\0ウ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙\r⁵⁙∧²⁷\n░ュ\0\0I\0⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤\n░	[[⁷\n█ュ\0\0○³⁷⁷\n░ュ\0█I\0⁷⁷⁷□ュ\0\0\"\0⁙き⁴□ュ\0\0\"\0ᵉ▤⁙r\0⁙a\0⁷ᵉそᵉっ⁙$\0ュ\0\0ウ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…\n█ュ\0\0X³⁷\n░ュ\0\0J\0⁷⁷⁷□ュ\0\0\"\0ᵉ▤⁙$\0⁙r\0⁷□ュ\0\0\"\0\n█ュ\0\0░³⁷ᵉそ\n█ュ\0\0✽³⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙\r⁵⁙a\0⁷\n░ュ▥」J\0⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙$\0⁵i⁷□ュ\0\0\"\0ᵉュ\0\0!\0ᵉュ\0\0%\0⁙ᶜ\0⁙2⁵⁷⁙ネ³⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉぬ\n█ュ\0\0◆³⁷⁙$\0⁷⁙2⁵⁷□ュ\0\0\"\0ᵉ▤⁙9⁵⁙2¹⁷ᵉそᵉ⬆️⁙'\0ᵉ…\n█ュ\0\0⧗³⁷\n░ュ\0\0K\0⁷⁷⁷□ュ\0\0\"\0\n█ュ\0\0웃³⁷ᵉそ\n█ュ\0\0🅾️³⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙9⁵⁙a\0⁷\n░ュ\0\0L\0⁷⁷⁷□ュ\0\0\"\0⁙き⁴□ュ\0\0\"\0ᵉ▤⁙r\0⁙r\0⁷ᵉそᵉっ⁙t\0ュ\0\0ウ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙\r⁵⁙t\0⁷\n░ュ\0\0M\0⁷⁷⁷ᵉそ\n█ュ\0\0x³⁷□ュ\0\0\"\0⁙B⁵ᵉそᵉっ⁙I³ュ\0\0ウ◝⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙\r⁵⁙I³⁷\n░ュ\0\0N\0⁷⁷⁷□てᵉュ\0\0%\0⁙ᶜ\0‖print⁷ᵉそᵉっ⁙ゃ\0ュ\0\0イ◝⁷□て⁙{\0ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま□ヲ⁙Z²xュ\0\0ア◝⁷\n█ュ\0\0006²⁷⁷⁙`⁵⁷ᵉそᵉ⬆️\n█ュ\0\0す³⁷⁙$\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉさュ\0\0ア◝█⁷⁙$\0⁷\n░ュ\0\0O\0⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0\nアュ\0\0イ◝⁷⁙`⁵⁷□て⁙⁸\0ᵉそᵉっᵉま□ヲ⁙Z²xュ\0\0ょ◝⁷⁙h⁵⁷ュ\0\0ゅ◝⁷ᵉそᵉ⬆️\nアュ\0\0ゅ◝⁷⁙r\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉさュ\0\0ょ◝█⁷⁙r\0⁷\n░ュ\0\0P\0⁷⁷⁷ᵉそ□ュ\0\0'\0⁙$\0⁴█⁷ᵉそ□ュ\0\0$\0ᵉチ□ス\n░⁙。\0⁷⁙$\0⁙Z²⁷⁙⁸\0⁷⁙r\0⁙。\0⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙フ⁴⁙$\0⁷\n░ュ\0\0Q\0⁷⁷⁷ᵉそ□ュ\0\0'\0\nき⁙$\0⁷⁴█⁷ᵉそ\n█ュ\0\0り³⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉュ\0\0%\0⁙フ⁴█⁷⁙$\0⁷\n░ュ▥」Q\0⁷⁷⁷ᵉそ□ュ\0\0'\0\n░⁵1⁷⁴█⁷ᵉそ⁙⧗⁵ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙フ⁴\n█ュ\0\0イ³⁷⁷\n░ュ33Q\0⁷⁷⁷ᵉそ□ュ\0\0'\0⁙ヲ¹⁴█⁷ᵉそ⁙⧗⁵ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤⁙ほ³⁙マ\0⁷\n░ュアLQ\0⁷⁷⁷ᵉ⬆️ᵉュ\0\0%\0⁙ᶜ\0」printh⁷\n░■DONE⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ュ\0\0ょ◝⁷⁷⁷⁷⁷ュ\0\0ア◝⁷⁷|⁷⁷⁷\n█ュ\0\0リ³⁷⁷⁷⁷⁷ᵉそᵉっ⁙2¹ュ\0\0ウ◝⁷\n█ュ\0\0ロ³⁷⁷⁷ᵉそᵉっ⁙\"¹ュ\0\0ウ◝⁷⁙ふ⁵⁷⁷⁷⁷□ュ\0\0\"\0ᵉ▤⁙$\0⁙a\0⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙r\0⁙2⁵⁷\n█ュ\0\0◜³⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙a\0⁙2⁵⁷⁙も⁵⁷⁷⁷⁷\n█ュ\0\0\n⁴⁷⁷⁷\n█ュ\0\0⁷⁴⁷⁷⁷⁷⁷ᵉそᵉっ⁙r\0ュ\0\0ウ◝⁷\n█ュ\0\0ᶜ⁴⁷⁷⁷ᵉそᵉっ⁙a\0ュ\0\0ウ◝⁷⁙れ⁵⁷⁷⁷⁷ᵉそ\n█ュ\0\0ᵉ⁴⁷\n█ュ\0\0⁘⁴⁷⁷⁷ᵉそ\n█ュ\0\0■⁴⁷⁙っ⁵⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷ュ\0\0カ◝⁷\n█ュ\0\0-⁴⁷⁷⁷\n█ュ\0\0004⁴⁷⁷⁷⁷⁷ュ\0\0ク◝⁷⁷⁷□て⁙a\0ᵉそ□ュ\0\0$\0⁙ᶜ\0ᵉま□ヲ⁙Z²xュ\0\0コ◝⁷⁙웃⁴⁷⁙{⁴⁷ᵉそᵉっᵉぬ\n█ュ\0\0■³⁷⁙$\0⁷ュ\0\0シ◝⁷\n█ュ\0\0@⁴⁷⁷⁷ュ\0\0コ◝⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0K⁴⁷⁷⁙シ⁵⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷ュ\0\0ナ◝⁷⁷⁷⁷⁷⁷⁴⁷\n█ュ\0\0a⁴⁷⁷⁷⁷\n█ュ\0\0d⁴⁷⁷⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0i⁴⁷⁷ᵉそᵉっ\n░ュ\0\0A¹⁷h⁷⁙ソ⁵⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉうᵉ▤\n█ュ\0\0。²⁷⁙$\0⁷ᵉ▤\nア(⁷⁙2¹⁷⁷\n░ュ\0\0002\0⁷⁷⁷ᵉそ\n█ュ\0\0\r²⁷□てᵉ⬆️\n█ュ\0\0◀²⁷ᵉ…\n█ュ\0\0▶²⁷⁙ネ⁵⁷⁷\n█ュ\0\0★⁴⁷|⁷⁷⁷⁷⁷⁷|⁷0⁷⁷⁷\n█ュ\0\0▤⁴⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0ほ⁴⁷⁷⁷⁷⁷\n█ュ\0\0も⁴⁷⁷⁷⁷\n█ュ\0\0ま⁴⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉそ□ュ\0\0$\0⁙ᶜ\0⁙r\0⁙D¹⁷\n█ュ\0\0る⁴⁷⁷⁷⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…⁙◆¹\n░ノ⁷⁷⁷\n█ュ\0\0ん⁴⁷⁷⁷⁷⁷ᵉそ⁙エ¹\n█ュ\0\0エ⁴⁷⁷⁷⁷⁷ᵉそ⁙エ¹\n█ュ\0\0ク⁴⁷⁷⁷⁷⁷□ュ\0\0\"\0⁙ム¹ᵉそ⁙エ¹\n█ュ\0\0シ⁴⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…⁙◆¹\n░ュ\0█「\0⁷⁷⁷⁙¹⁶⁷⁷⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…⁙◆¹\n░ス⁷⁷⁷\n█ュ\0\0ナ⁴⁷⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉオᵉうᵉ▤\n█ュ\0\0ヨ\0⁷⁙$\0⁷ᵉ▤\nア8⁷⁙t\0⁷⁷ᵉうᵉ▤⁙■⁶⁙r\0⁷ᵉ▤\n█ュ\0\0ホ⁴⁷⁙2¹⁷⁷⁷\n█ュ\0\0キ²⁷⁷⁷ᵉそ⁙エ¹□てᵉ⬆️\n█ュ\0\0マ\0⁷ᵉ…\n█ュ\0\0ミ\0⁷⁙■⁶⁷⁷\n█ュ\0\0ン⁴⁷|⁷⁷⁷⁷⁷⁷|⁷@⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…⁙◆¹⁙⁶⁴⁷⁷ᵉそᵉっᵉぬ\n█ュ\0\0ノ\0⁷⁙$\0⁷D⁷\n█ュ\0\0³⁵⁷⁷⁷⁷⁷⁷ᵉそ\n█ュ\0\0⁙¹⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉオᵉオᵉ▤\n█ュ\0\0チ\0⁷⁙2¹⁷ᵉ▤⁙0⁶⁙a\0⁷⁷ᵉ▤⁙0⁶⁙$\0⁷⁷⁙ヤ⁴⁷⁷ᵉそᵉっᵉぬ⁙0⁶\n█ュ\0\0セ\0⁷⁷H⁷\n█ュ\0\0□⁵⁷⁷⁷⁷⁷⁷ᵉそᵉっ⁙2¹ュ\0\0ゃ◝⁷□ュ\0\0\"\0ᵉュ\0\0!\0\nアュ\0\0ゃ◝⁷⁙$\0⁷\n█ュ\0\0⁵⁵⁷ᵉそ⁙)⁶ᵉそᵉ⬆️⁙'\0ᵉ…ᵉオᵉオᵉ▤\n█ュ\0\0‖⁵⁷⁙2¹⁷ᵉ▤⁙E⁶⁙a\0⁷⁷ᵉ▤⁙E⁶⁙$\0⁷⁷⁙ヤ⁴⁷⁷ᵉそᵉっᵉぬ⁙E⁶⁙6⁶⁷ュ\0\0ゃ◝⁷\n█ュ\0\0#⁵⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉそᵉ⬆️⁙'\0ᵉ…ᵉ▤ᵉ⬆️⁙ユ²ᵉ…\n█ュ\0\0イ\0⁷⁙1¹⁷⁷⁙$\0⁷\n░ろ⁷⁷⁷ᵉそᵉっᵉぬ⁙R⁶⁙$\0⁷P⁷\n█ュ\0\0003⁵⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷█⁷⁷"))
