pico-8 cartridge // http://www.pico-8.com
version 42
__lua__
--[[$lint: ps8_inst, ps8_val, ps8_binder]]function ps8_const(x) return function() return x end end

function ps8_decode(data)
	local pos = 0
	local function byte()
		pos += 1
		return ord(data, pos)
	end
	local function word()
		return byte() >>> 16 | byte() >>> 8 | byte() | byte() << 8
	end
	return function()
		local ctl, v = byte()
		v, ctl = ctl&252 ~= 252 and ctl>>>2&63, ctl%4
		if (ctl == 0) return v and v-31 or word()
		if (ctl == 3) return ({true, false})[v]
		local len = v or word()<<16
		pos += len
		return sub(data, pos-len+1, pos)
	end
end

do
local ps8_ops, ps8_argc = {function()
	local a = ps8_val()
	return function() return ps8_inst[a] end
end}, split"1,0,0,2,2,2,2,3,1,1,3,2,2,2,3,2,2,0,2,2,1,2,1,1,2,2,2,2,2,2,2,2,2,2,2,2,1,3,1,2,1,2,3,3,3,2,1"function run_ps8(bytecode)
	ps8_inst, ps8_val, ps8_binder =
		{}, ps8_decode(bytecode),
		function() ps8_inst, ps8_val, ps8_binder = nil end
	return ps8_ops[ps8_val()]()(ps8_binder())()(--[[$force-safe]]_ENV)
end

local function ps8_runtime(--[[$rename::a]]a, --[[$rename::b]]b, --[[$rename::c]]c)
	local step = ps8_binder
	function ps8_binder()
		a, b, c = a(), b(), c()
		return step()
	end return function()return a end,
function()end,
function(f)return f end,
function(f)a(f)return b(f)end,
function(f)return a(f)(b(f))end,
function(f)return a(f),b(f)end,
function(f)return f[a][b]end,
function(f)f[c]={a(f)}return b(f)end,
function(f)return{a(f)}end,
function(f)return #a(f)end,
function(t,f)t[a(f)]=b(f)return c(t,f)end,
function(f)return a({b(f)},f)end,
function(f)return a(f)[b(f)]end,
function(f)local u={__index=a({}, f)}return function(...)return b(setmetatable({...},u))end end,
function(f)local o=a(f)return o[c](o, b(f))end,
function(...)return a(...)+b(...)end,
function(f)return a(f)==b(f)end,
function(f,v)return v end,
function(...)return a(...)*b(...)end,
function(f)return a(f)~=b(f)end,
function(f)return -a(f)end,
function(...)return a(...)^b(...)end,
function(f)return ~a(f)end,
function(f)return not a(f)end,
function(...)return a(...)..b(...)end,
function(f)return a(f)or b(f)end,
function(...)return a(...)<<b(...)end,
function(...)return a(...)/b(...)end,
function(...)return a(...)-b(...)end,
function(...)return a(...)>><b(...)end,
function(...)return a(...)&b(...)end,
function(...)return a(...)^^b(...)end,
function(...)return a(...)|b(...)end,
function(f)return a(f)>=b(f)end,
function(f)return a(f)and b(f)end,
function(...)return a(...)>>b(...)end,
function(f)return(a(f))end,
function(t,f)t[b]=f[c]return a(t,f)end,
function(f)return @a(f)end,
function(f)f[b]=a(f)end,
function(f)return f[a]end,
function(f)return a(f)>b(f)end,
function(f)if a(f)then return b(f)end return c(f)end,
function(f)f[b][c]=a(f)end,
function(f)local t,k=a(f),b(f)t[k]=c(f,t[k])end,
function(f)return a(f)[b]end,
function(f)return unpack(f,a)end end

for i,n in inext, split"0,0,0,2,2,2,0,2,1,1,3,2,2,2,2,2,2,0,2,2,1,2,1,1,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,0,2,3,1,3,1,0"do
	local function arg(p)
		return p < n
			and ps8_ops[ps8_val()]()
			or ps8_const(p < ps8_argc[i] and ps8_val())
	end
	add(ps8_ops, function()
		return ps8_const(add(ps8_inst, (select(i,
			ps8_runtime(arg(0), arg(1), arg(2))))))
	end)
end
end run_ps8("ま☉…ュ\0\0-\0███。run_ps8…ュ\0\0)\0う█■delix…ュ\0\0-\0う█」printh█‖print…⬆️う█‖print░=hello ᶜ7there♥ら…き▤░そ▤░て▤░ぬ▤░ひ▤░ま▤░も▤░ら█も…ュ\0\0-\0う|██⁵🐱…ュ\0\0-\0う|░█⁵あ…ュ\0\0-\0う|☉█⁵ョ…ュ\0\0-\0う|😐█⁵◝…ュ\0\0-\0う|…█⁵゛…ュ\0\0-\0う|⬆️█⁵゜…ュ\0\0-\0う|▤█⁵Fュ\0\0-\0う|う█⁵F|…⬆️う█⁵t⬆️う█■stat⬆️う█■band██…⬆️█ュ\0\0000\0██…ュ\0\0-\0░|█⁵x…ュ\0\0-\0█ュ\0\0007\0█⁵b…█ュ\0\0009\0…⬆️█▤░Athis is included…⬆️█▤░}#[disable[[this for now/ever]]]…ュ\0\0)\0さ▤░█▤░░░☉t…⬆️█▤そュ\0\0*\0t…⬆️█▤そ░Y#include notaninclude\n…ュ\0\0)\0░5preserved_keyp…ュ\0\0)\0ぬて█ュ\0\0K\0░ュ\0\0{\0😐██l…⬆️█▤ひュ\0\0*\0lュ\0\0*\0p…ュ\0\0)\0░9preserved_globh…ュ\0\0-\0█ュ\0\0M\0█9preserved_glob…⬆️█▤ひュ\0\0*\0█ュ\0\0*\0h…ュ\0\0)\0さ██d…ュ\0\0-\0█ュ\0\0M\0d!whatever…⬆️█▤うd!whatever…ュ\0\0-\0ま████d。subfunc…█ュ\0\0c\0…⬆️█▤もュ\0\0*\0d██。subfunc…ュ\0\0)\0░\rkey`…ュ\0\0)\0ぬて█ュ\0\0g\0█ュ\0\0M\0█ュ\0\0N\0██\\…⬆️█▤ひュ\0\0*\0\\ュ\0\0*\0`…ュ\0\0)\0⬆️う█‖split░Ikey1,key2,key3,123X…ュ\0\0)\0ぬて░■key1█ュ\0\0M\0て░■key2░ュ\0\0マ\0て░■key3░ュ\0\0Y¹█ュ\0\0N\0██T…⬆️█▤ひュ\0\0*\0TうX░…ュ\0\0)\0░■globP…ュ\0\0-\0█ュ\0\0M\0█■glob…⬆️█▤ひ█ュ\0\0Y\0ュ\0\0*\0P…ュ\0\0)\0▤░Ekey1:key2#~~key3,░➡️!key1_still$key2█ア+123-key123\nif\nif◝L…ュ\0\0)\0ぬて░」assertう█」assert█ュ\0\0N\0██H…⬆️うH」assert░⁷き⬆️う█\rallさ▤ぬて░⁵x█ュ\0\0>\0█ュ\0\0N\0██ぬて█ュ\0\0ˇ\0█ュ\0\0?\0█ュ\0\0N\0██…ュ\0\0)\0⬆️うD█▤うD░うD☉@ュ\0\0,\0ろュ\0\0*\0@██…ュ\0\0-\0█ュ\0\0b\0█Usome_future_pico8_api…⬆️う█Usome_future_pico8_api█ュ\0\0B\0…ュ\0\0)\0ぬて░)preserved1█ュ\0\0>\0て░)preserved2█ュ\0\0?\0█ュ\0\0N\0██<…ュ\0\0-\0らう<)preserved1█ュ\0\0>\0<)preserved1…⬆️█▤█ュ\0\0な\0…ュ\0\0)\0⬆️う█1setmetatable▤ぬて░)preserved3█ュ\0\0@\0█ュ\0\0N\0██う█。my_meta<…⬆️█▤う<)preserved3…ュ\0\0-\0█ュ\0\0て\0█)g_my_table…ュ\0\0.\0う█)g_my_table█ュ\0\0そ\0らっ█ュ\0\0>\0…⬆️█▤ュ\0\0/\0█ュ\0\0や\0)preserved1…ュ\0\0-\0█ュ\0\0ま\0█)g_my_table…⬆️█▤ュ\0\0/\0█ュ\0\0や\0)preserved3…ュ\0\0)\0ぬて█ュ\0\0😐\0█ュ\0\0♪\0て░\raddう█\radd█ュ\0\0N\0██8…ュ\0\0)\0ュ\0\0*\00084…⬆️う4」assertろ⬆️う4\radd▤█ュ\0\0]\0█ュ\0\0>\0█ュ\0\0>\0…ュ\0\0)\0█ュ\0\0ゅ\0000…⬆️う0」assertろ⬆️う0\radd█ュ\0\0オ\0█ュ\0\0>\0…ュ\0\0)\0██,き⬆️█ュ\0\0⬆️\0さ▤ぬて█ュ\0\0ˇ\0█ュ\0\0>\0て░⁵y░…█ュ\0\0N\0██ぬて█ュ\0\0ˇ\0█ュ\0\0?\0て█ュ\0\0タ\0░⬆️█ュ\0\0N\0██…ュ\0\0)\0⬆️う(█▤う(░う(☉$ュ\0\0,\0ろュ\0\0*\0$██…⬆️█ュ\0\0♪\0ろュ\0\0*\0,█ュ\0\0?\0…ュ\0\0)\0ぬて█ュ\0\0t\0█ュ\0\0>\0て█ュ\0\0u\0█ュ\0\0?\0て░‖other█ュ\0\0@\0█ュ\0\0N\0██ …ュ\0\0-\0う ‖other ■key1ュ\0\0,\0ろ█ュ\0\0>\0█ュ\0\0007\0█ュ\0\0ロ²ュ\0\0,\0█ュ\0\0ッ\0…ュ\0\0-\0う█\rcos█\rsin…ュ\0\0-\0う█\rsin█\rcos█ュ\0\0レ²ュ\0\0,\0ろ█ュ\0\0>\0█ュ\0\0?\0ュ\0\0,\0█ュ\0\0¹¹…█ュ\0\0ュ\0…█ュ\0\0◜\0…ュ\0\0)\0▤さ█ュ\0\0>\0さ▤█ュ\0\0>\0▤█ュ\0\0?\0▤█ュ\0\0@\0░😐、…ュ\0\0)\0オ█ュ\0\0>\0█ュ\0\0?\0「…ュ\0\0)\0▤█ュ\0\0>\0▤░ュ⁸<¹\0▤░ュ\0\0004□▤░ュxV4□▤ケ█ュ\0\0>\0▤ケ█ュ\0\0ᶜ¹▤ケ█ュ\0\0ᵉ¹▤░ュ\0\0⁸█▤░ュ\0ユ\0ユ▤ケ░ュ\0\0あ▥ケ░ュ◝◝◝◝⁘…ュ\0\0)\0▤░	hi▤░‖hello▤░■\"hi\"▤░。'hello'▤█ュ\0\0%¹▤░■'hi'▤░¹▤█ュ\0\0(¹▤░\ra\nb▤░⁵\\▤░。\0¹²³⁴⁵⁶▤░。¹²³⁴⁵⁶⁷▤░」\\\\\\\\\\\\▤░」\n\n\n\n\n\n░!¹²³⁴⁵⁶]]▮…ュ\0\0)\0▤█ュ\0\0(¹▤█ュ\0\0#¹▤█ュ\0\0'¹▤░」\"'hi'\"▤░Y\"\"\"\"\"'''''hi'''''\"\"\"\"\"▤░■♥♥♥♥▤█ュ\0\0(¹▤░⁵\n░U\\\\\\\\\\\\\\\\\\\n\n]]]=]]===]ᶜ…ュ\0\0)\0▤░ュ\0\0\0◝▤ア█ュ\0\0M¹█ュ\0\0³¹▤ス█ュ\0\0M¹█ュ\0\0³¹▤ケ█ュ\0\0M¹チ█ュ\0\0M¹⁸ュ\0\0,\0ナュ\0\0*\0「…ュ\0\0)\0░x「…ュ\0\0-\0ま██ノ░ュ33¹\0ノ█ュ\0\0³¹ノュ\0\0000\0██ュ\0\0007\0█%tokenhell…⬆️█▤⬆️う█%tokenhell█ュ\0\0@\0…⬆️█▤ヘヘ█ュ\0\0>\0█ュ\0\0>\0ュ\0\0$\0█ュ\0\0?\0ュ\0\0#\0ろ█ュ\0\0@\0█ュ\0\0³¹ュ\0\0\"\0█ュ\0\0³¹ュ\0\0!\0█ュ\0\0チ\0ュ\0\0 \0ヲム█ュ\0\0ナ\0█ュ\0\0>\0ノ█ュ\0\0>\0ノ█ュ\0\0?\0ル█ュ\0\0@\0ユケス█ュ\0\0>\0ス█ュ\0\0³¹█ュ\0\0>\0█ュ\0\0>\0░▤…⬆️█▤ススチアルノュ\0\0%\0ュ\0\0 \0ュ\0\0!\0ュ\0\0\"\0⬆️う█‖tonumオュ\0\0$\0ヘ█ュ\0\0@\0█ュ\0\0³¹█ュ\0\0チ\0█ュ\0\0?\0█ュ\0\0>\0█ュ\0\0?\0█ュ\0\0@\0█ュ\0\0>\0█ュ\0\0>\0ら█ュ\0\0>\0█ュ\0\0@\0█ュ\0\0@\0█ュ\0\0?\0█ュ\0\0>\0…ュ\0\0)\0▤ュ\0\0/\0█ュ\0\0]\0█⬆️█ュ\0\0b\0██⁴き▤ュ\0\0&\0⬆️█ュ\0\0ョ\0▤█ュ\0\0>\0█ュ\0\0?\0ュ\0\0&\0⬆️█ュ\0\0ャ\0ュ\0\0&\0⬆️█ュ\0\0ャ\0██…ュ\0\0)\0█チ\0…ュ\0\0)\0█ノュ\0\0ナ◝き█ュ\0\0⧗¹…ュ\0\0)\0█チュ\0\0ト◝…ュ\0\0)\0█ノュ\0\0テ◝…ュ\0\0)\0ぬて░\rordう█\rordて░\rpalう█\rpal█ュ\0\0N\0██ュ\0\0ツ◝…ュ\0\0)\0▤⬆️█ュ\0\0あ¹░\r123▤⬆️█ュ\0\0う¹さ█ュ\0\0♪¹▤もュ\0\0*\0ュ\0\0ツ◝█ュ\0\0▥¹\rord▤も█ュ\0\0し¹█ュ\0\0こ¹\rpal⬆️█ュ\0\0ョ\0█ュ\0\0>\0ュ\0\0チ◝…ュ\0\0)\0ぬて█ュ\0\0?\0█ュ\0\0@\0て█ュ\0\0ˇ\0█ュ\0\0³¹█ュ\0\0N\0▤ュ\0\0&\0⬆️█ュ\0\0あ¹░⁵1█ュ\0\000の¹ュ\0\0タ◝…ュ\0\0)\0らュ\0\0*\0ュ\0\0チ◝█ュ\0\0>\0ュ\0\0チ◝…き█ュ\0\0⬆️¹…█ュ\0\0ˇ¹█ュ\0\0∧¹|…き█ュ\0\0⧗¹…█ュ\0\0❎¹█ュ\0\0▤¹|…ュ\0\0-\0まュ\0\0'\0█ュ\0\0N\0x█▤█ュ\0\0>\0▤█ュ\0\0?\0▤ュ\0\0&\0⬆️うx\rord█ュ\0\0ぬ¹█ュ\0\0ら¹█\rxxxュ\0\0,\0█ュ\0\0¹¹ュ\0\0,\0█ュ\0\0¹¹█ュ\0\0ケ²ュ\0\0,\0ろ█ュ\0\0>\0█ュ\0\0>\0きュ\0\0&\0⬆️█ュ\0\0⬆️\0█ュ\0\0]\0…ュ\0\0)\0⬆️うュ\0\0ソ◝█▤うュ\0\0ソ◝░うュ\0\0ソ◝☉ュ\0\0セ◝ュ\0\0,\0ろュ\0\0*\0ュ\0\0セ◝██…⬆️█▤ノ░■testノュ\0\0(\0█ま░\rstr…⬆️█▤ららら█ュ\0\0へ¹ヘヘュ\0\0$\0█ュ\0\0웃¹ュ\0\0/\0█ュ\0\0]\0⁵🐱う█\r...ュ\0\0&\0⬆️う█\rxxx███ュ\0\0@\0ケ█ュ\0\0@\0…⬆️█ュ\0\000の\0▤█ュ\0\0し¹ぬて░‖__addまュ\0\0'\0█ュ\0\0N\0xュ\0\0ツ◝ュ\0\0*\0xて░‖__subま█ュ\0\0や¹うx\rsin█ュ\0\0N\0██…ュ\0\0-\0ま█ュ\0\0や¹うx■sret█■sret…ュ\0\0)\0▤うュ\0\0ツ◝☉▤ひら█ュ\0\0し¹█ュ\0\0し¹█ュ\0\0ル¹ュ\0\0/\0ュ\0\0/\0さ█ュ\0\0し¹█░ュ\0\0ス◝…ュ\0\0)\0▤█ュ\0\0あ¹ュ\0\0/\0█ュ\0\0ル¹\rpalュ\0\0シ◝…ュ\0\0)\0▤⬆️█ュ\0\0ョ\0█ュ\0\0@\0▤⬆️ル█ュ\0\0し¹█ュ\0\0し¹█ュ\0\0³¹ュ\0\0&\0⬆️ュ\0\0&\0⬆️う█■sret████ュ\0\0サ◝…ュ\0\0)\0ぬて█ュ\0\0\0²█ュ\0\0ル¹て█ュ\0\0▥¹█ュ\0\0ル¹█ュ\0\0N\0█ュ\0\0ル¹ュ\0\0コ◝き▤う█‖inext█ュ\0\0C\0…ュ\0\0)\0⬆️うュ\0\0ケ◝█▤うュ\0\0ケ◝░うュ\0\0ケ◝☉ュ\0\0ク◝ュ\0\0,\0ろュ\0\0*\0ュ\0\0ク◝██…ュ\0\0)\0ら⬆️█ュ\0\0ョ\0█ュ\0\0チ\0█ュ\0\0@\0ュ\0\0キ◝…ュ\0\0)\0█ュ\0\0>\0ュ\0\0カ◝ュ\0\0,\0ュ\0\0+\0ュ\0\0*\0ュ\0\0カ◝ュ\0\0*\0ュ\0\0キ◝…ュ\0\0)\0ら█ュ\0\0ル¹ュ\0\0$\0█ュ\0\0し¹█ュ\0\0Y\0ュ\0\0オ◝ュ\0\0,\0█ュ\0\0★\0…⬆️█▤░\rsh1ュ\0\0,\0█ュ\0\0★\0…⬆️█▤░\rsh2ュ\0\0,\0█ュ\0\0★\0ュ\0\0,\0░ᵇュ\0\0,\0█ュ\0\0★\0ュ\0\0,\0█ュ\0\0&²…ュ\0\0-\0░1renaming bug█⁵l…ュ\0\0-\0まュ\0\0'\0█ュ\0\0N\0ᶜ█き██…ュ\0\0)\0█チx…ュ\0\0)\0█ノt…ュ\0\0)\0█ムp…ュ\0\0)\0█ルl…ュ\0\0)\0█ュ\0\0 \0h…ュ\0\0)\0█ュ\0\0\"\0d…ュ\0\0)\0█ュ\0\0$\0`…ュ\0\0)\0█ュ\0\0&\0\\…ュ\0\0)\0う|きX…ュ\0\0)\0う|さT…ュ\0\0)\0う|そP…ュ\0\0)\0う|てL…ュ\0\0)\0う|ぬH…ュ\0\0)\0う|ひD…ュ\0\0)\0う|ま@…ュ\0\0)\0う|も<…ュ\0\0)\0う|ら8…ュ\0\0)\0う|ろ4…ュ\0\0)\0う|っ0…ュ\0\0)\0う|ア,…ュ\0\0)\0う|オ(…ュ\0\0)\0う|ケ$…ュ\0\0)\0う|ス …ュ\0\0)\0う|チ、…ュ\0\0)\0う|ナ「…ュ\0\0)\0う|ノ⁘…ュ\0\0)\0う|ヘ▮うᶜ⁵l|█\rfff…⬆️█▤⬆️う█\rfff██…█ュ\0\0008\0…ュ\0\0-\0█ュ\0\0>\0█⁵x…ュ\0\0-\0ま██▤う█)old_memberう░)old_member█!old_name…ュ\0\0-\0ま██き██…█ュ\0\0*²…█ュ\0\0+²█ュ\0\0{²|█!old_name…ュ\0\0-\0ま██ららららら█ュ\0\0Y\0ュ\0\0*\0░ュ\0\0*\0☉ュ\0\0*\0😐ュ\0\0*\0…ュ\0\0*\0⬆️█\rggg…⬆️█▤⬆️う█\rggg▤█ュ\0\0>\0▤█ュ\0\0?\0▤█ュ\0\0³¹▤░う▤█ま░ュ\0\0 \0…ュ\0\0-\0⬆️█▤░■END!█■done██…⬆️█▤░\rsh4█ュ\0\0せ²█ュ\0\0せ²…⬆️█▤░\rsh3█ュ\0\0て²█ュ\0\0て²█ュ\0\0ね²█ュ\0\000は²…ュ\0\0)\0ら█ュ\0\0、²█ュ\0\0?\0ュ\0\0カ◝█ュ\0\0む²…ュ\0\0)\0⬆️█ュ\0\0▮²▤█ュ\0\0■²█ュ\0\0◀²ュ\0\0ク◝█ュ\0\0り²ュ\0\0ケ◝…ュ\0\0)\0⬆️█ュ\0\0ゃ¹▤█ュ\0\0ゅ¹█ュ\0\0エ¹ュ\0\0セ◝█ュ\0\0オ²ュ\0\0ソ◝█ュ\0\0ク²ュ\0\0,\0█ュ\0\0¹¹█ュ\0\0ケ²█ュ\0\0ケ²||█ュ\0\0ヘ²█ュ\0\0ユ²█ュ\0\0リ²…ュ\0\0-\0らう$⁵xらう$⁵yア█ュ\0\0ャ²█ュ\0\0ッ²$⁵x…ュ\0\0)\0⬆️█ュ\0\0ヒ¹さ█ュ\0\0?\0,…ュ\0\0)\0⬆️█ュ\0\0フ\0▤█ュ\0\0ヘ\0█ュ\0\0メ\0$█ュ\0\0	³(…ュ\0\0-\0らう@⁵x█ュ\0\0>\0@⁵x…ュ\0\0)\0⬆️█ュ\0\0え\0▤█ュ\0\0お\0█ュ\0\0こ\0@█ュ\0\0&³D")
__meta:title__

$switch-compiler: parens8
