pico-8 cartridge // http://www.pico-8.com
version 42
__lua__
function const(x) return function() return x end end
function deserialize(data)
	data = all(split(data, 0x4000, false))
	local pos, refs, chunk = 0x4000, {}

	local function advance()
		if (pos == 0x4000) chunk, pos = data(), 0
	end
	local function byte()
		advance()
		pos += 1
		return ord(chunk, pos)
	end
	local function short() return byte() | byte() << 8 end
	local function word() return byte() >>> 16 | byte() >>> 8 | short() end
	
	local function dive()
		local function hash(res)
			res = res or add(refs, {})
			for k,v in function()
				local key = dive()
				return key, key ~= nil and dive()
			end do res[k] = v end
			return res
		end

		local ctl = byte()
		local v = ctl&252 ~= 252 and ctl>>>2&63
		return select(ctl%4+1,
			function()
				return v and v-31 or word()
			end,
			function()
				local len, res = v and v>>>16 or word(), ""
				repeat
					advance()
					local consumed = min(len, 0x4000-pos>>>16)<<16
					res ..= sub(chunk, pos+1, pos+consumed)
					pos += consumed
					len -= consumed>>16
				until len <= 0
				return add(refs, res)
			end,
			function()
				local res = add(refs, {})
				for i=1,v or short() do res[i] = dive() end
				return hash(res)
			end,
			function()
				return select(v,
					const(), const(true), const(false),
					function()
						local id = short()
						return refs[id]
					end,
					hash)()
			end)()
	end

	return dive()
end
function ps8_asm(n, a, b, c)
	if (n>0) return ps8_ops[a[1]](unpack(a,2)), ps8_asm(n-1, b, c)
	return const(a), const(b), const(c)
end

function run_ps8(fir)
	ps8_inst, ps8_binder = {}, const
	return ps8_asm(1, fir)(ps8_binder())()(_ENV)
end

ps8_ops = {function(a)
	return function() return ps8_inst[a] end
end}

for i,n in inext, split"0,0,0,1,2,2,0,2,3,2,3,2,1,1,0,2,2,1,2,2,2,2,2,2,2,1,2,2,2,3,2,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,2,0"do
	add(ps8_ops, function(...)
		return const(add(ps8_inst,
			(select(i, ps8_runtime(ps8_asm(n, ...))))))
	end)
end

function ps8_runtime(--[[$rename::a]]a, --[[$rename::b]]b, --[[$rename::c]]c)
	local step = ps8_binder
	function ps8_binder()
		a, b, c = a(), b(), c()
		return step()
	end return function()return a end,
function()end,
function(f)return f end,
function(f)return{a(f)}end,
function(f)return a(f),b(f)end,
function(f)a(f)return b(f)end,
function(f)return f[a][b]end,
function(f)return a(f)(b(f))end,
function(f)a(f)[b(f)]=c(f)end,
function(f)return a(f)==b(f)end,
function(f)if a(f)then return b(f)end return c(f)end,
function(f)f[c]={a(f)}return b(f)end,
function(f)return #a(f)end,
function(f)f[b]=a(f)end,
function(f)return f[a]end,
function(f)return a(f)>b(f)end,
function(...)return a(...)+b(...)end,
function(t,f)t[b]=f[c]return a(t,f)end,
function(f)local u={__index=a({}, f)}return function(...)return b(setmetatable({...},u))end end,
function(f)return a(f)[b(f)]end,
function(f)return a(f)>=b(f)end,
function(f)return a(f)<=b(f)end,
function(f)return a(f)and b(f)end,
function(f)return a(f)or b(f)end,
function(...)return a(...)..b(...)end,
function(f)return not a(f)end,
function(f)return a(f)<b(f)end,
function(...)return a(...)-b(...)end,
function(f)return a(f)~=b(f)end,
function(t,f)t[a(f)]=b(f)return c(t,f)end,
function(f)return a({b(f)},f)end,
function(f)return(a(f))end,
function(f)return -a(f)end,
function(f)return ~a(f)end,
function(f)return @a(f)end,
function(f)return %a(f)end,
function(f)return $a(f)end,
function(...)return a(...)^b(...)end,
function(...)return a(...)*b(...)end,
function(...)return a(...)/b(...)end,
function(...)return a(...)\b(...)end,
function(...)return a(...)%b(...)end,
function(...)return a(...)<<b(...)end,
function(...)return a(...)>>b(...)end,
function(...)return a(...)>>>b(...)end,
function(...)return a(...)<<>b(...)end,
function(...)return a(...)>><b(...)end,
function(...)return a(...)&b(...)end,
function(...)return a(...)^^b(...)end,
function(...)return a(...)|b(...)end,
function(f)f[b][c]=a(f)end,
function(f)return a(f)[b]end,
function(f)a(f)[c]=b(f)end,
function(f)return unpack(f,a)end end run_ps8(deserialize(chr(peek(0, 17152))..'⁷\n█ュ\0\0~⁴⁷⁷ᵉ▤ᵉまᵉき\n█ュ\0\0p⁴⁷ᵉ⬆️ᵉう ░⁷ᵉう ☉⁷⁷⁷、⁷□てᵉそ\nも、⁷⁙⁵\0⁷ᵉ▤ᵉま\n█ュ\0\0カ⁸⁷「⁷ᵉ▤\n█ュ\0\0ク⁸⁷ᵉ▤\n█ュ\0\0ケ⁸⁷ᵉア□っ□っ□っ□っ□っ□っ⁙f\0x⁘⁷d(⁷H0⁷X4⁷T「⁷t$⁷ᵉ▤ᵉまᵉき⁙テ³ᵉ⬆️⁙)\0⁙R\0⁷⁷p⁷□て⁙エ\0ᵉ▤ᵉま⁙•\0l⁷ᵉ▤ᵉま\n…ᵉき⁙⁶²ᵉ⬆️ᵉうp░⁷ᵉうp☉⁷⁷⁷⁷h⁷□てᵉそ⁙"⁵⁙%⁴⁷⁙⁵\0ᵉ▤□ュ\0\0004\0⁙"⁵p☉⁷ᵉ▤ᵉま⁙V\n`⁷ᵉ▤\n█ュ\0\0H³⁷□て⁙n⁶□てᵉケᵉきᵉうX⁙ソ\n⁷⁙_\0⁷⁙_\0⁷ᵉ▤ᵉきᵉうX⁙テ\n⁷⁙⁵\0⁷ᵉ▤ᵉきᵉうX⁙\0²⁷\n█ュ\0\0き³⁷⁷□ぬᵉき⁙v⁶⁙)\0⁷ᵉ▤\n█ュ\0\0ス⁴⁷ᵉ▤\n█ュ\0\0セ⁴⁷ᵉ▤ᵉきᵉうX⁙➡️⁶⁷⁙)\0⁷□て⁙ヤ¹ᵉき⁙な⁵ᵉ⬆️⁙ヤ¹⁙ュ¹⁷⁷\n█ュ\0\0h	⁷⁷⁷⁷⁷|⁷⁷⁷\n█ュ\0\0Z	⁷⁷ᵉ▤□さ⁙ヒ\0\n█ュ\0\0R³⁷ᵉオ⁙ヌ\0⁙た⁴⁷⁷ᵉ▤⁙た⁶\n█ュ\0\0a	⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁙⁵\0⁷⁷⁷⁷⁷⁷ᵉ▤□さ⁙た⁵\n█ュ\0\0003	⁷⁙な⁵⁷ᵉ▤ᵉまᵉき⁙ゅᵇᵉ⬆️\n█ュ\0\0.	⁷⁙▶ᶜ⁷⁷、⁷\n█ュ\0\0t	⁷⁷⁷⁷⁷ ⁷⁷⁷⁷⁷⁷⁷⁷ュ\0\0ク◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ⁙f\0tX⁷x\\⁷p8⁷□てᵉナ\nヘ⁙テ³⁷ᵉチ⁙i³ᵉム⁙テ³⁙i³⁷⁷⁷ᵉ▤ᵉき⁙⁶²\n░Ubreak outside of loop⁷⁷ᵉア⁙⁵\0⁙エ\0⁷⁷\n█ュ\0\0☉	⁷⁷⁷ュ\0\0キ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ⁙f\0xX⁷`<⁷lt⁷dx⁷p8⁷H、⁷hh⁷\\P⁷D▮⁷t░⁷□てᵉチ\n█ュ\0\0🐱	⁷\n█ュ\0\0ょ²⁷⁷ᵉ▤ᵉき⁙⁶²\n░ireturn outside of function⁷⁷□てᵉナᵉナᵉそᵉオ⁙ヒ\0⁙"⁵⁷\n█ュ\0\0⁷⁴⁷⁷ᵉきᵉうd⁙D³⁷ᵉ⬆️\n█ュ\0\0あ	⁷ᵉうd⁙▤³⁷⁷⁷⁷ᵉチ⁙	⁶\n█ュ\0\0ゅ⁶⁷⁷⁷ᵉア□っ⁙f\0xd⁷ᵉき⁙○⁶⁙⁵\0⁷⁷□ぬ⁙Y⁵ᵉ▤\n█ュ\0\0L⁴⁷ᵉ▤ᵉま⁙5\0T⁷ᵉ▤ᵉま⁙み¹P⁷ᵉ▤ᵉま\n…⁙⬅️²⁷L⁷□て\nュ\0\0!\0ᵉき⁙な⁵⁙*⁵⁷⁷ᵉ▤ᵉきᵉうd⁙\0²⁷ᵉ⬆️⁙ュ¹\nュ\0\0!\0⁙Y⁵⁷⁷⁷\n█ュ\0\0ゅ	⁷⁷□てᵉチᵉチᵉそ\nひ⁙ュ¹⁷⁙_\0⁷⁙ヤ¹⁷⁙テ³⁷ᵉア□っ\n█ュ\0\0+⁷⁷ld⁷□ぬ⁙\n⁵ᵉ▤⁙(	ᵉ▤⁙*	□てᵉケᵉきᵉうl⁙ソ\n⁷⁙_\0⁷⁙_\0⁷ᵉ▤ᵉきᵉうl⁙テ\n⁷⁙⁵\0⁷ᵉア□っ□っ□っ⁙f\0tl⁷xt⁷pp⁷ᵉき⁙カ\0ᵉき\n█ュ\0\0か³⁷⁙サ\0⁷⁷⁷⁷\n█ュ\0\0ら	⁷⁷⁷⁷|⁷⁷ᵉア□っ⁙	⁴tL⁷\n█ュ\0\0=	⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷\n█ュ\0\0オ	⁷⁷⁷ュ\0\0カ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ⁙f\0p$⁷`d⁷d8⁷h`⁷l@⁷x ⁷ᵉ▤ᵉま⁙S	t⁷ᵉ▤ᵉき⁙⁶²\n░	::⁷⁷□てᵉチᵉオ⁙ッ³⁙R\0⁷ᵉそᵉュ\0\0005\0\n█ュ\0\0テ	⁷‖depth⁷⁙"⁵⁷⁷ᵉ▤ᵉき⁙)⁵\n░Ulabel already defined⁷⁷□さ⁙ッ³⁙R\0ᵉュ\0\0 \0□ヲ\n░‖e_len⁷⁙	⁶□ヲ\n░⁙えᶜ⁷⁙"⁵□ヲ\n░‖block⁷⁙)\0□ヲ\n░⁵i⁷⁙っ\0⁙f\0⁷⁷⁷⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0メ	⁷⁷⁷⁷⁷ュ\0\0オ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ⁙f\0ld⁷PX⁷T8⁷XH⁷\\x⁷p@⁷x ⁷ᵉ▤\n█ュ\0\0タ	⁷□ぬᵉ⬆️⁙⁶²⁙ッ³⁷ᵉ▤\n█ナ⁷ᵉ▤\n█ノ⁷□ぬ⁙み¹ᵉ▤ᵉき⁙み	ᵉ⬆️⁙V⁵ᵉア□っ□っ□っ□っ□っ□っ⁙f\0tt⁷dd⁷xh⁷p`⁷hP⁷lT⁷ᵉ▤□ュ\0\0004\0ᵉオ⁙カ\0⁙R\0⁷p█⁷□て\nヘ⁙⁶²⁷ᵉ▤ᵉき⁙ッ³\n░=label not found⁷⁷□てᵉチ⁙"⁵ᵉムᵉュ\0\0005\0⁙⁶²⁙えᶜ⁷⁙"⁵⁷⁷ᵉ▤ᵉき⁙ッ³\n░agoto outside of function⁷⁷ᵉ▤ᵉまᵉナᵉオ⁙カ\0\n█ュ\0\0⁷\n⁷⁷⁙2¹⁷`⁷□てᵉチᵉらᵉュ\0\0005\0⁙⁶²⁙すᶜ⁷⁙4³⁷ᵉムᵉュ\0\0005\0⁙⁶²⁙なᶜ⁷\nひᵉュ\0\0005\0⁙⁶²⁙つᶜ⁷⁷⁷⁷ᵉき⁙ッ³\n░=goto past local⁷⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0」\n⁷⁷⁷\n█ュ\0\0•\n⁷⁷⁷⁷⁷⁷ᵉア□っ□っ⁙f\0x\\⁷t`⁷□て\n█ュ\0\0❎⁸⁷ᵉ▤\n█ュ\0\0▥⁸⁷ᵉ⬆️⁙つ³⁙i³⁷⁷\n█ュ\0\0$\n⁷⁷⁷⁷`⁷⁷⁷|⁷⁷⁷ュ\0\0エ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ⁙f\0\\ュ\0\0コ◝⁷80⁷th⁷\0ュ\0\0タ◝⁷Xュ\0\0ケ◝⁷⁴ュ\0\0イ◝⁷Dュ\0\0エ◝⁷d$⁷xt⁷ュ\0\0ト◝8⁷ュ\0\0ナ◝`⁷Tュ\0\0ク◝⁷lL⁷`ュ\0\0ス◝⁷⁸ュ\0\0チ◝⁷0P⁷Pュ\0\0キ◝⁷<\0⁷ ▮⁷$x⁷4ᶜ⁷Lュ\0\0カ◝⁷@ュ\0\0オ◝⁷ᶜ、⁷Hュ\0\0ソ◝⁷ᵉ▤⁙/⁷ᵉ▤⁙;⁴□てᵉそ⁙サ\0⁙Kᶜ⁷⁙⁵\0□てᵉそ⁙サ\0⁙Vᵇ⁷ᵉ▤⁙を\nᵉ▤ᵉき⁙)⁵⁙█\n⁷⁙ヌ\0⁷⁷□てᵉそ⁙サ\0\n░	if⁷⁷⁙Rᶜ□てᵉそ⁙サ\0\n░‖while⁷⁷⁙Y⁵□てᵉそ⁙サ\0\n░」repeat⁷⁷⁙t\n□てᵉそ⁙サ\0\n░\rfor⁷⁷ᵉき⁙に⁶⁙⁵\0⁷□てᵉそ⁙サ\0\n░‖break⁷⁷⁙ュ⁸□てᵉそ⁙サ\0\n░」return⁷⁷ᵉ⬆️⁙Xᵇ⁙エ\0⁷□てᵉそ⁙サ\0\n░‖local⁷⁷⁙❎\n□てᵉそ⁙サ\0\n░■goto⁷⁷\n█ュ\0\0」⁴⁷□てᵉそ⁙サ\0\n█ュ\0\0チ	⁷⁷ᵉき⁙^ᵇ⁙)\0⁷□てᵉチ\n█ュ\0\0と⁵⁷ᵉル⁙9⁴⁙W⁷⁷⁷ᵉき⁙(⁶⁙エ\0⁷□てᵉそ⁙サ\0\n░⁵?⁷⁷□ぬᵉ⬆️ᵉき⁙cᵇ\n░‖print⁷⁷ᵉき\n█ュ\0\0`⁴⁷ᵉう0█⁷⁷⁷ᵉ▤ᵉま⁙2\0,⁷ᵉ▤ᵉま⁙5\0(⁷ᵉア□っ□っ□っ□っ⁙f\0x,⁷p ⁷t$⁷l(⁷\n█ュ\0\0こ³⁷⁷⁷⁷|⁷ᵉ▤⁙゛	ᵉ▤ᵉま⁙i³、⁷□ぬᵉき\n█ュ\0\0i\n⁷⁙⁵\0⁷ᵉ▤ᵉま⁙2\0「⁷ᵉ▤ᵉま⁙5\0⁘⁷ᵉ▤ᵉま⁙み¹▮⁷□てᵉナᵉき\n█ュ\0\0⁴⁵⁷⁙*⁵⁷ᵉき⁙q\r⁙ヲ²⁷⁷ᵉ▤□ュ\0\0004\0⁙▶ᶜt█⁷ᵉき\n█ュ\0\0-⁵⁷⁙⁵\0⁷⁷□てᵉき\n█ュ\0\0>⁵⁷⁙9⁴⁷ᵉきᵉう\0█⁷ᵉ⬆️\nも「⁷⁙ま⁶⁷⁷□てᵉチᵉスᵉうュ\0\0ナ◝█⁷⁙_\0⁷ᵉう$⁙A\0⁷⁷ᵉア□っ□っ□っ⁙f\0t「⁷x$⁷l▮⁷ᵉ▤ᵉまᵉき⁙○⁶⁙nᵇ⁷p⁷□て\nヘᵉチ⁙ヒ\0ᵉそᵉうp⁙M³⁷⁙つ³⁷⁷⁷ᵉ▤ᵉき⁙‖\nᵉ⬆️ᵉうx%g_results⁷⁙サ\0⁷⁷□ュ\0\0004\0⁙⁶²x⁙C\0⁷⁷\n█ュ\0\0∧\n⁷⁷⁷⁷□て\nヘ\nも▮⁷⁷ᵉ▤ᵉきᵉうュ\0\0ト◝█⁷\n░]statement has no effect⁷⁷ᵉア□っ⁙f\0x「⁷⁙\n⁵⁷⁷\n█ュ\0\0く\n⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ュ\0\0ウ◝█⁷ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ⁙f\0Pュ\0\0ウ◝⁷Xt⁷t@⁷xx⁷@⁘⁷D、⁷pd⁷\\h⁷l`⁷T<⁷ᵉ▤\n█ュ\0\0,³⁷ᵉ▤□さ⁙i³⁙ッ³⁙⁶²⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙ッ³⁙_\0⁷l█⁷ᵉ▤ᵉま⁙ッ³h⁷ᵉ▤ᵉまᵉナᵉチ⁙)\0\n░ュ\0\0◝○⁷⁷⁙⁶²⁷d⁷ᵉ▤ᵉま⁙•\0`⁷□てᵉチᵉチᵉス⁙P⁵\nひ⁙⬅️²⁷⁷\nヘᵉきᵉうx⁙D³⁷ᵉ⬆️ᵉオ⁙⬅️²⁙P⁵⁷ᵉうx⁙▤³⁷⁷⁷⁷⁷\nヘᵉチ⁙に⁶\n█ュ\0\0V\n⁷⁷⁷⁷□ぬᵉき⁙6\n⁙4³⁷ᵉ▤\n█ュ\0\0H¹⁷ᵉ▤\n█ュ\0\0I¹⁷□て⁙ュ¹ᵉ▤ᵉき⁙‖\nᵉ⬆️⁙4³⁙ュ¹⁷⁷□て⁙☉²ᵉ▤ᵉき⁙た⁵⁙Kᶜ⁷□てᵉら⁙⁶²⁙2¹⁷ᵉ▤⁙クᵇ\n█ュ\0\0□ᵇ⁷⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙ッ³⁙_\0⁷l█⁷ᵉ▤\n█ュ\0\0005³⁷ᵉア□っ□っ□っ□っ⁙f\0\\h⁷dx⁷p`⁷`d⁷□ぬ⁙⁵\0ᵉ▤⁙ふ¹ᵉ▤⁙ほ¹□ぬᵉ⬆️⁙_\0⁙q	⁷ᵉ▤⁙`³ᵉ▤⁙b³□てᵉス⁙ヒ\0⁙ヌ\0⁷ᵉ▤□ぬᵉきᵉオ⁙サ\0⁙ヒ\0⁷⁙)\0⁷ᵉ▤⁙ふ¹⁙ほ¹⁷|⁷□て⁙カ\0□てᵉルᵉきᵉうd⁙😐³⁷⁙カ\0⁷\n█ュ\0\0u⁵⁷⁷□てᵉら⁙っ\0⁙4³⁷ᵉ▤ᵉきᵉうd⁙➡️⁶⁷⁙)\0⁷\n█ュ\0\0ワ\n⁷⁷ᵉ⬆️⁙カ\0⁙R\0⁷⁷□てᵉルᵉうt⁙えᶜ⁷⁙た⁴⁷⁙\0ᵉᵉ▤ᵉまᵉうt⁙なᶜ⁷l⁷□てᵉら⁙っ\0ᵉうt⁙すᶜ⁷⁷ᵉ▤\n█ュ\0\0ル\n⁷\n█ュ\0\0²ᵇ⁷⁷ᵉ▤□ぬ⁙%⁴\n█ュ\0\0メ\n⁷|⁷ᵉ▤⁙♥⁵\n█ュ\0\0⁸ᵇ⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0\0ᵇ⁷⁷⁷⁙\0ᵉ⁷⁷⁷|⁷⁷⁷|⁷⁷⁷⁷⁷⁷\n█ュ\0\0¥ᵇ⁷⁷⁷\n█ュ\0\0⁘ᵇ⁷⁷⁷⁷|⁷⁙チ\r⁷⁷⁷⁷⁷⁷⁷⁷L█⁷ᵉ▤□ュ\0\0004\0ᵉナᵉチᵉうx⁙A\0⁷ᵉュ\0\0 \0□ヲ\n░⁙ヌ³⁷⁙つ³□ヲ\n░■_env⁷⁙つ³□ヲ\n█ュ\0\0d\0⁷⁙つ³⁙f\0⁷⁷⁷⁙⁵\0⁷⁷ᵉュ\0\0 \0□ヲ\n█ュ\0\0$ᵇ⁷⁙つ³⁙f\0⁷⁙⁵\0⁷⁷D█⁷ᵉ▤ᵉま⁙Xᵇュ\0\0ア◝⁷□てᵉス⁙"⁵\n█ュ\0\0ニ³⁷⁷ᵉ▤ᵉき⁙cᵇ\n░9unexpected end⁷⁷□ぬᵉきᵉうx⁙y³⁷⁙な⁵⁷ᵉ▤ᵉまᵉきᵉうュ\0\0ょ◝█⁷ᵉ⬆️ᵉうュ\0\0ょ◝░⁷ᵉうュ\0\0ょ◝☉⁷⁷⁷ュ\0\0ゅ◝⁷□てᵉそ\nもュ\0\0ゅ◝⁷⁙⁵\0⁷ᵉア□っ□っ⁙f\0xx⁷pュ\0\0ア◝⁷ᵉ▤ᵉまᵉナᵉチ\n█ュ\0\0#ᵇ⁷ᵉュ\0\0 \0□ヲ⁙%ᵉ⁙)\0□ヲ\n█ュ\0\0%ᵇ⁷⁙)\0□ヲ⁙"ᵉᵉうx⁙C\0⁷⁙f\0⁷⁷⁷⁙⁵\0⁷⁷ᵉュ\0\0 \0□ヲ⁙%ᵉ⁙)\0⁙f\0⁷⁙⁵\0⁷⁷t⁷ᵉ▤ᵉまᵉき⁙サ\0ᵉュ\0\0 \0□ヲ⁙つ³⁙R\0⁙f\0⁷⁙⁵\0⁷⁷l⁷□て⁙ヒ\0ᵉき⁙あ⁶⁙ヒ\0⁷⁙⁵\0⁷⁷⁷⁷ᵉ▤ᵉき\n█ュ\0\0;ᵇ⁷⁙⁵\0⁷ᵉ▤ᵉまᵉき\n█ュ\0\0005ᵇ⁷ᵉ⬆️\n█ュ\0\0006ᵇ⁷⁙Uᵉ⁷⁷ュ\0\0ゅ◝⁷\n█ュ\0\0Xᵇ⁷⁷⁷⁷⁷ュ\0\0ょ◝⁷⁷\n█ュ\0\0Zᵇ⁷⁷⁷⁷⁷⁷ュ\0\0ウ◝⁷⁷ュ\0\0エ◝⁷⁷ュ\0\0オ◝⁷⁷ュ\0\0カ◝⁷⁷ュ\0\0キ◝⁷⁷ュ\0\0ク◝⁷⁷ュ\0\0ケ◝⁷⁷ュ\0\0コ◝⁷⁷ュ\0\0サ◝⁷⁷ュ\0\0シ◝⁷⁷ュ\0\0ス◝⁷⁷ュ\0\0セ◝⁷⁷ュ\0\0ソ◝⁷⁷ュ\0\0タ◝⁷⁷ュ\0\0チ◝⁷⁷ュ\0\0ツ◝⁷⁷⁷ュ\0\0テ◝⁷⁷ュ\0\0ト◝⁷⁷ュ\0\0ナ◝⁷⁷\0⁷⁷⁴⁷⁷⁸⁷⁷ᶜ⁷⁷▮⁷⁷⁘⁷⁷「⁷⁷、⁷⁷ ⁷⁷$⁷⁷(⁷⁷,⁷⁷0⁷⁷4⁷⁷8⁷<⁷@⁷D⁷H⁷|⁷L⁷P⁷|⁷T⁷X⁷\\⁷`⁷d⁷h⁷|⁷⁷⁷⁷|⁷⁷`‖parse⁷ᵉ▤□ぬᵉ⬆️⁙ツ⁷⁙□²⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ag_show_max_items⁷□ュ\0\0004\0⁙5\0`1g_hex_output⁷⁷|⁷ᵉ▤ᵉまᵉュ\0\0 \0□ヲ\n░⁵\0⁷\n░\r000⁷□ヲ\n░⁵ᵉ⁷\n░\r014⁷□ヲ\n░⁵ᶠ⁷\n░\r015⁷⁙f\0⁷⁷⁷⁙⁵\0⁷8⁷□ぬᵉきᵉう`⁙(\0⁷⁙v⁶⁷□ぬᵉき⁙V\rᵉ⬆️ᵉう4░⁷ᵉう4☉⁷⁷⁷ᵉ▤\n█ュ\0\0c⁴⁷ᵉ▤\n█ュ\0\0d⁴⁷□てᵉそ\n█ュ\0\0|⁴⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0ᵉア□っ\n█ュ\0\0o\0⁷l8⁷ᵉ▤ᵉま⁙_\0x⁷□て⁙<²ᵉ▤ᵉまᵉき\n█ュ\0\0u\0⁷⁙*\n⁷p⁷ᵉ▤ᵉまᵉオ⁙ヒ\0⁙サ\0⁷h⁷□て⁙ヌ\0ᵉ▤ᵉまᵉノᵉき⁙/¹ᵉ⬆️⁙)\0ᵉ⬆️⁙_\0⁙⬇️²⁷⁷⁷ᵉノ⁙ヤ⁷ᵉノ⁙ヌ\0ᵉき⁙/¹\n█ュ\0\0o¹⁷⁷⁷⁷⁷█⁷ᵉ▤ᵉまᵉろ⁙カ\0⁙ᵉ\n⁷x⁷ᵉ▤⁙?²\n█ュ\0\0ホᵇ⁷⁷⁷⁷\n█ュ\0\0ニᵇ⁷⁷⁷⁷ᵉノ\n█ュ\0\0ス¹⁷ᵉノ⁙)\0⁙たᵉ⁷⁷⁷⁷⁷`。requote⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉル\n█ュ\0\0♪²⁷⁙F⁴⁷⁙□²□てᵉオᵉうx⁙u³⁷⁙)\0⁷⁙□²□てᵉナᵉそ⁙っ\0⁙つ³⁷ᵉき\n█ュ\0\0j\0⁷ᵉき⁙➡️³\n█ュ\0\0⁵³⁷⁷⁷⁷⁙□²ᵉ▤ᵉま⁙っ\0t⁷ᵉ▤ᵉま⁙_\0p⁷□てᵉら⁙サ\0⁙R\0⁷⁙エ\0□て\nヘᵉきᵉうx⁙ぬ\0⁷ᵉき⁙➡️³\n█ュ\0\0せ³⁷⁷⁷⁷⁙□²ᵉ▤\n█ュ\0\0 ⁴⁷\n█ュ\0\0ョᵇ⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷`5is_identifier⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉま⁙ねᵉt⁷□てᵉそ⁙R\0\n█ュ\0\0j⁵⁷⁷⁙クᵉ□てᵉそ⁙R\0\n░。boolean⁷⁷ᵉナᵉチ⁙)\0\n█ュ\0\0m⁵⁷⁷\n█ュ\0\0p⁵⁷⁷□てᵉそ⁙R\0⁙ッ\r⁷ᵉきᵉうx‖tostr⁷ᵉ⬆️⁙)\0ᵉうx⁙fᵉ⁷⁷⁷□てᵉそ⁙R\0⁙F⁴⁷ᵉきᵉうx⁙つᵉ⁷⁙)\0⁷□てᵉチᵉそ⁙R\0⁙N⁷⁷\n█ュ\0\0;¹⁷⁷ᵉ▤ᵉま⁙⁸	p⁷ᵉ▤ᵉま⁙つ³l⁷ᵉ▤ᵉま⁙つ³h⁷□ぬᵉ⬆️ᵉうx⁙X³⁷⁙)\0⁷□ぬᵉき⁙)⁵ᵉ⬆️ᵉうd░⁷ᵉうd☉⁷⁷⁷ᵉ▤\n█ュ\0\0ᵉ⁷⁷ᵉ▤\n█ュ\0\0ᶠ⁷⁷□てᵉそ⁙4³⁙⁵\0⁷ᵉノ⁙サ\0\n█ュ\0\0ょ³⁷⁷□てᵉそ⁙ヒ\0ᵉうx⁙dᵉ⁷⁷ᵉ▤ᵉまᵉノ⁙サ\0\n░」,<...>⁷⁷p⁷\n█ュ\0\0゜ᶜ⁷⁷□てᵉら⁙ヒ\0⁙つ³⁷ᵉ▤ᵉまᵉノ⁙サ\0⁙*⁵⁷p⁷ᵉ▤ᵉまᵉきᵉうx1value_to_str⁷ᵉ⬆️⁙た⁴⁙_\0⁷⁷X⁷□てᵉそ⁙4³\n█ュ\0\0y⁷⁷⁷ᵉ▤ᵉまᵉノ⁙サ\0⁙⬅️²⁷p⁷ᵉ▤ᵉま⁙4³h⁷ᵉ▤⁙♥⁵□ぬᵉき⁙)⁵ᵉ⬆️\n█ュ\0\0¥ᶜ⁷⁙4³⁷⁷\n█ュ\0\0Oᶜ⁷|⁷⁷⁷⁷□てᵉきᵉうx⁙ょᵉ⁷⁙4³⁷ᵉ▤ᵉまᵉノ⁙サ\0ᵉノ⁙4³ᵉノ⁙ヲ²⁙⬅️²⁷⁷⁷p⁷\n█ュ\0\0004ᶜ⁷⁷ᵉ▤ᵉまᵉノ⁙サ\0ᵉノ⁙,²ᵉノᵉき\n█ュ\0\0)ᶜ⁷ᵉ⬆️⁙4³⁙_\0⁷⁷ᵉノ\n░	]=⁷⁙⬅️²⁷⁷⁷⁷p⁷⁙+ᶠ⁷⁷⁷⁷⁷\n█ュ\0\0Iᶜ⁷⁷⁷⁷⁷⁷|⁷d⁷⁷⁷⁷ᵉノ\n█ュ\0\0`⁶⁷ᵉノᵉき\n█ュ\0\0ᶜᶜ⁷⁙R\0⁷⁙▒⁸⁷⁷⁷⁷⁷⁷⁷⁷⁷`⁙⁙ᶠ⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉそ⁙Z\0⁙%⁴⁷⁙)\0□て⁙Q\nᵉ▤ᵉま⁙\n¹█⁷ᵉ▤ᵉまᵉきᵉうx\rmin⁷ᵉ⬆️\n░オ⁷⁙🅾️⁴⁷⁷t⁷ᵉ▤ᵉま⁙R\0p⁷ᵉ▤⁙m⁵□て⁙o⁵ᵉ▤\n█ュ\0\0く⁴⁷ᵉ▤ᵉま⁙🅾️⁴T⁷ᵉ▤ᵉま\n█ュ\0\0002\0⁷P⁷□て\n█ュ\0\0ヤ³⁷ᵉ⬆️⁙)\0⁙⬅️²⁷ᵉ▤□さ⁙⬅️²ᵉユ⁙ヤ¹⁙R\0⁷ᵉオ⁙Z\0⁙ヤ¹⁷⁷ᵉ▤\n█ュ\0\0ロ³⁷\n█ュ\0\0pᶜ⁷⁷⁷⁷⁷⁷⁷□てᵉら⁙っ\0⁙つ³⁷ᵉ▤ᵉまᵉノ⁙)\0⁙웃¹⁷█⁷ᵉ▤ᵉま\n█ュ\0\0a³⁷h⁷□てᵉそᵉき⁙∧⁶⁙ヌ\0⁷⁙N⁷⁷ᵉ▤ᵉま⁙\n¹d⁷ᵉ▤ᵉまᵉうh⁙M³⁷`⁷ᵉ▤⁙ルᵇ□て⁙n⁶ᵉ▤ᵉまᵉノ⁙)\0⁙2¹⁷█⁷ᵉ▤⁙♥⁵\n█ュ\0\0❎ᶜ⁷⁷⁷□てᵉら⁙V\n⁙つ³⁷ᵉ▤ᵉまᵉノ⁙2¹\n░	, ⁷⁷d⁷ᵉ▤ᵉまᵉノ⁙2¹ᵉき⁙2ᶠ\n█ュ\0\0]	⁷⁷⁷d⁷ᵉ▤⁙た⁶\n█ュ\0\0😐ᶜ⁷⁷⁷⁷\n█ュ\0\0웃ᶜ⁷⁷⁷⁷⁷⁷ᵉ▤ᵉまᵉノ⁙)\0⁙ヌ\0⁷█⁷\n█ュ\0\0○ᶜ⁷⁷⁷⁷⁷\n█ュ\0\0⬆️ᶜ⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0あᶜ⁷⁷⁷⁷`9results_to_str⁷ᵉ▤ᵉきᵉう`■poke⁷ᵉ⬆️\n░ュ\0\0-_⁷⁙_\0⁷⁷ᵉ▤ᵉきᵉう`\rcls⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0\n░	> ⁷`!g_prompt⁷ᵉ▤□ぬᵉ⬆️⁙\n¹ᵉ⬆️⁙_\0⁙つ³⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`。g_input⁷ᵉ▤□ュ\0\0004\0⁙5\0`5g_input_lines⁷□ュ\0\0004\0⁙み¹`5g_input_start⁷⁷⁷|⁷ᵉ▤□ぬᵉ⬆️⁙_\0\n░ア⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`1g_cursor_pos⁷□ュ\0\0004\0⁙5\0`5g_cursor_time⁷⁷|⁷ᵉ▤□ぬᵉ⬆️\n…⁙\n¹⁷⁙_\0⁷ᵉ▤□ュ\0\0004\0⁙2\0`%g_history⁷□ュ\0\0004\0⁙5\0`-g_history_i⁷⁷|⁷ᵉ▤□ュ\0\0004\0⁙□²`。g_abort⁷ᵉ▤□ぬᵉ⬆️⁙つ³⁙_\0⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ig_num_output_lines⁷□ュ\0\0004\0⁙5\0`」g_line⁷⁷|⁷ᵉ▤□ぬ\n█ュ\0\0も⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ig_enable_interrupt⁷□ュ\0\0004\0⁙5\0`Eg_enable_autoflip⁷⁷|⁷ᵉ▤□ュ\0\0004\0\n…ᵉ⬆️⁙&⁸ᵉ⬆️⁙o⁸ᵉ⬆️⁙x⁸ᵉ⬆️⁙b⁸ᵉ⬆️⁙U⁸ᵉ⬆️⁙」⁸ᵉ⬆️⁙b⁸ᵉ⬆️⁙イ⁷ᵉ⬆️\n░ひ⁷ᵉ⬆️⁙&⁸ᵉ⬆️\n█ュ\0\0☉⁵⁷⁙b⁸⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷`‖g_pal⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉナᵉルᵉュ\0\0005\0ᵉき⁙○⁶\nュ\0\0007\0░⁷⁷⁙M³⁷⁙つ³⁷\nヘᵉうx⁙ょᶠ⁷⁷⁷ᵉきᵉうx⁙T\r⁷ᵉ⬆️⁙)\0\n█ュ\0\0ケᶜ⁷⁷⁷ᵉき⁙‖\nᵉ⬆️\n█ュ\0\0⧗\n⁷ᵉき⁙<ᶠ⁙)\0⁷⁷⁷⁷⁷x⁙T\r⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉきᵉうx⁙➡️ᶠ⁷ᵉ⬆️\n░ュ\0\0000_⁷⁙_\0⁷⁷⁷`。unpause⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉア\n█ュ\0\0=ᵇ⁷□て\nュ\0\0!\0ᵉき\n█ュ\0\0ˇ⁸⁷\n░ル⁷⁷⁷ᵉき⁙²▮\n░ヲ⁷⁷⁙⁵\0⁷⁷⁷`!get_keys⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙f\0l`⁷ᵉ▤\n█ュ\0\0キᵇ⁷□ぬ\n█ュ\0\0く²⁷ᵉ▤⁙(	ᵉ▤⁙*	□て⁙Q\nᵉ⬆️⁙カ\0\n█ュ\0\0ᵇ⁷⁷⁷□て⁙<²ᵉ▤ᵉまᵉき\n█ュ\0\0⁴³⁷⁙*\n⁷h⁷ᵉ▤ᵉまᵉケ⁙ヌ\0\n█ュ\0\0g\0⁷⁷d⁷□てᵉケ⁙R\0ᵉナᵉチ⁙2¹\n█ュ\0\0メᶜ⁷⁷\n░ュ\0\0 \0⁷⁷⁷ᵉ▤⁙ゃᵉᵉ▤ᵉま⁙つ³t⁷□て⁙Z\0ᵉ▤ᵉき⁙Z\0ᵉ⬆️⁙カ\0ᵉ⬆️⁙ヌ\0⁙⁙▮⁷⁷⁷□てᵉそ⁙ヌ\0⁙웃¹⁷ᵉ▤⁙ゃᵉᵉ▤\n█ュ\0\0ョᶜ⁷ᵉ▤⁙?²\n█ュ\0\0□\r⁷⁷⁷⁷ᵉ▤ᵉまᵉろ⁙R\0ᵉナᵉチ⁙2¹⁙(²⁷⁙_\0⁷⁷t⁷\n█ュ\0\0²\r⁷⁷⁷⁷\n█ュ\0\0\n\r⁷⁷⁷⁷\n█ュ\0\0ᶜ\r⁷⁷⁷⁷\n█ュ\0\0ルᶜ⁷⁷⁷⁷⁷|⁷⁷⁷`!walk_str⁷ᵉ▤□ュ\0\0004\0ᵉア⁙R³□ぬ⁙ᵉ▮□ぬ⁙2\0□ぬ⁙5\0□ぬᵉきᵉうp⁙;▮⁷ᵉ⬆️⁙)\0ᵉア□っ□っ⁙⁘⁷x░⁷pt⁷□てᵉそ⁙カ\0⁙)\0⁷□ぬᵉ⬆️⁙う¹⁙⁴¹⁷ᵉ▤□ュ\0\0004\0⁙2\0t█⁷□ュ\0\0004\0⁙5\0p█⁷⁷|⁷⁙⁵\0⁷⁷⁷⁷ᵉ▤⁙`³ᵉ▤⁙b³ᵉ▤\n█ュ\0\0.¹⁷□てᵉケ⁙Z\0⁙ヒ\0⁷ᵉ▤□ぬᵉ⬆️⁙ヌ\0⁙2¹⁷ᵉ▤□ュ\0\0004\0⁙2\0x█⁷□ュ\0\0004\0⁙5\0t█⁷⁷|⁷□て\n█ュ\0\0ト⁸⁷ᵉ▤ᵉまᵉろ⁙2¹⁙_\0⁷d⁷ᵉ⬆️⁙テ³ᵉ⬆️⁙i³⁙2¹⁷⁷⁷\n█ュ\0\0000\r⁷⁷⁷\n█ュ\0\0002\r⁷⁷⁷⁷⁷|⁷t⁷x⁷|⁷⁷`!str_i2xy⁷ᵉ▤□ュ\0\0004\0ᵉア⁙R³□ぬ⁙_\0□ぬ⁙□²□ぬᵉき\n█ュ\0\0¥\r⁷ᵉ⬆️⁙)\0ᵉア□っ□っ□っ□っ⁙f\0pt⁷lx⁷t░⁷x☉⁷□てᵉチᵉチᵉそ⁙カ\0⁙⁴¹⁷ᵉそ⁙R\0⁙う¹⁷⁷\n█ュ\0\0⁴\n⁷⁷ᵉ▤□ュ\0\0004\0⁙)\0l█⁷ᵉ▤□ュ\0\0004\0⁙エ\0p█⁷□てᵉチᵉナᵉム⁙カ\0⁙⁴¹⁷ᵉチ\n█ュ\0\0B\r⁷ᵉム⁙R\0⁙う¹⁷⁷⁷⁙y▮⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙)\0⁙_\0⁷l█⁷\n█ュ\0\0G\r⁷⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0P\r⁷⁷⁷⁷⁷ᵉ▤⁙`³ᵉ▤⁙b³ᵉ▤⁙S▮□て\nヘ⁙i³⁷ᵉ▤□ュ\0\0004\0ᵉナᵉチᵉケ⁙う¹⁙2¹⁷⁙ヒ\0⁷ᵉユ⁙ヒ\0⁙_\0⁷⁷x█⁷□て⁙]▮ᵉ▤\n█ュ\0\0.\r⁷ᵉ⬆️⁙テ³⁙2¹⁷⁷\n█ュ\0\0]\r⁷⁷⁷\n█ュ\0\0_\r⁷⁷⁷⁷⁷|⁷t⁷x⁷⁷`!str_xy2i⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉそᵉき⁙∧⁶⁙⁴¹⁷⁙ワ	⁷ᵉきᵉうx⁙;▮⁷ᵉ⬆️⁙)\0ᵉア□っ□っ□っ□っ⁙f\0l😐⁷xx⁷t░⁷p☉⁷ᵉき\n█ュ\0\0タᶜ⁷ᵉ⬆️⁙Z\0ᵉ⬆️ᵉろ⁙R\0ᵉュ\0\0(\0⁙う¹⁙o⁸⁷⁷ᵉ⬆️ᵉろ⁙サ\0ᵉュ\0\0(\0⁙⁴¹⁙U⁸⁷⁷\n█ュ\0\0こ⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉき⁙つ▮ᵉ⬆️ᵉチ⁙)\0ᵉノ\n░\r⁶rw⁷⁙)\0⁷⁷ᵉ⬆️⁙Z\0\n█ュ\0\0゛\r⁷⁷⁷⁷⁷⁷`%str_print⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙ˇ\0`p⁷□ぬᵉき\n█ュ\0\0あ²⁷⁙)\0⁷ᵉ▤⁙(	ᵉ▤⁙*	ᵉ▤⁙,	ᵉ▤⁙I	□ぬ⁙_\0ᵉきᵉうx⁙も▮⁷ᵉ⬆️⁙)\0ᵉ⬆️⁙Z\0ᵉ⬆️⁙う¹ᵉア□っ□っ□っ□っ□っ□っ⁙f\0ht⁷ll⁷th⁷dx⁷\\`⁷xd⁷□てᵉチᵉス⁙テ³⁙*ᵉ⁷ᵉムᵉオ⁙R\0⁙テ³⁷⁙)\0⁷⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙テ³⁙_\0⁷x█⁷\n█ュ\0\0イ\r⁷⁷ᵉ▤ᵉま⁙⁵\0p⁷□てᵉチ\n█ュ\0\0🅾️\r⁷ᵉスᵉオ⁙ヒ\0⁙テ³⁷⁙)\0⁷⁷ᵉ▤ᵉまᵉオ⁙ヌ\0⁙テ³⁷p⁷ᵉ▤ᵉまᵉュ\0\0005\0ᵉうd⁙テᶠ⁷…⁷`⁷□てᵉそ⁙サ\0⁙□²⁷ᵉ▤ᵉまᵉュ\0\0005\0\n█ュ\0\0い\r⁷⬆️⁷`⁷⁙4³⁷□てᵉそ⁙サ\0⁙エ\0⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙ヨ▮▤⁷`⁷⁙4³⁷□てᵉナᵉルᵉき\n█ュ\0\0ヤ\n⁷⁙サ\0⁷⁙F⁴⁷ᵉき\n█ュ\0\0う	⁷ᵉ⬆️⁙サ\0\n…ᵉ⬆️⁙クᵉᵉ⬆️⁙ソᵉ⁙タᵉ⁷⁷⁷⁷⁷⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙ヨ▮う⁷`⁷⁙4³⁷□てᵉオᵉうd⁙u³⁷⁙サ\0⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙ヨ▮き⁷`⁷⁙4³⁷□て\nヘᵉきᵉうd⁙ぬ\0⁷ᵉきᵉうd⁙k\0⁷ᵉ⬆️⁙サ\0⁙_\0⁷⁷⁷⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙ヨ▮さ⁷`⁷⁙4³⁷□てᵉオ⁙た⁴⁙サ\0⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙ヨ▮そ⁷`⁷⁙4³⁷⁙4³⁷⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0ゃ\r⁷⁷⁷⁷⁷⁷⁷⁷⁷d⁷⁷⁷⁷⁷|⁷⁷`=str_print_input⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉきᵉうx■peek⁷\n░ュ\0\0%_⁷⁷t⁷□ぬᵉ⬆️ᵉきᵉうx‖peek2⁷\n░ュ\0\0(_⁷⁷ᵉき\n█ュ\0\0ト\r⁷\n░ュ\0\0*_⁷⁷⁷ᵉ▤⁙「ᵇᵉ▤\n█ュ\0\0い⁸⁷ᵉ▤ᵉきᵉうx」camera⁷⁙⁵\0⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア⁙◜ᶠᵉ▤ᵉきᵉうx」cursor⁷ᵉ⬆️⁙つ³\n░ュ\0\0○\0⁷⁷⁷ᵉ▤ᵉま⁙)\0t⁷ᵉ▤\n█ュ\0\0レᵇ⁷□て\n█ュ\0\0ロᵇ⁷⁙⁵\0ᵉ▤ᵉきᵉうx!rectfill⁷ᵉ⬆️⁙つ³ᵉ⬆️ᵉュ\0\0(\0ᵉうx⁙わᶠ⁷⁙U⁸⁷ᵉ⬆️\n█ュ\0\0ヘ\r⁷ᵉ⬆️ᵉユᵉュ\0\0(\0ᵉろ\n█ュ\0\0メ\r⁷⁙_\0⁷⁙U⁸⁷⁙_\0⁷⁙つ³⁷⁷⁷⁷⁷□てᵉム⁙S■\n█ュ\0\0cᶜ⁷⁷ᵉ▤□ュ\0\0004\0\n█ュ\0\0ヤ\r⁷x⁙わᶠ⁷ᵉ▤⁙ゃᵉ\n█ュ\0\0◝\r⁷⁷⁷ᵉ▤ᵉき⁙つ▮⁙\n¹⁷\n█ュ\0\0ン\r⁷⁷⁷⁷⁷⁷⁷⁷⁷h█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ⁙f\0px⁷ᵉ▤ᵉま⁙)\0x⁷ᵉ▤⁙<³□て⁙>³⁙⁵\0□てᵉらᵉうp⁙わᶠ⁷⁙Z\0⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0⁷ᵉ⁷⁙_\0⁷p⁙わᶠ⁷ᵉ▤ᵉきᵉうp⁙H■⁷ᵉ⬆️⁙つ³ᵉ⬆️ᵉュ\0\0(\0⁙n■⁙U⁸⁷ᵉ⬆️⁙N■ᵉ⬆️ᵉユᵉュ\0\0(\0ᵉろ⁙n■⁙_\0⁷⁙U⁸⁷⁙_\0⁷⁙つ³⁷⁷⁷⁷⁷ᵉ▤⁙ン¹\n█ュ\0\0」ᵉ⁷⁷⁷⁷\n█ュ\0\0◀ᵉ⁷⁷⁷⁷⁷⁷d█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア⁙⁘⁷ᵉ▤ᵉま⁙つ³x⁷□てᵉら⁙カ\0⁙(²⁷⁙⁵\0ᵉ▤ᵉまᵉきᵉうt■pget⁷ᵉ⬆️ᵉろ⁙)\0⁙カ\0⁷ᵉろ⁙Z\0⁙b⁸⁷⁷⁷p⁷ᵉ▤ᵉきᵉうt■pset⁷ᵉ⬆️\n█ュ\0\0!ᵉ⁷ᵉ⬆️\n█ュ\0\0"ᵉ⁷ᵉナᵉチᵉそ⁙サ\0⁙つ³⁷ᵉュ\0\0005\0ᵉうt⁙テᶠ⁷て⁷⁷⁙つ³⁷⁷⁷⁷ᵉ▤⁙?²\n█ュ\0\0002ᵉ⁷⁷⁷⁷⁷⁷⁷`█⁷ᵉ▤ᵉま⁙⁵\0\\⁷ᵉ▤ᵉまᵉア□っ□っ□っ□っ⁙f\0dh⁷xx⁷X`⁷Td⁷ᵉ▤ᵉまᵉノᵉうx⁙うᶠ⁷ᵉノᵉうx⁙こᶠ⁷\n░⁵ ⁷⁷⁷t⁷□ぬᵉきᵉうx⁙e▮⁷ᵉ⬆️⁙R\0ᵉろ\nひ\n█ュ\0\0;ᵉ⁷⁷ᵉうx⁙にᶠ⁷⁷⁷⁷ᵉ▤⁙「ᵇᵉ▤⁙0■ᵉ▤ᵉま⁙み¹h⁷□てᵉら⁙ヌ\0ᵉうx⁙すᶠ⁷⁷ᵉ▤ᵉき⁙)⁵ᵉユ⁙ヌ\0\n█ュ\0\0Hᵉ⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙ヌ\0x⁙すᶠ⁷ᵉ▤□ュ\0\0004\0ᵉきᵉうx\rmid⁷ᵉ⬆️ᵉうx⁙そᶠ⁷ᵉ⬆️⁙つ³ᵉきᵉうx\rmax⁷ᵉ⬆️ᵉユ⁙よ■⁙V■⁷⁙つ³⁷⁷⁷⁷⁷x⁙そᶠ⁷ᵉ▤ᵉまᵉろᵉユ⁙S■⁙よ■⁷\n█ュ\0\0Nᵉ⁷⁷`⁷□てᵉムᵉろ⁙4³⁙ヒ\0⁷⁙つ³⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙ク■⁙_\0⁷x⁙そᶠ⁷\n█ュ\0\0⧗ᵉ⁷⁷□てᵉケ\n█ュ\0\0Zᵉ⁷⁙V■⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙ク■⁙_\0⁷x⁙そᶠ⁷⁙ソ■⁷ᵉ▤ᵉまᵉュ\0\0(\0⁙4³⁙U⁸⁷\\⁷ᵉ▤ᵉき\n█ュ\0\0ム\r⁷ᵉ⬆️⁙つ³ᵉ⬆️⁙た⁴ᵉ⬆️⁙N■ᵉ⬆️ᵉユᵉろ⁙た⁴ᵉュ\0\0(\0⁙よ■⁙U⁸⁷⁷⁙_\0⁷⁙つ³⁷⁷⁷⁷⁷□てᵉら⁙よ■⁙V■⁷ᵉ▤ᵉき⁙ヒ■ᵉ⬆️⁙つ³ᵉ⬆️\n░ュ\0\0~\0⁷ᵉ⬆️⁙N■ᵉ⬆️⁙N■⁙つ³⁷⁷⁷⁷⁷ᵉ▤ᵉきᵉうx⁙•■⁷ᵉ⬆️⁙R\0ᵉ⬆️⁙つ³⁙た⁴⁷⁷⁷ᵉ▤ᵉき⁙つ▮ᵉ⬆️⁙は■ᵉ⬆️⁙つ³ᵉ⬆️⁙た⁴ᵉュ\0\0005\0ᵉうx⁙テᶠ⁷😐⁷⁷⁷⁷⁷□てᵉチᵉチᵉケᵉうx⁙ねᶠ⁷⁙ツ⁷⁷ᵉル⁙)\0⁙□²⁷⁷\nヘᵉうx-g_interrupt⁷⁷⁷ᵉき⁙V⁵ᵉ⬆️ᵉュ\0\0(\0⁙サ\0⁙o⁸⁷ᵉろ⁙た⁴ᵉュ\0\0(\0⁙ヒ\0⁙U⁸⁷⁷⁷⁷⁙⁵\0⁷⁷⁷⁷\n█ュ\0\0😐ᵉ⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷□てᵉム⁙ヌ\0⁙よ■⁷ᵉ▤ᵉき⁙に⁶ᵉ⬆️ᵉユ⁙よ■⁙ヌ\0⁷⁙ヌ\0⁷⁷\n█ュ\0\0ˇᵉ⁷⁷⁙「□⁷⁷⁷⁷⁷|⁷⁷⁷\\⁷ᵉ▤\n█ュ\0\0002¹⁷ᵉ▤ᵉまᵉア□っ⁙░\ntx⁷ᵉ▤ᵉき⁙テ³⁙_\0⁷ᵉ▤□ュ\0\0004\0ᵉユᵉうt⁙わᶠ⁷⁙_\0⁷t⁙わᶠ⁷ᵉ▤ᵉきᵉうt⁙T\r⁷ᵉ⬆️\n░a[enter] (\'esc\' to abort)⁷ᵉ⬆️⁙つ³ᵉ⬆️ᵉュ\0\0(\0\n█ュ\0\0せᵉ⁷⁙U⁸⁷ᵉュ\0\0005\0\n█ュ\0\0(ᵉ⁷☉⁷⁷⁷⁷⁷□て⁙エ\0ᵉ▤ᵉきᵉうt■flip⁷⁙⁵\0⁷ᵉ▤ᵉきᵉうt⁙ンᶠ⁷⁙⁵\0⁷□ぬᵉきᵉうt⁙⁶▮⁷⁙⁵\0⁷ᵉ▤ᵉま\n█ュ\0\0C	⁷l⁷□て\n█ュ\0\0q²⁷\n█ュ\0\0ケᵉ⁷□てᵉそ⁙ヒ\0\n░⁵•⁷⁷ᵉ▤□ュ\0\0004\0⁙エ\0t⁙やᶠ⁷ᵉ▤□ュ\0\0004\0⁙\n¹t1g_str_output⁷ᵉ▤□ュ\0\0004\0⁙•\0t⁙⧗\r⁷⁙□²⁷⁷⁷□てᵉナᵉそ⁙ヒ\0\n░⁵\r⁷⁷ᵉそ⁙ヒ\0⁙웃¹⁷⁷ᵉ▤□ュ\0\0004\0ᵉろᵉうt⁙れᶠ⁷⁙)\0⁷t⁙れᶠ⁷⁙エ\0⁷ᵉ▤ᵉまᵉき⁙⁶²ᵉ⬆️\n█ュ\0\0@	⁷⁙ヒ\0⁷⁷l⁷\n█ュ\0\0エᵉ⁷⁷⁷⁷⁷⁷p⁷⁷⁷⁙⁵\0⁷⁷⁷⁷⁷X⁷□ぬ⁙⁵\0ᵉ▤\n█ュ\0\0メ⁸⁷ᵉ▤\n█ュ\0\0モ⁸⁷□てᵉナ⁙ユᶠᵉうx⁙J□⁷⁷ᵉ▤□ぬᵉきᵉうx⁙い▮⁷ᵉ⬆️\n█ュ\0\0ソᵉ⁷ᵉ⬆️⁙つ³ᵉうx⁙れᶠ⁷⁷⁷⁷ᵉ▤⁙_□⁙a□⁷|⁷□てᵉチᵉスᵉユ⁙ヤ¹\n█ュ\0\0ツᵉ⁷⁷\n█ュ\0\0ぬᶜ⁷⁷⁙ユᶠ⁷ᵉ▤□ぬᵉきᵉうx⁙♪ᶠ⁷ᵉ⬆️⁙j□⁙ユᶠ⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙J□⁷□ュ\0\0004\0⁙5\0x⁙⧗\r⁷⁷|⁷ᵉ▤\n█ュ\0\0ヌᵉ⁷□てᵉチᵉそ\nひ⁙ユᶠ⁷⁙つ³⁷\n█ュ\0\0⬇️ᵉ⁷⁷ᵉ▤□ュ\0\0004\0⁙%⁴x⁙⧗\r⁷□て⁙🐱□ᵉ▤\n█ュ\0\0ヒ\r⁷□てᵉチᵉそ⁙r□⁙つ³⁷⁙🐱□⁷ᵉ▤ᵉき⁙た⁴\nヘ⁙j□⁷⁷□て⁙j□ᵉ▤ᵉまᵉき⁙|¹ᵉ⬆️⁙j□⁙v⁶⁷⁷L⁷ᵉ▤ᵉまᵉき\n█ュ\0\0bᶜ⁷ᵉ⬆️\n█ュ\0\0ネᵉ⁷⁙s□⁷⁷H⁷ᵉ▤ᵉき⁙"⁵⁙☉²⁷ᵉ▤ᵉき\n█ュ\0\0♥\r⁷ᵉ⬆️⁙ュ¹ᵉ⬆️⁙つ³ᵉ⬆️ᵉュ\0\0(\0ᵉユ⁙S■⁙☉²⁷⁙U⁸⁷ᵉュ\0\0005\0\n█ュ\0\0xᵉ⁷█⁷⁷⁷⁷⁷□てᵉム⁙☉²⁙▤□⁷□て\nュ\0\0!\0ᵉき⁙⬅️²⁙☉²⁷⁷\n█ュ\0\0vᶠ⁷□て\n█ュ\0\0🐱ᵉ⁷ᵉ▤ᵉき⁙"⁵⁙_\0⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙S■⁙_\0⁷x⁙わᶠ⁷ᵉ▤ᵉき⁙つ▮ᵉ⬆️⁙て□ᵉ⬆️⁙つ³ᵉ⬆️\n█ュ\0\0モ\r⁷ᵉュ\0\0005\0⁙さ□☉⁷⁷⁷⁷⁷□てᵉうx!g_notice⁷ᵉ▤\n█ュ\0\0⁶ᶠ⁷ᵉ▤\n█ュ\0\0⁸ᶠ⁷ᵉ▤ᵉき⁙つ▮ᵉ⬆️\n█ュ\0\0ᵉᶠ⁷\n█ュ\0\0ᵇᶠ⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙%⁴x⁙め□⁷□てᵉうx5g_notice_time⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0□ᶠ⁷⁙_\0⁷x⁙ゃ□⁷□てᵉそ⁙イ□⁙つ³⁷ᵉ▤□ぬ⁙\n¹ᵉ▤□ュ\0\0004\0⁙2\0x⁙め□⁷□ュ\0\0004\0⁙5\0x⁙ゃ□⁷⁷|⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0~ᵉ⁷⁙_\0⁷x⁙ねᶠ⁷□てᵉそ⁙ス□⁙つ³⁷ᵉ▤□ュ\0\0004\0⁙s□x⁙ねᶠ⁷ᵉ▤ᵉきᵉうx‖color⁷⁙R\0⁷ᵉ▤ᵉき\n█ュ\0\0ハ\r⁷\n█ュ\0\0く⁸⁷⁷□てᵉス⁙S■⁙s□⁷ᵉき\n█ュ\0\0フ\r⁷ᵉ⬆️⁙つ³⁙ほ□⁷⁷⁙⁵\0⁷⁷⁷⁷\n█ュ\0\0&ᶠ⁷⁷⁷⁷\n█ュ\0\0)ᶠ⁷⁷⁷⁙ミ□⁷⁷⁷⁷⁷\n█ュ\0\0-ᶠ⁷⁷⁷⁷⁷\n█ュ\0\0002ᶠ⁷⁷⁷□ぬᵉき\n█ュ\0\0Aᵉ⁷ᵉ⬆️ᵉうx9g_error_output⁷⁙つ³⁷⁷ᵉ▤⁙せᵇᵉ▤⁙たᵇᵉ▤ᵉま⁙み¹<⁷ᵉ▤ᵉき⁙"⁵⁙"³⁷ᵉ▤ᵉき⁙え□ᵉ⬆️\n█ュ\0\0008ᶠ⁷ᵉ⬆️⁙つ³ᵉ⬆️ᵉュ\0\0(\0ᵉユ⁙S■⁙"³⁷⁙U⁸⁷ᵉュ\0\0005\0⁙さ□░⁷⁷⁷⁷⁷□て⁙て□ᵉ▤□ュ\0\0004\0ᵉろ⁙r□⁙☉²⁷x⁙れᶠ⁷\n█ュ\0\0006ᶠ⁷⁷ᵉ▤□ぬᵉ⬆️⁙\n¹ᵉ⬆️⁙つ³ᵉ⬆️⁙つ³\n█ュ\0\0そᶜ⁷⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙こᶠ⁷ᵉ▤□ュ\0\0004\0⁙5\0x⁙すᶠ⁷ᵉ▤□ュ\0\0004\0⁙み¹x⁙そᶠ⁷ᵉ▤□ュ\0\0004\0⁙ぬ³x⁙にᶠ⁷ᵉ▤□ュ\0\0004\0⁙の³x⁙れᶠ⁷ᵉ▤□ュ\0\0004\0\n█ュ\0\0こ²⁷x⁙J□⁷□ュ\0\0004\0ᵉう|▤⁷x⁙リ□⁷⁷⁷⁷⁷⁷⁷|⁷ᵉ▤ᵉき⁙た⁴⁙⁵\0⁷⁙⁷⁙⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁙⁷⁙⁷⁷\n█ュ\0\0hᶠ⁷⁷⁷\n█ュ\0\0jᶠ⁷⁷⁷\n█ュ\0\0lᶠ⁷⁷⁷⁷⁙!⁙⁷⁷⁙!⁙⁷⁷⁷|⁷⁷⁷⁷⁷⁷`⁷⁷d⁷⁷h⁷⁷⁷⁷|⁷⁷⁷`‖_draw⁷ᵉ▤□ぬᵉ⬆️⁙□²\n█ュ\0\0]¹⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ig_in_execute_yield⁷ᵉ▤□ュ\0\0004\0⁙5\0`5g_in_mainloop⁷□ュ\0\0004\0⁙み¹`-g_from_flip⁷⁷⁷|⁷ᵉ▤□ュ\0\0004\0⁙•\0`9g_pending_keys⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤□ぬ⁙h¹ᵉ▤□ュ\0\0004\0⁙2\0x。g_error⁷□ュ\0\0004\0⁙5\0x-g_error_idx⁷⁷|⁷ᵉきᵉうx」assert⁷ᵉ⬆️⁙□²⁙)\0⁷⁷⁷⁷`⁙サ¹⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙ˇ\0tx⁷ᵉきᵉきᵉうx⁙^ᵉ⁷ᵉ⬆️⁙)\0⁙う¹⁷⁷ᵉナ⁙Z\0⁙R\0⁷⁷⁷`-execute_raw⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉきᵉうx⁙I⁙⁷ᵉ⬆️ᵉノ\n░。return ⁷⁙)\0⁷ᵉ⬆️⁙Z\0⁙エ\0⁷⁷⁷⁷`!eval_raw⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉきᵉうx!cocreate⁷\n█ュ\0\0いᶠ⁷⁷t⁷□ぬᵉきᵉうx!coresume⁷ᵉ⬆️⁙R\0⁙)\0⁷⁷ᵉ▤⁙「ᵇᵉ▤⁙0■□てᵉチ⁙サ\0\n█ュ\0\0り\0⁷⁷\n█ュ\0\0めᶠ⁷□て⁙W	ᵉ▤□ぬᵉ⬆️ᵉうx⁙9⁙⁷⁙□²⁷ᵉ▤⁙`³□ュ\0\0004\0⁙5\0x⁙9⁙⁷⁷|⁷⁙ノ□⁷⁙ノ□⁷⁷⁷⁷|⁷⁷⁷`%try_parse⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□ぬᵉき⁙ユ□⁙h¹⁷ᵉ▤⁙(	ᵉ▤⁙*	ᵉノ\n░‖line ⁷ᵉノ\n█ュ\0\0゜⁴⁷ᵉノ\n░‖ col ⁷⁙Vᶠ⁷⁷⁷⁷⁷|⁷⁷`)pos_to_str⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤□ぬᵉ⬆️⁙•\0⁙&⁙⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙⧗\r⁷ᵉ▤□ュ\0\0004\0⁙5\0x⁙やᶠ⁷□ュ\0\0004\0⁙み¹x⁙9⁙⁷⁷⁷|⁷ᵉ▤□ぬ\n█ュ\0\0☉ᶠ⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙)⁙⁷ᵉ▤□ュ\0\0004\0⁙5\0x⁙,⁙⁷□ュ\0\0004\0⁙み¹x⁙.⁙⁷⁷⁷|⁷ᵉ▤ᵉまᵉき\n█ュ\0\0ちᶠ⁷ᵉア□っ\n█ュ\0\0へ²⁷xx⁷ᵉき\n█ュ\0\0けᶠ⁷⁙R\0⁷⁷⁷t⁷□ぬ⁙⁵\0ᵉ▤⁙「ᵇᵉ▤⁙0■□て⁙エ\0ᵉ▤□ぬᵉき\n█ュ\0\0とᶠ⁷⁙R\0⁷ᵉ▤⁙「ᵇ⁙0■⁷|⁷□てᵉそᵉきᵉうx!costatus⁷⁙R\0⁷\n░■dead⁷⁷□てᵉそ\n█ュ\0\0ねᶠ⁷⁙%⁴⁷□て⁙Z\0ᵉ▤ᵉま\n░Yunexpected end of code⁷l⁷□て⁙に⁙ᵉ▤□ぬᵉノ⁙に⁙ᵉノ\n░■\nat ⁷ᵉきᵉうx⁙█⁙⁷ᵉ⬆️⁙)\0ᵉうx⁙;⁙⁷⁷⁷⁷⁷\n█ュ\0\0ひᶠ⁷|⁷ᵉ▤□ュ\0\0004\0⁙ヒ\0x⁙リ□⁷□ュ\0\0004\0⁙•\0x⁙1⁙⁷⁷⁷\n█ュ\0\0ユᶠ⁷⁷⁷ᵉ▤□ぬ⁙%⁴ᵉ▤⁙`³\n█ュ\0\0マᵉ⁷⁷|⁷\n█ュ\0\0ラᶠ⁷⁷⁷⁙ゃ⁙⁷□てᵉチ\n█ュ\0\0スᶜ⁷\nヘᵉうx⁙,⁙⁷⁷⁷ᵉ▤□ュ\0\0004\0\n░urunning, press \'esc\' to abort⁷x⁙ᵇ□⁷ᵉ▤ᵉきᵉうx⁙"⁙⁷⁙⁵\0⁷ᵉ▤ᵉきᵉうx⁙5□⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0⁙%⁴x⁙ᵇ□⁷□ぬᵉきᵉうx⁙⁶▮⁷⁙⁵\0⁷ᵉ▤ᵉまᵉき⁙"⁵ᵉ⬆️ᵉうh░⁷ᵉうh☉⁷⁷⁷d⁷□てᵉそ⁙2¹⁙⁵\0⁷□てᵉうx⁙やᶠ⁷ᵉ▤ᵉま\n░Mcomputation aborted⁷l⁷\n█ュ\0\0ヲᶠ⁷⁷\n█ュ\0\0005▮⁷⁷□てᵉそ⁙2¹\n█ュ\0\000みᵉ⁷⁷ᵉ▤□ュ\0\0004\0⁙エ\0x⁙やᶠ⁷ᵉ▤ᵉまᵉき⁙"⁵ᵉ⬆️\n█ュ\0\0⁵▮⁷⁙2¹⁷⁷d⁷\n█ュ\0\0、▮⁷⁷⁷ᵉ▤ᵉき⁙‖\nᵉ⬆️ᵉうx⁙1⁙⁷⁙2¹⁷⁷\n█ュ\0\0‖▮⁷⁷⁷⁷⁷h⁷⁷⁷⁷⁷□てᵉチᵉチᵉうx⁙イᶠ⁷\n█ュ\0\0ッᶠ⁷⁷\nヘᵉうx⁙.⁙⁷⁷⁷ᵉ▤\n█ュ\0\0¹▮⁷□てᵉチ\nヘ\n█ュ\0\0#▮⁷⁷ᵉうx%holdframe⁷⁷ᵉ▤ᵉき\n█ュ\0\0)▮⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0⁙□²x⁙.⁙⁷\n█ュ\0\0゛▮⁷⁷⁷\n█ュ\0\0-▮⁷⁷⁷\n█ュ\0\0/▮⁷⁷⁷⁷⁷⁙ム⁙⁷⁷⁷|⁷⁷⁷⁷⁷`。execute⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤□ュ\0\0004\0⁙エ\0x⁙)⁙⁷ᵉ▤ᵉきᵉうx‖yield⁷⁙⁵\0⁷□ュ\0\0004\0⁙□²x⁙)⁙⁷⁷⁷⁷`⁙テ\n⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉき⁙○⁶ᵉき\n█ュ\0\0\0▮⁷⁙と\n⁷⁷t⁷ᵉ▤□ュ\0\0004\0⁙エ\0x⁙.⁙⁷ᵉ▤⁙ワᶜᵉき⁙あ⁶⁙R\0⁷⁷⁷⁷⁷x⁙5□⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉき⁙○⁶ᵉき⁙さ⁙\n█ュ\0\0チᶜ⁷⁷⁷t⁷□てᵉうx⁙)⁙⁷ᵉ▤\n█ュ\0\0@▮⁷ᵉ▤ᵉまᵉき⁙○⁶ᵉき⁙さ⁙⁙)\0⁷⁷t⁷\n█ュ\0\0[▮⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙□²x⁙9⁙⁷\n█ュ\0\0J▮⁷⁷⁷⁷⁷x⁙a⁙⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉそ⁙)\0\n█ュ\0\0マᶜ⁷⁷ᵉナᵉら\nひ\n█ュ\0\0▶▮⁷⁷⁙つ³⁷ᵉき⁙²▮⁙3⁘⁷⁷□てᵉそ⁙)\0⁙!▮⁷□て\n█ュ\0\0a▮⁷ᵉき⁙#ᵇᵉ⬆️⁙I⁘⁙_\0⁷⁷ᵉ▤ᵉま\n█ュ\0\0b▮⁷t⁷□てᵉそ⁙R\0⁙ユ⁙⁷ᵉ▤\n█ュ\0\0■▮⁷⁙R\0⁷⁙R\0⁷⁷⁷⁙S⁘⁷⁷⁷x⁙ソ\n⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉうx!_set_fps⁷ᵉ▤ᵉき\n█ュ\0\0q▮⁷ᵉナᵉチᵉう█%_update60⁷\n░ュ\0\0<\0⁷⁷⁙E⁘⁷⁷□てᵉう█‖_init⁷ᵉ▤ᵉき\n█ュ\0\0w▮⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0⁙エ\0x⁙,⁙⁷□て⁙エ\0□てᵉうx=_update_buttons⁷ᵉ▤ᵉき\n█ュ\0\0z▮⁷⁙⁵\0⁷□て⁙ᶠ⁘ᵉ▤\n█ュ\0\0+▮⁷□て\n█ュ\0\0r▮⁷ᵉ▤ᵉき⁙y⁘⁙⁵\0⁷□てᵉう█⁙"⁙⁷ᵉ▤ᵉき\n█ュ\0\0}▮⁷⁙⁵\0⁷ᵉ▤⁙⁶⁘ᵉ▤\n█ュ\0\0I▮⁷ᵉ▤⁙ワᶜ\n█ュ\0\0◆▮⁷⁷⁷⁷⁷\n█ュ\0\0▒▮⁷⁷⁷□てᵉう█。_update⁷ᵉ▤ᵉき\n█ュ\0\0✽▮⁷⁙⁵\0⁷\n█ュ\0\0⬇️▮⁷⁷⁙♪⁘⁷⁷⁷\n█ュ\0\0웃▮⁷⁷⁷\n█ュ\0\0⬅️▮⁷⁷□ュ\0\0004\0⁙□²x⁙,⁙⁷⁷⁷⁷\n█ュ\0\0…▮⁷⁷⁷\n█ュ\0\0★▮⁷⁷⁷`-do_mainloop⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙ˇ\0hx⁷□てᵉき\n█ュ\0\0ク\n⁷ᵉ⬆️⁙)\0\n…ᵉ⬆️\n█ュ\0\0フ	⁷\n░%interrupt⁷⁷⁷⁷⁷⁙ア⁙□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵f⁷\n░⁙5□⁷⁷⁷⁷⁷⁙\n⁘□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵r⁷\n░■repl⁷⁷⁷⁷⁷⁙Cᵉ□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	mi⁷\n░%max_items⁷⁷⁷⁷⁷\n█ュ\0\0 ᶜ⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵h⁷\n░\rhex⁷⁷⁷⁷⁷\n█ュ\0\0\rᶜ⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	cl⁷\n░」colors⁷⁷⁷⁷⁷⁙さ□□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵c⁷\n░■code⁷⁷⁷⁷⁷ᵉ▤ᵉまᵉュ\0\0 \0□ヲ⁙つ³\n█ュ\0\0<ᵉ⁷⁙f\0⁷⁙⁵\0⁷t⁷ᵉ▤ᵉまᵉユ\nひᵉうx⁙まᶠ⁷⁷⁙_\0⁷p⁷ᵉ▤⁙m⁵□て⁙o⁵⁙R\0ᵉ▤□さ⁙R\0⁙ヒ\0ᵉオ\n█ュ\0\0ろ▮⁷ᵉユ\n█ュ\0\0わ▮⁷⁙ヒ\0⁷⁷⁷ᵉ▤⁙♥⁵\n█ュ\0\0イ▮⁷⁷⁷⁷⁷⁷⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	cm⁷\n░。compile⁷⁷⁷⁷⁷ᵉア⁙◜ᶠᵉきᵉうx⁙p⁙⁷⁙)\0⁷⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n█ュ\0\0😐\0⁷\n░■exec⁷⁷⁷⁷⁷ᵉア⁙◜ᶠᵉき⁙う⁙⁙h¹⁷⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵v⁷\n░■eval⁷⁷⁷⁷⁷ᵉア⁙◜ᶠᵉきᵉうx⁙T⁙⁷⁙h¹⁷⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵p⁷\n█ュ\0\0g\n⁷⁷⁷⁷⁷ᵉア\n█ュ\0\0しᵉ⁷ᵉき⁙つ▮ᵉ⬆️ᵉきᵉうt⁙⁙ᶠ⁷⁙)\0⁷⁙メᶠ⁷⁷⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	ts⁷\n░⁙ナᵉ⁷⁷⁷⁷⁷ᵉア⁙◜ᶠᵉき⁙2ᶠ⁙)\0⁷⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░\rrst⁷\n░‖reset⁷⁷⁷⁷⁷ᵉきᵉうx\rrun⁷⁙⁵\0⁷□てᵉき⁙あ⁘ᵉ⬆️⁙)\0\n…\n░⁙1‖⁷⁷⁷⁷ᵉきᵉうx⁙⧗⁘⁷⁙ヌ\0⁷ᵉき\n█ュ\0\0⬆️ᶠ⁷ᵉ⬆️⁙□²\n░Eunknown \\-command⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷`⁙ち⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙R³□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア⁙⁵\0ᵉナᵉチᵉチ⁙)\0ᵉル⁙)\0⁙つ³⁷⁷⁙エ\0⁷⁙□²⁷⁷x█⁷□ぬ⁙⁵\0□てᵉきᵉうp⁙D³⁷\n█ュ\0\0い▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙◜ᶠtp⁷□ュ\0\0004\0⁙a⁷t⁙ょᶠ⁷⁷t█⁷ᵉ▤ᵉまᵉュ\0\0 \0□ヲ\n░)__newindex⁷ᵉア⁙\\⁶ᵉき⁙テ³⁙う¹⁷⁷⁙f\0⁷⁙⁵\0⁷l⁷ᵉ⬆️ᵉきᵉうp⁙p⁴⁷ᵉ⬆️⁙ヒ\0⁙ヒ\0⁷⁷⁙つ³⁷⁷⁷□てᵉき\n█ュ\0\0#■⁷\n█ュ\0\0く▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア\n█ュ\0\0%■⁷□ュ\0\0004\0⁙a⁷t⁙イᶠ⁷⁷t█⁷\n█ュ\0\0003■⁷⁷□てᵉき⁙a‖\n█ュ\0\0せ▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙f‖□ュ\0\0004\0⁙a⁷t⁙A\0⁷⁷t█⁷⁙h‖⁷□てᵉき⁙a‖\n█ュ\0\0と▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア\n█ュ\0\0E⁷⁷□ュ\0\0004\0ᵉナᵉきᵉうx⁙メ\0⁷⁙)\0⁷\n█ュ\0\0V⁷⁷⁷x⁙dᵉ⁷⁷t█⁷⁙h‖⁷□てᵉき⁙a‖\n█ュ\0\000は▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙f‖□ュ\0\0004\0⁙a⁷t⁙fᵉ⁷⁷t█⁷⁙h‖⁷□てᵉき⁙a‖\n█ュ\0\000み▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙v‖□ュ\0\0004\0⁙)\0x⁙テᶠ⁷⁷t█⁷⁙h‖⁷ᵉ▤ᵉきᵉうp⁙>⁙⁷ᵉ⬆️⁙□²\n░aunknown \\-command assign⁷⁷⁷⁙h‖⁷⁷⁷⁷⁷⁷⁷t⁷⁷x⁷⁷`⁙ぬ⁷⁷ᵉ▤□ュ\0\0004\0ᵉき\n█ュ\0\0ヌ⁸⁷⁙o⁸⁷`1g_prev_paste⁷ᵉ▤□ぬᵉ⬆️⁙つ³⁙□²⁷ᵉ▤□ュ\0\0004\0⁙2\0`)g_key_time⁷□ュ\0\0004\0⁙5\0`。g_lower⁷⁷|⁷ᵉ▤ᵉき\n█ュ\0\0きᶜ⁷ᵉ⬆️\n░ュ\0\0\\_⁷ᵉ⬆️⁙ツ⁷⁙(²⁷⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉき⁙²▮ᵉ⬆️\n░ム⁷⁙)\0⁷⁷□てᵉル⁙)\0ᵉうx)g_key_code⁷⁷ᵉ▤□ぬᵉ⬆️⁙)\0⁙つ³⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙と‖⁷□ュ\0\0004\0⁙5\0x⁙あ‖⁷⁷|⁷ᵉナᵉそᵉうx⁙あ‖⁷⁙つ³⁷ᵉチᵉケ\n█ュ\0\0v■⁷⁙ツ⁷⁷ᵉそᵉュ\0\0+\0⁙み‖⁙(²⁷⁙つ³⁷⁷⁷⁷\n█ュ\0\0|■⁷⁷□てᵉそ\n█ュ\0\0o■⁷⁙)\0⁷□ュ\0\0004\0⁙%⁴x⁙と‖⁷⁙⁵\0⁷⁷⁷`■keyp⁷ᵉ▤□ュ\0\0004\0ᵉア⁙R³□ぬ⁙□²ᵉ▤ᵉま⁙⁵\0t⁷ᵉ▤ᵉまᵉア⁙v‖□ぬᵉき⁙ユ□ᵉ⬆️ᵉノ⁙は■⁙チ⁘⁷\n█ュ\0\0Dᵉ⁷⁷⁷ᵉ▤⁙(	ᵉ▤⁙*	ᵉ▤⁙,	□てᵉうx%g_ideal_x⁷ᵉ▤ᵉま\n█ュ\0\0웃■⁷t⁷ᵉ▤ᵉまᵉろ⁙サ\0⁙)\0⁷p⁷□て\nヘᵉチᵉケ⁙サ\0⁙つ³⁷ᵉム⁙サ\0⁙ヒ\0⁷⁷⁷⁙□²ᵉ▤□ュ\0\0004\0ᵉき\n█ュ\0\0Oᵉ⁷ᵉ⬆️ᵉユᵉき\n█ュ\0\0チᵉ⁷ᵉ⬆️\n█ュ\0\0●■⁷⁙⁙▮⁷⁷\n█ュ\0\0Bᵉ⁷⁷⁙_\0⁷⁷x⁙にᶠ⁷ᵉ▤□ュ\0\0004\0⁙R\0x⁙コ‖⁷ᵉ▤\n█ュ\0\0。ᶠ⁷⁙エ\0⁷⁷⁷⁷⁷⁷\n█ュ\0\0う■⁷⁷⁷⁷⁷|⁷⁷t⁷ᵉ▤ᵉま⁙⁵\0l⁷ᵉ▤ᵉまᵉア□っ⁙v‖lx⁷□ぬ\n█ュ\0\0☉■⁷ᵉ▤⁙(	ᵉ▤⁙*	ᵉ▤ᵉまᵉナᵉチᵉら⁙)\0⁙つ³⁷\n░ュ\0\0d\0⁷⁷⁙つ³⁷t⁷ᵉ▤\n█ュ\0\0∧■⁷□ュ\0\0004\0⁙エ\0l█⁷⁷⁷⁷⁷|⁷⁷l⁷ᵉ▤ᵉま⁙⁵\0h⁷ᵉ▤ᵉまᵉア□っ⁙v‖tx⁷ᵉ▤□さ⁙フ⁘ᵉうx⁙むᶠ⁷⁙チ⁘⁷ᵉ▤□ュ\0\0004\0ᵉろ\n█ュ\0\0へ■⁷⁙)\0⁷x⁙むᶠ⁷ᵉ▤□ュ\0\0004\0ᵉオ⁙フ⁘⁙▮◀⁷x⁙こᶠ⁷□てᵉム⁙)\0⁙つ³⁷ᵉ▤□ュ\0\0004\0ᵉろ\nひ⁙チ⁘⁷⁙_\0⁷x⁙にᶠ⁷□ュ\0\0004\0⁙エ\0t█⁷⁷ᵉ▤□ュ\0\0004\0ᵉき⁙ノ‖ᵉ⬆️ᵉユᵉき⁙ヘ‖ᵉ⬆️⁙マ‖ᵉ⬆️\n█ュ\0\0ッᶜ⁷⁙つ³⁷⁷⁷⁙ミ‖⁷⁙_\0⁷⁷x⁙にᶠ⁷ᵉ▤ᵉまᵉき⁙➡️³ᵉ⬆️⁙チ⁘\n█ュ\0\0Cᵉ⁷⁷⁷p⁷□てᵉチᵉル⁙サ\0⁙\n¹⁷ᵉル⁙サ\0⁙웃¹⁷⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙(◀⁙_\0⁷x⁙にᶠ⁷\n█ュ\0\0ら■⁷⁷⁙0◀⁷⁷⁷⁷⁷⁷⁷⁷h⁷ᵉ▤ᵉま⁙⁵\0d⁷ᵉ▤ᵉまᵉア\n█ュ\0\0ふ■⁷□てᵉら\n█ュ\0\0や■⁷⁙つ³⁷□てᵉら⁙ホ⁘\n░ュ\0\0002\0⁷⁷ᵉ▤ᵉきᵉうx\rdel⁷ᵉ⬆️⁙フ⁘ᵉュ\0\0005\0⁙フ⁘█⁷⁷⁷ᵉ▤□さ⁙フ⁘⁙ホ⁘⁙チ⁘⁷ᵉ▤ᵉき⁙‖\nᵉ⬆️⁙フ⁘⁙\n¹⁷⁷ᵉ▤□ュ\0\0004\0⁙ホ⁘x⁙むᶠ⁷⁙0◀⁷⁷⁷⁷\n█ュ\0\0ホ■⁷⁷⁙⁵\0⁷⁷d⁷ᵉ▤ᵉま⁙⁵\0`⁷ᵉ▤ᵉまᵉア⁙6◀□てᵉらᵉろ⁙(◀⁙)\0⁷⁙つ³⁷ᵉ▤□ュ\0\0004\0ᵉノᵉき⁙|¹ᵉ⬆️⁙チ⁘ᵉ⬆️⁙_\0ᵉユ\n█ュ\0\0ユ■⁷⁙_\0⁷⁷⁷⁷ᵉき⁙|¹ᵉ⬆️⁙チ⁘ᵉろ⁙Z◀⁙_\0⁷⁷⁷⁷x⁙こᶠ⁷ᵉ▤□ュ\0\0004\0⁙Z◀x⁙にᶠ⁷⁙0◀⁷⁷⁙⁵\0⁷⁷`⁷ᵉ▤\n█ュ\0\0006ᵉ⁷ᵉ▤ᵉまᵉア⁙6◀ᵉ▤□ュ\0\0004\0ᵉノᵉき⁙|¹ᵉ⬆️⁙チ⁘ᵉ⬆️⁙_\0\n█ュ\0\0エ■⁷⁷⁷⁷ᵉノ⁙)\0ᵉき⁙|¹\n█ュ\0\0ゃ■⁷⁷⁷⁷x⁙こᶠ⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙(◀⁙っ\0⁷x⁙にᶠ⁷⁙0◀⁷⁷⁷\\⁷ᵉ▤ᵉまᵉナᵉきᵉうp⁙ソ\n⁷ᵉ⬆️\n█ュ\0\0l■⁷\n░ュ\0\0ナ\0⁷⁷⁷ᵉき\n█ュ\0\0ᵉ□⁷ᵉ⬆️⁙x◀\n░ュ\0\0ノ\0⁷⁷⁷⁷X⁷ᵉ▤ᵉまᵉナᵉき⁙{◀ᵉ⬆️⁙x◀\n░ュ\0\0ニ\0⁷⁷⁷ᵉき⁙{◀ᵉ⬆️⁙x◀\n░ュ\0\0ハ\0⁷⁷⁷⁷T⁷ᵉ▤ᵉま⁙{‖P⁷□てᵉきᵉうp⁙り‖⁷\n░ュ\0\0P\0⁷⁷□てᵉらᵉうp⁙にᶠ⁷⁙_\0⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0#□⁷⁙_\0⁷p⁙にᶠ⁷ᵉ▤□ュ\0\0004\0⁙エ\0x█⁷ᵉ▤ᵉまᵉき⁙{◀⁙o⁸⁷L⁷□てᵉナᵉル⁙ュ¹ᵉうp⁙⬆️‖⁷⁷ᵉそ⁙ヤ¹\n░ュ\0\0コ\0⁷⁷⁷ᵉ▤ᵉき⁙た⁴⁙ュ¹⁷ᵉ▤□ュ\0\0004\0⁙ュ¹p⁙⬆️‖⁷□てᵉナᵉそ⁙ヤ¹\n░ュ\0\0る\0⁷⁷ᵉそ⁙ヤ¹\n░ュ\0\0シ\0⁷⁷⁷□てᵉチᵉルᵉうp⁙こᶠ⁷⁙\n¹⁷ᵉル\n█ュ\0\0006□⁷\n█ュ\0\0*□⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙な◀p⁙⬆️‖⁷ᵉ▤ᵉきᵉうp」printh⁷ᵉ⬆️⁙な◀\n░‖@clip⁷⁷⁷□て\n█ュ\0\0004□⁷ᵉ▤□ュ\0\0004\0⁙\n¹p⁙こᶠ⁷ᵉ▤□ュ\0\0004\0⁙_\0p⁙にᶠ⁷ᵉ▤□ュ\0\0004\0\n░}press again to put in clipboard⁷p⁙め□⁷□てᵉき⁙{◀\n░ュ\0\0x\0⁷⁷ᵉ▤ᵉま⁙⁵\0H⁷ᵉ▤ᵉまᵉきᵉうp」serial⁷ᵉ⬆️\n░ュ\0\0\0⁸⁷ᵉ⬆️\n░ュ\0\0█_⁷\n░ュ\0\0█\0⁷⁷⁷⁷H⁷ᵉ▤ᵉき⁙た⁴ᵉきᵉうp⁙◝\0⁷ᵉきᵉうp⁙#■⁷ᵉ⬆️\n█ュ\0\0H□⁷⁙☉²⁷⁷⁷⁷□てᵉそ⁙☉²⁙つ³⁷□て⁙テ³ᵉ▤□ぬ⁙s□ᵉ▤□ュ\0\0004\0⁙2\0p⁙ねᶠ⁷□ュ\0\0004\0⁙5\0p⁙コ‖⁷⁷|⁷ᵉ▤□ュ\0\0004\0ᵉろᵉうp⁙あ‖⁷⁙_\0⁷p⁙あ‖⁷ᵉきᵉうp⁙ンᶠ⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0^□⁷⁷\n█ュ\0\0c□⁷⁷⁷⁷⁷\n█ュ\0\0`□⁷⁷⁷⁷⁷\n█ュ\0\0f□⁷⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙\n¹p⁙め□⁷\n█ュ\0\0e□⁷⁷⁷⁙モ◀⁷⁷⁷\n█ュ\0\0o□⁷⁷⁷⁷⁷\n█ュ\0\0s□⁷⁷□てᵉき\n█ュ\0\0 □⁷\n░ュ\0\0O\0⁷⁷□てᵉス⁙⧗◀\nひ⁙な◀⁷⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙⧗◀⁙_\0⁷p⁙にᶠ⁷\n█ュ\0\0t□⁷⁷⁙ユ◀⁷□てᵉき⁙リ◀\n░ュ\0\0R\0⁷⁷□てᵉチᵉナ⁙⬅️²\nヘᵉき⁙R\0⁙{‖⁷⁷⁷ᵉらᵉうp⁙むᶠ⁷⁙_\0⁷⁷ᵉ▤ᵉき⁙ヌ\0⁙{‖⁷⁙ユ◀⁷⁙ユ◀⁷□てᵉき⁙リ◀\n░ュ\0\0Q\0⁷⁷□てᵉチᵉナ⁙⬅️²\nヘᵉき⁙R\0⁙_\0⁷⁷⁷ᵉム\n█ュ\0\0░□⁷\nひᵉうp⁙まᶠ⁷⁷⁷⁷ᵉ▤ᵉき⁙ヌ\0⁙_\0⁷⁙ユ◀⁷⁙ユ◀⁷ᵉ▤ᵉまᵉき⁙{◀⁙!▮⁷D⁷ᵉ▤ᵉまᵉきᵉうp\rord⁷⁙|²⁷P⁷□てᵉそ⁙|²⁙ユ⁙⁷□てᵉそ\n█ュ\0\0y□⁷⁙つ³⁷ᵉ▤ᵉきᵉうp」extcmd⁷\n░‖pause⁷⁷⁙ユ◀⁷ᵉ▤□ぬ⁙•\0ᵉ▤□ュ\0\0004\0⁙2\0p⁙⧗\r⁷□ュ\0\0004\0⁙5\0p⁙リ□⁷⁷|⁷ᵉ▤ᵉき⁙2¹⁙⁵\0⁷⁙ユ◀⁷⁷⁷□てᵉナᵉそ⁙|²\n█ュ\0\0りᵉ⁷⁷ᵉそ⁙|²⁙웃¹⁷⁷□て⁙v⁶ᵉ▤ᵉき⁙た⁴⁙웃¹⁷⁙ユ◀⁷ᵉ▤ᵉきᵉうp⁙‖⁘⁷⁙な◀⁷□て\nヘᵉうp⁙⧗\r⁷⁷\n█ュ\0\0と□⁷\n█ュ\0\0す□⁷⁷⁷⁷□てᵉチ⁙⬅️²ᵉき⁙リ◀\n░ュ\0\0(\0⁷⁷⁷ᵉ▤ᵉき\n█ュ\0\0な□⁷ᵉ⬆️⁙な◀⁙エ\0⁷⁷⁙?▶⁷□てᵉチᵉチᵉル⁙|²⁙\n¹⁷ᵉケ⁙ヤ¹⁙#◀⁷⁷ᵉム⁙ヤ¹\n░ュ\0\0あ\0⁷⁷⁷□てᵉチᵉうp⁙う‖⁷ᵉケ⁙ヤ¹\n█ュ\0\0I□⁷⁷⁷ᵉ▤ᵉまᵉき\n█ュ\0\0N□⁷ᵉユ⁙ヤ¹\n░ュ\0\0?\0⁷⁷⁷D⁷ᵉ▤ᵉき⁙た⁴⁙|²⁷⁙ユ◀⁷⁷\n█ュ\0\0ゃ□⁷⁷□てᵉそ⁙ヤ¹\n░ュ\0\0り\0⁷⁷⁙>▶□てᵉそ⁙ヤ¹\n░ュ\0\0ら\0⁷⁷ᵉ▤ᵉき⁙ヒ\0⁙{‖⁷⁙ユ◀⁷□てᵉそ⁙ヤ¹\n░ュ\0\0ろ\0⁷⁷ᵉ▤ᵉき⁙ヒ\0⁙_\0⁷⁙ユ◀⁷□てᵉそ⁙ヤ¹\n░ュ\0\0ょ\0⁷⁷ᵉ▤□ュ\0\0004\0\nヘ\n█ュ\0\0り□⁷⁷p⁙う‖⁷ᵉ▤□ぬᵉ⬆️ᵉノ\n░Ishift now selects ⁷ᵉナᵉチ⁙p▶\n░!punycase⁷⁷\n░。symbols⁷⁷⁷\n█ュ\0\0ふ□⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0p⁙め□⁷□ュ\0\0004\0⁙5\0p⁙ゃ□⁷⁷|⁷⁙ユ◀⁷⁷□てᵉき⁙リ◀\n░ュ\0\0J\0⁷⁷□て⁙⬅️²ᵉ▤\n█ュ\0\0@□⁷⁙ャ◀⁷\n█ュ\0\0カ□⁷⁷□てᵉき⁙リ◀\n░ュ\0\0M\0⁷⁷□て⁙⬅️²ᵉ▤□ュ\0\0004\0ᵉろ⁙"▶⁙_\0⁷p⁙にᶠ⁷⁙ャ◀⁷\n█ュ\0\0コ□⁷⁷□てᵉき⁙リ◀\n░ュ\0\0*\0⁷⁷ᵉ▤ᵉき⁙4³⁙{‖⁷⁙ユ◀⁷□てᵉき⁙リ◀\n░ュ\0\0L\0⁷⁷ᵉ▤ᵉき⁙4³⁙つ³⁷⁙ユ◀⁷⁙ユ◀⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷x⁷⁷`⁙웃⁘⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□ぬᵉき⁙さ⁙ᵉき⁙❎⁙⁙Z\0⁷⁷ᵉ▤⁙(	ᵉ▤⁙*	□て⁙Aᶜᵉ▤ᵉきᵉうx⁙ふ◀⁷ᵉノ\n░。error #⁷ᵉノ⁙)\0ᵉノ\n░	: ⁷⁙サ\0⁷⁷⁷⁷ᵉ▤ᵉき⁙つ▮ᵉノ\n█ュ\0\0 ⁙⁷ᵉノ⁙)\0\n░ョP\0\0\0\npico8 broke something again,\nthis cart may not work.\npress any button to ignore⁷⁷⁷⁷□てᵉそᵉきᵉうx■btnp⁷⁙⁵\0⁷⁙つ³⁷ᵉ▤⁙⁶⁘\n█ュ\0\0000⁙⁷⁷ᵉきᵉうx⁙❎ᶠ⁷⁙⁵\0⁷⁷⁷⁷⁙⁵\0⁷⁷⁷|⁷⁷`!selftest⁷ᵉ▤ᵉきᵉう`⁙や▶⁷ᵉ⬆️⁙_\0ᵉア⁙ˇ\0ᵉき⁙:‖ᵉそᵉュ\0\0005\0ᵉき⁙○⁶ᵉき\n█ュ\0\0フ▮⁷\n░ね(function (...) return ... end)(1,2,nil,nil)⁷⁷⁷⁙M³⁷⁙o⁸⁷⁷⁷⁷⁷ᵉ▤ᵉき\n█ュ\0\0009⁙⁷ᵉ⬆️⁙(²ᵉア⁙ˇ\0ᵉき⁙:‖ᵉそᵉきᵉき⁙っ▶\n░ョJ\0\0\0function() local temp, temp2 = {max(1,3)}, -20;return temp[1] + temp2; end⁷⁷⁙⁵\0⁷\nュ\0\0"\0\n░ら⁷⁷⁷⁷⁷⁷⁷ᵉ▤ᵉきᵉう`⁙ふ◀⁷\n░!finished⁷⁷ᵉ▤ᵉきᵉう`■stop⁷⁙⁵\0⁷□て⁙エ\0□てᵉう`⁙ᶜ⁘⁷ᵉ▤ᵉき\n█ュ\0\0R⁙⁷⁙⁵\0⁷ᵉ▤ᵉきᵉう`⁙웃⁘⁷⁙⁵\0⁷ᵉ▤ᵉきᵉう`⁙"⁙⁷⁙⁵\0⁷ᵉ▤ᵉきᵉう`⁙5□⁷⁙⁵\0⁷\n█ュ\0\0_⁙⁷⁷⁷⁷⁷\n█ュ\0\0\\⁙⁷⁷⁙⁵\0⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷□て\nヘᵉきᵉう`⁙a\0⁷ᵉ⬆️⁙♥ᵉ\n░	\'\n⁷⁷⁷⁷ᵉ▤□さ⁙⁵³\n█ュ\0\0}⁴⁷⁙♥ᵉ⁷□ぬᵉき⁙V\rᵉ⬆️\n█ュ\0\0アᵇ⁷⁙♥ᵉ⁷⁷\n█ュ\0\0え⁙⁷|⁷⁷\n█ュ\0\0▤⁙⁷⁷⁷⁷⁷|⁷4⁷⁷⁷⁷⁷⁷<⁷ᵉ▤□さᵉう`⁙u³⁷⁙⬇️³⁙エ\0⁷ᵉ▤\n█ュ\0\0ュ⁴⁷\n█ュ\0\0ち⁙⁷⁷⁷⁷⁷D⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉ▤□さ⁙v⁶ᵉオ⁙た⁴⁙ュ¹⁷ᵉオ⁙⬅️²⁙ュ¹⁷⁷ᵉ▤\n█ュ\0\0る⁴⁷\n█ュ\0\0も⁙⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷ᵉ▤□さ⁙R\0⁙ヌ\0⁙2¹⁷□てᵉそᵉきᵉう█⁙😐³⁷⁙2¹⁷⁙ワ	⁷ᵉ▤□さ⁙サ\0⁙ヌ\0⁙エ\0⁷□ぬᵉき⁙ッ³ᵉ⬆️\n█オ⁷⁙ヌ\0⁷⁷\n█ュ\0\0ケ⁙⁷|⁷⁷\n█ュ\0\0ウ⁙⁷⁷⁷⁷⁷⁷|⁷l⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁷⁷'))
__gfx__
e0cc608870e08921cf00004300a008087008d1073783f51637d670e08921cf0000430031500008d12757e6f507378370e08921cf000043003150000812073783
f596e6374770e08921cf000043003150000892073783f52696e646562770e08921cf0000430031500008d1073783f5f6073770e08921cf0000430031500008d2
073783f52757e64796d65670210be049a0cb0870e049a00931500070a0080a707070e089e08be0c9c708708770e089e08be0c9c748704770e089e08be0c9c788
700770210be00ae0c90851071696273770a008c97070210be00ae0c9c60870e049e0c9c64870e0c9c688707070e089e08ba008ca708670e089e08ba0084b7046
7021cae08aa0cb867031500070e089e08ba0cb47700670e089210ba048b070e08921cf00004300312300065376f556e61626c656f5275607c67021cf00004300
315300061376f5c6163747f56716c657567070c770e08921cf00004300e0cc218c60c870070670e089e08ba04ba0cb4870708770e089e08ba0480870477021ca
e00ca0080f70a0cb87707031500021cae08ae00ae0c907d037572670e049a008cf0000620070e04931250031250070707031920070312500e089e08be04c3125
00a008cf0000920070704770a008cf000063007070707070707006d19637f6e656f66670e08921cf00004300e0cc218ca008cf0000420070870670e00ae0c987
31850070e049319200e04931a50031a5007070707006113757261370210be049e00ae0c906513707c6964770a0485816c226c266c2e6c227c247c267c2c5c222
c272c2a0c2a2c232c2d2c2c7c2b2c2e57070e00aa008cf0000240070a0485870c280c2c0c2a0c2d0c290c2b0c2c5c222c272c2a0c210c220c230c240c250c260
707070e089e08b312300c570e089e08b3153008570e089e08b31b1004570e089e08ba04ba0cbc570700570e089e08b31f500c47021cae00ca0cbc470a0cb0570
70e08921cf00004300e0cc315000e0cde04d319200a04850037070e08d319200a04850937070707006d19637469676964770e08921cf00004300e0cca008cf00
00b30070e00ee00ee00ee00ee0cde04d319200a04850147070e08d319200a04850a5707070e0cde04d319200a04850167070e08d319200a04850a770707070e0
8a319200a04850f5707070e04d319200a0485008707070e00ae0c9873119007031920070707006d1963716c6e657d670e08921cf00004300e0cc218c218c3166
00470670864570e089e08ba0481070877021cae08d31a500a04b3192007070e089e08be00ae0c94731b60070e04931920031a5007070077021cae08aa0cb0770
a0cb88707021cae00c31a500a008cf000037007070e089e00aa0cbc870e049a048d457e6475627d696e6164756460237472796e67670a0088f707070e049a008
cf0000b20070e04c31a50031f500707070a008cf00002800707021cae08aa008cf0000970070a04850c57070e089e08ba008cf00001800704870e089e08ba008
cf0000770070c670e089e08be00da0088e70a0cbc67070077021cae08aa008cf0000980070a04850877070e089e08be00ae0c9475147f6e657d670e04ea04890
038770e00ae0c94731850070e049319200e04931bd00e04c31a500a0484870707070707070c67021ca316e00e089e08ba008cf00002900704870e089e08be00a
e0c947d036862770316e0070077021caa08e316d0070e089e00aa008cf0000d70070e04ea0481326164602563736160756a30270316e007070e089e08ba008cf
00001700700770e089e08be04e311d00316d00708770e089a008cf0000780070a008cf0000de007070707070a008cf00005a0070707070e089e00a314010a048
9326164602865687025637361607567070a008cf00009a007070707021cae00ae0c94731190070316e0070e089e08b31a500467021cae0cda008cf00001b0070
e0ce31a500e04ca0cb4670a0488870707070e08931f010e089a008cf0000880070a008cf0000bc00707070e089e08be00f31a50031f500704870e089e08be00a
a008cf0000e80070e00aa008cf0000090070e049319200e049a008cf00003b007031a50070707070c67021cae00ea08e316e0070e04d316e00a048cf00000010
707070e089e00a314010a048942616460246563696d616c602563736160756707031611070316110707070707021cae08a316e00a008cf000006007070e08931
f010e08931521021caa08ee00ae0c94731160070e049316e00a0489102d090c0b0a07070707021cae08a316e0031a01070e089e00a31401031500070e089a008
cf00001a0070e089a008cf0000bb0070a008cf00008a0070707070a008cf00006d007070a008cf0000bd007070707021caa008cf00003d0070e089a008cf0000
4d0070e08931d41031051070703105107070707070707021cae08a316d00a04850a07070e089e00a314010a008cf0000e7007070a008cf000048007070311110
7070707031f51070707006d146561757f6475670e08921cf00004300e0cc31590021cae08ae00ae0c98731b60070a008cf000067007070a04850b57070e08931
f010e089e08b31a500477021cae08aa008cf00002f0070a04850d37070e08931f010a008cf000022107070e089e08be04ea04850d570e04ee00aa008cf0000c3
0070e049319200e049312500a008cf0000ab0070707070a008cf00009f007070700770e089e08ba04b316d0070c67021caa008cf00004f0070e08931f01021ca
e08a310710a008cf00005e007070e08931f010e089e08b31a500867021cae0cda008cf0000470070e04fe00a31c710e049319200e04931a500e00fe04c31a500
316e007031f50070707070316d007070e08931f010a008cf00004110707021cae04d31a500318c0070e089e00aa008cf0000a7007031500070e049e00a31c710
e049319200e049312e0031f710707070a008cf00004010707070a008cf000011107070707070a008cf0000511070707021ca314010e089e00a31c910a0485596
e66716c6964602c6f6e6760226271636b65647377070e04960487031a5007070a008cf0000c1107070707070707070a008cf0000e11070707006534656c6f6e6
7626271636b6564770e08921cf00004300e0cc218c316600450670210be04931f50031f50070e089a0080b70e089a0088b70210ba008cb70210be04931b100e0
4931b100a0084a707070e089e08b312300c670e089e08b3153008670e089e08b319b104670e089e08be0c9c7c8700670210be0c9c70970e089e08b3150008570
e089e08be0cc218c218c218c218c316600474570c6c57087487007077021ca311d00e089e00ae0c947d3f6e6f536f6d60796c656f5661696c670e049319200e0
c9070870707021cf00004300e0cd319200a08e31a5007070c6087070a008cf0000d310707070857021cae08d311d00318c0070e08921cf00004300311d000708
70e089e08be00ae0c94531b60070e049319200311d0070700570210b315000e089e08b312300c470e089e08b315300847021cae00ae0c94531160070e049a008
cf0000050070a008cf0000fc00707070e089e08be04c311d0031f500708770e089e08b31fc00c47021cae08a31fe1031981070e089a008cf000033007021caa0
8ea008cf0000f4007070e089e00ae0c945d016464670e049312e003125007070e089e00aa008cf0000251070e049312310a008cf00008310707070e089e00a31
4020e049a0cb0670e00f311d0031f50070707021cae0c9c50870e089210be049a048f070a008cf0000c5107070e089214a316e00a04b316e00703123007021cf
00004300315300c5087070c770a008cf0000a420707031712070707070a008cf00004610707070a008cf000086107070707021cae0cde08a31fe10a04850d270
70e08ae00aa008cf0000441070e049319200a008cf0000d410707070a008cf0000d610707070e089e08be04c311d00a008cf000019007070877021cae08aa008
cf0000641070a008cf00003f007070e089210be00ae0c94531da1070e049319200e049311d00a0cb8570707070e089e08b3123008470e08b315300877070c770
21caa08ea0cb84707021cae0cda008cf0000241070e04f31b2203198107070e089a008cf0000e41070a008cf00009810707021ca31a500e089a008cf0000f410
7031912070e089e00a314020e049316e0031fc007070319120707070a008cf00008810707070a008cf0000a81070707021cae00ee00ae0c9453119007031fe10
70e0cde08a31fe10a04850e27070e00aa008cf0000e81070a008cf0000071070707070210be049a04892031323334353637383937031fc0070e089e08b312300
4470e089e08b315300047021cae0cde08a31fe10a008cf000025007070e00aa008cf0000a41070e049313520a04890878570707070e089e08be04ea0cb4470a0
481314162426343644465456646670704470e089a008cf000047107021ca31fc00e089a008cf000074107021cae0cda008cf0000191070a0cb047070e089e08b
3121200470e08931f320a008cf0000fb1070707021caa08ee00a311620e04931fe10a008cf0000e91070707070e089e08be00ae0c94531850070e049319200e0
49316020a008cf0000851070707070847021caa08ee00ae0c94531de0070a008cf0000f710707070e089e00aa008cf0000771070a0489226164602e657d62656
277070e089e08b31f5208470e089e00a314020e049316e00a008cf00000b10707070319120707070a008cf00007b10707070a008cf00005a1070707070a008cf
0000bb107070707021cae0cda008cf0000991070e00a311620e049313520a04890262470707070e089e08ba048900313704470a008cf00000c10707031772070
707070c77021cae00ae0c945310b007031fe107021cae00aa008cf0000ec107031b22070e08931f320a008cf00005d107070e089e00a314020e049316e00a008
cf0000da10707070319120707021cae00ee08a31fe10a04850727070e08a31fe10a0485022707070e089210be00ae0c94531061070e049319200e049313220e0
4931fe1031b82070707070a008cf0000d71070c770e089e00a314020e049316e00e0cf00000200218fa048d03747277031882031660070315000707070319120
707021cae0cde08a31fe1031c22070e00a311620e049313520a04890d3b570707070e089210be00aa008cf0000671070e049319200e049311d00e04931b82031
fc007070707031eb20c770a008cf00006e107070e08931f320210be00ae0c9459157e6071636b670e00ae0c94531070070e049e00aa008cf0000aa1070e04931
9200e049311d00a008cf000037107070707031a010707070e089e08b312300c370e089e08b3153008370e089e08b319b10437021cae0cde0cde08aa0cbc37031
fe1070e08aa0cb837031fe107070e00a311620e04931fe10a04890e2e370707070e08931c62021cae0cde08aa0cb4370a008cf00006f007070e00a311620e049
31fe10a04850e370707070e08931f320a008cf00004d10707031ef20707021cae0cde0cde0cda008cf0000ff1070e04fa008cf000000207031fe107070e00a31
1620e04931fe10a04890c3e370707070e00a311620e049315030a008cf0000212070707070e08931c62021caa008cf0000802070a008cf0000d0207031ef2070
7021cae0cd313030e00a311620e04931fe10a04851e2a3e5c3e370707070e08931f32021cae0cde08a315030318f2070e00a311620e04931fe10a04811e2e5c3
e37070707031013031ef20707021cae0cde08aa008cf0000ef1070318f2070e00a311620e04931fe10a04893b2d2a2f2c552e562c7c3e3d3e712707070703101
3021cae00a311620e04931fe10a048d6b2d2a2f2c552e562c7c3e3d3e7328292b7d7b5d5b3c2f30442e2a370707031ef20e089e00a31b820e04ea04892261646
0236861627a3027031fe10707031ef20707070707070707070c770707070707070707070c7707070e049316e00e049312e00e049312310a008cf000075107070
7070707070c57070707070c77007707070c77070061247f6b656e696a75670e08921cf00004300e0cc315000e089a008cf0000820070e089a008cf0000a20070
21caa008cf0000c2007031500021cae08ae00d31a5003125007031920070312500e089319f10a008cf0000d520707070707070700611963796e670e08921cf00
004300e0cc315900e00ae0c987319d2070e049319200e04931f500e0c90850e6707070707006914656071636b670e08921cf00004300e0cca008cf0000520070
e089e08b31b1008770210be049e0c90711e65687477031920070210be00ae0c9470870e049e0c9474870e0c94788707070e089a008cf0000c21070e089a008cf
0000d2107021cae08a316e0031500070311d00e089214a311d00316e00312e0070210be00aa008cf0000c62070e049a008cf0000d62070316e007070a008cf00
00972070c77070707070c77047707070061136f6079770e089e08be00a314700a048dff600000016e646c226275616b6c246f6c256c63756c256c637569666c2
56e646c26616c63756c266f627c26657e6364796f6e6c276f647f6c29666c296e6c2c6f63616c6c2e696c6c2e6f647c2f627c2275607561647c22756475727e6
c2478656e6c247275756c257e64796c6c2778696c65670708470e08921cf0000430031b10006d2b6569777f62746f5d6160770210be00ae0c906d016c6c67031
882070e089e08be00ae0c9440870e049e0c9444870e0c94488707070047021cae08aa008cf00002a107031500070210b315000e08921cf00004300e0cc315900
e0cde08ae00ae0c98711479707567031920070a0489137472796e6767070e08ae00aa008cf00001f0070e049319200318c007070318f20707070c30870e08921
cf00004300e00a314700a0485556e646c256c63756c256c637569666c257e64796c67070069256e646f547f6b656e63770e08921cf00004300e0cc218c315900
cf0000dcffc370210be00ae0c98731533070e04931920031fc007070e089e08b3123004770e089e08b3153000770e089e08b319b10c670210be04931f500e049
a048c770a008cf00000a20707070210b312300210b315300210b319b10210ba008cf0000f21070210ba008cf0000131070210be0c9c74970210b315000210b31
2300210b315300210b31b100210b312300210b315300210b319b10210b310b30210b315000e08921cf00004300e0cc218c218c218c31660007867047c6708787
70e00ae0c987316d1070e049319200e00ee00d312500e00f31602031f500707031f50070707070830870210b315000e08921cf00004300e0cc315000e0cc218c
316600870870311d007070430870210b315000e08921cf00004300e0cc218c316600874470210be00de0c98708703192007021ca319630e0cc218c218c316600
470870874770e00de00d319200a008cf00004b2070703125007070e08921cf00004300e0cf0000530031ed3011f554e46570470870e0cca008cf00007b2070e0
0de0cf00005300a008cf00008b2070312e307031250070707070477070030870210b315000e08921cf00004300e0cc218c218c218c218c316600074570868770
c68370874470e089e08be0cf0000530031ed30d0e2e2e270477021cae00ea08e31250070e04f3125003160207070e089e00aa008cc70a0481457e65687075636
4756460272e2e2e2727070e0cc218c218c316600878670474770e00ae0c98731e43070e0cf00005300e00d31920031250070313f3070707070a008cf00006d20
70707070c20870210b315000e08921cf00004300e0cca008cf00003b2070210ba008cf00005b207021ca319630e0cc314e30e049317e303125007070e089a008
cf0000cb2070e0cc314e30e049a008cf0000db207031250070707070477070820870210b315000e08921cf00004300e0cc218c218c218c316600478670874770
c68370e089e08be00d311d00319630700770e08921cf00004300e04c31963031f5007047087021cae08a316d003192007031500021cae08a316d00a008cf0000
b1107070e089e00a31af3031500070e00a31af30e04ea048925687075636475646a30270319200707070a008cf00001f20707070707070420870210b315000e0
8921cf00004300e0cc218c218c218ca008cf00005e2070c6877087477007837021caa08e31920070e089e08ba008cf00008e20700870e089a008cf0000be2070
21cae08a31920031524070e089e00a3160203150007021cae0cde0cde08ae00ae0c9c631c8307031920070a008cf0000e8207070e00ae0c9c6310b0070e00ae0
c9c631b60070e04931920031f50070707070a08ee00de0c9c63157307031920070707031920021caa008cf0000203070e089e00a316020e04ea0481596e66716
c6964602964656e6479666965627a302703192007070e00a316020a048d4964656e6479666965627025687075636475646707070a008cf0000113070707070a0
08cf0000413070707070a008cf00006130707070020870210b315000e08921cf00004300e0cc218c218c31660087477047867021cae08a31934031920070e089
31b34031fc00703150007070c10870210b315000e08921cf00004300e0cc218c218c218c316600474470878770074670e08921cf00004300e00ae0c987133756
47d6564716471626c65670e04931b100e0cf00000200218fa048d1f5f596e6465687703196303166007031500070707047087021cf00004300e04c31602031f5
00700708707070810870210b315000e08921cf00004300e0cca008cf0000523070e08921cf00004300e0cf00005300e00ae0c98713765647d6564716471626c6
5670319630703157407047087021cf00004300a008cf00008a20700708707070410870210b315000e08921cf00004300e0cc218c316600868770e089a008cf00
00962070e089e08ba008cf00007200704770e089e08be00f31250031f500700770e089e08b31f500c67021cae00c316e00316d007021cae00c31250031ba3070
e089e08be00ae0c98611071636b670e00aa008cf00009520703192007070467021cae04fe0c94631d4307031f50070e089e08ba008cf00005430700670e089e0
8b31f500c57021cae00ca008cf0000b4007031433070e089e08be04c312500e00f314a4031f50070704770e08921cf000043003125008731d43070311d007070
e089214a311d00e00fe04c312500319a407031f50070e00d312310319a407070e089e08be04c319a4031f50070c570a008cf00008530707070707070e089214a
311d00312500e0c946087070a008cf0000e4307070707031cb4070e089214a311d00316e00e00ae00d31a500316e00703192007070e089e08be04c316e0031f5
0070c670a008cf00008630707070707070707070010870210b315000e08921cf00004300e0cc218c218c31660047877007c170e08931b840e089e00ae0c94731
002070e049311d00a0cf00001200e00a3192003150007070707021cae00a316020a04850c27070a008cf0000973070311d0070707070c00870210b315000e089
21cf00004300e0cc218c218c218c218c218c316600c6c170464270860570478770070170e08931b84021ca31c910e089e00aa008cf0000173070e049311d0031
c910707021ca31a500e049e0cc218c218c218c218ca008cf0000fa2070074870468770860770c64770e089e08be00a311d00319200704770e00ae00d31250031
6d0070e049312500e00ae0c9c631e43070e00ae0c9860870e04931920031231070707070707070e04931fc00e049315240e0cca008cf0000783070e089a008cf
0000983070e049a008cf0000a83070e00ae0c9c631c94070a008cf000009307070707070707070e049e0cc218c218c218c31de40c68770070770474770e00aa0
08cf0000883070e00ae0c94731e43070e00a316020e049319200316e007070707070e04931fc00e049315240e0cc218c218c31de40470770078770e04931a050
e00a319630e049319200316d0070707070707070707021caa08ee00a31af30a048509270707021ca31fc00e089e00a314e40e049311d00a0cf00001200e00aa0
08cf0000c830703150007070707021caa0cf00001200a008cf00001b307070a008cf0000ea3070e089e00aa008cf0000b53070a008cf000067307070a008cf00
00cb30707070703162507031625070707070800870210b315000e08921cf00004300e0cc218c218c218c218c218c218c218c218c31660086c170854270440270
844370c50570458770c48670054770210b31db10e089315b10e089317b10210b31f500e089e08b3123000770210b31530021caa08ee00a312250a04850d77070
70e08921cf00004300315240c60870210b315000e089e08b3123004670e089e08b315300067021cae00a31225031c22070e089e08be00aa008cf0000b5107031
5000704670e089e00ae0c985087031081070e089e00aa008cf00004d3070318f2070e089e08ba008cf00002d30700670e089e00a314020e049311d0031231070
70e089e00a314020e049312500314330707021caa0cf00001200a008cf0000cc307070e0cc218c218c218c218c31660046457086c670064770478770e08931b8
40e089e08ba04b312500700770e089a008cf0000e3307021caa008cf0000f33070311d0021cae08a316e0031225070210be049e00ae00d312500316e00703192
0070e00ae0c94631c94070e00ae00d314330316e0070319200707070e089a008cf0000840070e089a008cf0000940070e089e08be0c98531d430704570e089e0
8b31f500057021cae00c31fe10a0cb457070e089a008cf0000563070a008cf000020407070e089214a311d00e00fe04c319a4031fe107031f50070e00d31b820
31fe107070e089e08be04c31fe1031f500700570a008cf00009f307070707070707070c770e089214a311d00a008cf00005e3070a008cf00008e307070a008cf
00000f30707070707070707021caa08ee00a312250a04850b3707070e089e00a31655031a25070a008cf0000e240707031e950707070707070707021cae08ae0
0d31fe10e04ce0c9c4087031f5007070318f2070e089e08be00ae0c9840870e00aa008cf000058207031500070704670a008cf000011407070e089e08be00aa0
08cf0000814070316d00704670e089a008cf00007d3070e089e08be04c316d0031f500700770e08921cf00004300e04ca04b311d007031f50070c60870a008cf
0000f040707070707070707070c77070a008cf000060407070c67070c7707070c77070400870210b315000e08921cf00004300e0cc218c218c218c218c218c21
__map__
c812c812c812c812c812c812c812c812c812c812c81366006c1807204c070c38076044075c2807385807083007507807101407481c076464074c24073454076820072460073c480712b013050012b01332000e9813b70112b013b90112ac13290012ac135a000e980a80fc0000ee02070e9812fc000034000a80fc0000b30307
7880070e9812a40e9c60800713de03132905070e9812fc000034000ea013500513de030770800712b0131b000e980eb8133200580712b013350012ac1352000e980ea00e9c50130002070e94138b020a841173656c660707070e980ea00a80fc00001404070a840528070712ac0ae80ea013ae050a80fc0000b00307070712ac
13cf0012ac0afc000021000ea013ae050a8413f3030707070e9812fc0000340013cf0054800712ac0afc000021000a80fc0000530407070e9813d50512b00ea00e9c5013790307138b02070e980a80fc00008a020712ac0a80fc00008b020712ac0e9c5480070e9812fc000036000a80fc000048040713290513f3030712b00e
940e9c3c80070e940e9c3880070e9c34800707070e980eb813320030070e980eb81335002c070e980eb813b90128070e9812b00e94131b000e940ec40e9c248007135f000713290507070e9812fc000034001332003c80070e9812fc0000340013350038800712fc0000340013b90134800707077c070e980eb80ea00e9c2080
07130500071c0712b00ea00a80fc00005a04070a80fc00005e0407070e980eb80ea00e9c1880070e940e9c1884070e9c1888070707140712ac0ea80abc1407130500070e9812b00e940abc30070e940abc2c070abc280707070a80fc00006e04077c070e980ea013ec050a840d656e6407070e980ea00e9c108007130500070e
cc12c812c812c812c812c812c812c8136600601c0764540754700774500768580758800778840712ac13d1000e980ea013e4040e94132900131b0007070e980eb80ea00e9c74136d03071329000770070e980a80fc00000101070e980eb80ecc12c812c812c812c812c80a80fc00001c0307686c077070074460074864075468
070e980eb80ea00e9c78139c04070afc0000370080070774070e980eb813d6006c0712ac0ef40a80fc00005e010713e200070e980eb8131b0064070e980eb813e20060070e980eb813ab035c0712ac0a80fc00004903070e980eb81332016c070e980eb8131b0058070e980eb80ab40a80fc0000ee03070750070e980a80fc00
004e000712ac0a80fc000051000712ac13ae050e9812fc000034000ea00a80fc00009704070ea00a80fc00006202070e941352000e940ec40a80fc0000a20407135f00070e9c74134d0307070707075813f303070e980ea00e9c78130002070e9413e600138b0207070e980eb80ea0137c0213e6000740070e980ea00e9c7811
64656c690713e6000712ac13830312ac0ea80ea00a80fc00008c0207138303070a84157461626c6507070ea00a80fc0000d20207138303070ea0138303130500070713050007070707070a80fc0000bb0407070e9812a4138b020ed013760613fc01070ed013520013fc0107070e980eb80ec413fc01135f00074c070a80fc00
00c50407070707070707070e9812a413320113a9040ed013e60013a90407070e980a80fc00005503070a80fc0000ce04070707070707070a80fc0000c80407070707075c0712ac138b0212b00ea00a80fc00005c0407132900070e980eb813320050070e980eb81335004c0712a413ef0113fc0113a9040707077c0713a90407
070707070a80fc0000e1040707070707070e980ea00a80fc00007a0407130500070e980eb80ea00a80fc00007404070e940a80fc000075040713b806070714070a80fc0000ee040707070707180707070707077c07070a80fc0000f60407070e9812a4130906138303132905070e980eb80ea013a9050e940a80fc0000860207
138303070740070a80fc0000ff0407070707074407070e980ea013ec05132a050712ac13af060e980ea00e9c0c80070a8471756e657870656374656420706172616d20616674657220272e2e2e2707070a80fc00001005070713d106070707070e980ea00a80fc00004d04070e94138b0213d80507070a80fc00000a05070707
0a80fc00000205070713d7060707070a80fc0000120507075407077c07070707070e9812fc000034000a9013d8050778800712ac0afc000021000ea013ae050a80fc000090010707070e980ea013d4060e9413de0313d80507070a80fc00005305070712ac0afc000021000ea013ae050a84053a0707070e980a80fc00002105
070e980eb813cf00740712ac0ea80ab413de0307135f00070e9812fc000034000ea01350050efc0000350013de038007077080070a80fc00001705070712b00ea00e9c0880070a80fc0000290507070e980eb80ef00a80fc0000270507135f000700070e980eb8132802fc0000e0ff0712ac0ec00abcfc0000e0ff070abc0007
070e9812fc000034000ecc12c812c81366007804077478070e940ea013de03132900070ed01369030ab41369030707070770800713f406070e980eb80e9c048007fc0000dfff070e9812fc000034000ecc12c812c80a80fc00006f030770fc0000e0ff0778fc0000dfff070ed0130a050ed013690313d6000707070480070e98
0eb80ec40a80fc0000320507135f0007fc0000e0ff070a80fc00004b050707070707070704070707070a80fc00004f05070707070713f4060770070778077c070700800712b01305000e9812fc000034000ecc12c812c812c812c812c812c812c812c812c812c812c812c812c81366006434077874074c2c075c040750000744
30076078076838075424077468075850074028074820070e980a80fc0000e902070e98133b0412b013050012ac0a80fc0000ed02070e9813d80512ac0ea813d6000a840d6e696c07070ea01329051305000712ac0ea813d6000a84117472756507070ea013290513cf000712ac0ea813d6000a841566616c736507070ea01329
051312020712ac0ea80ea00e9c60138c030713d600070a84196e756d62657207070ea013290513d6000712ac0ea80a80fc00007405070a80fc0000b30407070ea01329050e9c7013c502070712ac0ea813d6000a84057b070713590512ac0ea813d6000a80fc0000510407070e9812fc000034000ea0135605130500076c8007
0e980ea013af0613f205070e940ecc12c8136600786c070afc000021000a80fc0000370507070713cf0007070712ac0ea813d600132402070e9812fc000034000ea01356050a84a807076c80070ecc0a80fc00008105070afc0000220013610707070712ac0ea813d6000a84057e07070e980a80fc00008a05070ecc1369070a
fc0000230013610707070712ac0ea813d6000a840d6e6f7407070e981370070ecc1369070ae813610707070712ac0ea813d6000a84052307070e981370070ecc1369070ab413610707070712ac0ea813d6000a84054007070e981370070ecc1369070afc0000240013610707070712ac0ea813d6000a84052507070e98137007
0ecc1369070afc0000250013610707070712ac0ea813d6000a84052407070e981370070ecc1369070afc0000260013610707070712ac0ea813d6000a842166756e6374696f6e07070ea00e9c5080071305000712ac0ea813d6000a80fc0000550407070ea013ec051305000712ac0a80fc00008600070e9812fc000034000ea0
13ae05130500076c80070e940ecc12c8139500746c070ea00e9c7821636d645f657865630713690307070e9413cf000ecc0a80fc0000b405070ea00e9c7829636d645f61737369676e07136903070707070712ac0afc000021000a80fc00001d0407070e940ea013a90513d600070e9413cf000ea00e9c40800713d600070707
0ea01322050ee40a8449756e657870656374656420746f6b656e3a200713d6000707070707070707070707070707070707070707070a80fc0000d80507076c07070707fc0000e0ff800712b01305000e9812fc000034000ecc13050012b013050012ac0edc0ea81329000a84055e07070ed8135a000a84ac0707070e9812fc00
0034000ea01304010a80fc0000e20507077880070ecc12c812c81366007888077478070efc00002700130a050ea01369031329000707070712ac0edc0ea81329000a84052a07070eec135a000a84a40707070e9812fc000034000ea01304010a80fc0000ef0507077880070ecc0a80fc0000e805070efc00002800130a050a80
fc0000e9050707070712ac0edc0ea81329000a84052f07070a80fc0000f00507070e980a80fc0000f305070ecc13df070efc00002900130a0513e10707070712ac0edc0ea81329000a80fc00008500070713e707070e9813e9070ecc13df070efc00002a00130a0513e10707070712ac0edc0ea81329000a80fc0000a2050707
13e707070e9813e9070ecc13df070efc00002b00130a0513e10707070712ac0edc0ea81329000a84052b07070eec135a000a84a00707070e9812fc000034000ea01304010a80fc0000090607077880070ecc13df070ec4130a0513e10707070712ac0edc0ea8132900132402070a80fc00000a0607070e980a80fc00000d0607
0ecc13df070ef0130a0513e10707070712ac0edc0ea81329000a84092e2e07070ed8135a000a849c0707070e9812fc000034000ea01304010a80fc0000180607077880070ecc13df070ee4130a0513e10707070712ac0edc0ea81329000a84093c3c07070eec135a000a84980707070e9812fc000034000ea01304010a80fc00
00220607077880070ecc13df070efc00002c00130a0513e10707070712ac0edc0ea81329000a84093e3e07070a80fc0000230607070e980a80fc00002606070ecc13df070efc00002d00130a0513e10707070712ac0edc0ea81329000a840d3e3e3e0707132e08070e981330080ecc13df070efc00002e00130a0513e1070707
0712ac0edc0ea81329000a840d3c3c3e0707132e08070e981330080ecc13df070efc00002f00130a0513e10707070712ac0edc0ea81329000a840d3e3e3c0707132e08070e981330080ecc13df070efc00003000130a0513e10707070712ac0edc0ea81329000a84052607070eec135a000a84940707070e9812fc000034000e
a01304010a80fc0000440607077880070ecc13df070efc00003100130a0513e10707070712ac0edc0ea81329000a84095e5e07070eec135a000a84900707070e9812fc000034000ea01304010a80fc00004e0607077880070ecc13df070efc00003200130a0513e10707070712ac0edc0ea81329000a84057c07070eec135a00
0a848c0707070e9812fc000034000ea01304010a80fc0000580607077880070ecc13df070efc00003300130a0513e10707070712ac0edc0ea81329000a84053c07070eec135a000a80fc0000b4000707070e9812fc000034000ea0130401137808077880070ecc13df070eec130a0513e10707070712ac0edc0ea81329000a80
fc0000090207070a80fc0000620607070e980a80fc00006506070ecc13df070ec0130a0513e10707070712ac0edc0ea81329000a84093c3d0707138208070e981384080ecc13df070ed8130a0513e10707070712ac0edc0ea81329000a84093e3d0707138208070e981384080ecc13df070ed4130a0513e10707070712ac0edc
__gff__
0ea81329000a84093d3d0707138208070e981384080ecc13df070ea8130a0513e10707070712ac0edc0ee00ea81329000a84097e3d07070ea81329000a8409213d070707138208070e981384080ecc13df070ef4130a0513e10707070712ac0edc0ea81329000a840d616e6407070eec135a0013280207070e9812fc00003400
0ea0130401132802077880070ecc13df070edc130a0513e10707070712ac0edc0ea81329000a84096f7207070eec135a00135f0007070e9812fc000034000ea0130401135f00077880070ecc13df070ee0130a0513e107070707130500070707070707070707070707070707070707070707070707780707fc0000dfff800712
__sfx__
34000ef0074300743007430070112c25000a67000003d5200707020611165201305500430128620e8060a8003c30000067054300e8420e8020e861145110c6100741116300074110e530074300e8411286700000
980a80fc13446034111f10007027006300e8410e8430a8003c30000c7205430285300e8021303505070146111a1000e8211342204411223000743007430070112c27028611163000a8003c300004120543007070
0e9413fa000003f230070112c2702037028611390200a8003c300004570543007070282702025000a6700000163300741139020074110e530074300e8410a8003c30000865064300e8021303505070146111a100
07070707034112230007430074300e8410e8021300505411175300707020611165200e82113055004113a7100743007430070701827038270206112c7200e821138350007014611290000e821130550041109030
0000340008530128620a8003c30000800014300e8410a8003c30000c5506430138400243013840024300743007430074300a8003c3000084706430074302c5303c5300743007867000001ef77006300e84112867
0e980eb80e864128441284413036000473c300008063f73024967000001ef770701130270206111e71013420004300e8410a8003c30000c61024300e8410a8003c30000871024300e8410a8003c30000c7102430
58070e981380303046070112c6110f300128030e802134420507014270207112900013c52034300e8211301500411163000743007070182703861132000205300e8410e843134230006507070182703861139600
090e98130e8431380303025070112c25028711344100707014611121000e821138360041122300074300e841128030e821130230307014611292200e82113c500241136130074300707018611284400e84113052
cc12c8122c4400a8003c300004400743007430070670705000a670000023430074300743007430070670705000a6700000144300743007430074303c5300700500630128031342000070182113c3000002300070
746f20760871126100381050706638430128030a8003c30000040074300e8411304209070186112a440128620a8003c30000c61004300e8410e802138570305004645235062e1762f1272040633517295362e102
0000ddff21166355260743013835004301383500430074303c53007867000001df7700630128031342000070182113c30000023000700c311083110831108311083110831108711261002c122070470c43034967
07135f0007006385301c10107046105300e8410e8430e802138750341129510070070707018270206113a71013847024300e8410e8430e80213875034112242007026070112c2701c3702825000a670000000400
7c07070e07070282503461132400074111f100074300e86412844128441303600047305302c1260701130611215300e8411304209070186112a440128221301500411163000e8021385703411290000743007430
0e980eb80c31108311083110831108711261001816507025245301c10607007305301280313c630107018611356000e84113c330107018611131300e8410e8431347500046070112c27000711223001383600430
1305000e0e802130350507014611290001303706430070050707018270382503c30000012004111f10007064070112c270007113c70013c52034300e8410e8431340709044070112c27000711082101347500430
094407121821124270107111130013840024300e80513015004110821007070107112f700138400243007070182703827004711082101386701430085300a8003c300004160743007430074300e8410e84313407
006f07072c2702c7113c110134750043013420000701821124270107111130013067024300e80513015004113c11007070107112f7001306702430070701827038270047113c1101386701430045300a8003c300
0e980ea00743007430074300701130270202701071116300138160043013442004300e8410a8003c30000c74034300e8410a8003c30000805034300e8410e8020e8611c511000100705000a67000001871007430
ff8007120a8003c30000037074300a8003c300008550343007070182703827004711223001347500430285300a8003c30000c00074300743007430070670743007430074303c5300743007430074303c30000865
6c13580030611050000e8411286700000340000e864128441284412844128441284413065060453843034146070663853024967000001ff7707006105300e8411347207070186113b0200e8410e8430e8020e861
0712ac0a0707014611163000e82113475000503c3000001200411280100743007430285300e8410e8430e802134420507014611223000e82113c520307014611290000e86413c210041113540074300743007065
0e9813282871129220070701827020611165200a8202d5462e1372116629126204162f5663057635176241022151733546271762d5262e127074300e864128440a8003c30000804064302c16507011306110a420
0ecc12c809070186112a440128221301500411163000e80213836004112900007430074303c530074300a8003c30000842074300743007430074303c30000c553fb000701130611050000e841128670000034000
0507070e1284412844128441284412844128441284412844128441303600065184300c124070270043008147070471c4303016007005245302c102070241043024105070112c270206111e7100a8003c30000862
1359050e20611295100e82113c74004110f300074300e8410e8430e80213030024113a71007046070701827038270203701c370206111e71013847024300e802130300241129420074301345100430205300e841
12c812c818270382503461122300070450707018270386111f10014530128620e80413037064110b210070112c2701c3702825000a670000005730074111f10007070282503461134410074111f100074300e864
80fc000013023040470853030106070702025000a67000002b2200707014611290000e8670000020000128471344603070206110601013442004301303600430134200043007430070700c311083110831108350
090a80fc2341007065085303010607046285300e84113c5004070182703825000a670000028610070660707018270386110e050245300e8410e8431347500006070112c270007113441013013014300e80213c43
0e9812a40000005500074300e8411282213c0500070107112230013023034300e805138360041134410074300e8410e8430e82413023034111f100070060705000a6700000247300743007430074300743007430
05000e981386605070107112230013037064300a8003c300008720543007070182703827004711361301347500430145300a8003c30000c070743007430074300743007430074303c300008553fb000701130611
0ecc12c81286700000340000e864128441284412844128441284413036000663c4302412707047305302814307027285300e8410e8430e80513c050005000a67000001a33007430305300e841128670000034000
0042070712844130210704730530301270707034711113000e805130150041106010074300706600630128620e8060a8003c300008670243013c25054300e8021301205070203701c37018711295100a8003c300
c812c81207050046232250624102331462f117341462117624530074112502007430134200043007430078670000019f7700630128031342000070182113c30000023000700c3110831108311083110831108311
0712b0130831108711261000816307047345301c161070053c300008453f7301412207027285302c105070450c5300c9670000019f7707070182703827028611390201343507430305300e8410e84313c2505046
8007077c050001280313013000113061135000128620e8021300505050046013414625176074300e841128030a8003c30000077054300e8411286700000340001301300026006301286700000340001342300006
70600712070112c27020611105200a820114262c5172553007070182113c300000230041134150209000707018270206112f2300a8003c3000081004430070700c311083110835000a6700000103100702724530
002c08072c6110a42013c06070112c611060100a8003c30000c740743013420004300743007430128620e802130050505004641251663352629136074300e8411286700000340001386708006006300a8003c300
80fc00000705000a67000002d04007430074300e8410e80213866054111630007070182113c30000023004113415024900070112c2701c3502835000a670000032620074300a8003c30000422084300707018250
cc12c8122604007070182113c30000023004112502008900074110e250074300a8003c3000045308430074300743020530245303c53007430078670000018f7700630128031342000070182113c3000002300070
9812fc000831108711261002c1640700720530381650707018270386111e710345300e8411286700000340000a8003c300004620343038900070701827038270206113a7100a8003c30000841044300704607070
d6ff80070002300411121003890007411223000743007430078670000017f7700630128031342000070182113c30000023000700c71105000128620e84213442004110f300074110500013046014300786700000
00d7ff07128031342000070182113c30000023000700c311083110831108311083110831108311083110835000a6700000130400702538530109670000016f77070061c4301812207027285302c105070653c300
135605130c9670000019f77070701825000a67000001c040070701825000a67000001d040070113061105000128620e80213440060500464024576074300e8411286700000340001344505026006300e8410e802
7969656c00250070700c31108311083110835000a67000003340007007245302410507047285301286213050050112c27014370202701c227114173450634530134750043013475004300e8410e8020e86134523
fc000072245752514725516351272553013420004301280313c300a07018611205100e84113016030112c611263000e802134420505000a670000013430074300a8003c30000427084300743007067074300a800
12b0130508430074110500007430074300e8410a8003c30000033084300e8410a8003c30000026084300e8410a8003c30000053084300a8003c300000370843007430074302453007430078670000015f7700630
4b08070e00070182113c30000023000700c311083110831108311083110831108311087112610028122070253c300008353f7301c121070261053018147070073c30000c353f73038126070701825000a6700000
070ecc121827038270206110601013c74004302c5300e8410e80213012050500462135176345462c5300707018270386111734020530128620e8041387503411121000707018611195200a8003c3000087208430
b00ea01308311083110831108311087112610024127070272c53028106070061453038145070112c27014370202701c247138550a430134750043013475004300e8410e8020e861385111e350074110500007011
00b004071210013442004300e8410a8003c30000854034300e8410e8431342300066070112c611175400e8410e8430e80213816004112900007066070112c270007110830013013014300e8410e8020a8003c300
fc0000aa13442004300a8003c30000c2208430070112c611163000e802134400607014611163001383600430070112c61126300134200005000a67000002c240074300743007411244500743007067074300a800
1366004c08430074300743007430074303c300008253fb000701130611050000e8411286700000340000e86412844128441284412844128441284412844128441284412844128441284412844128441284412844
0a80fc00184301412307047345300412407021104302c060070033c300008353f73034047070431443018161070442453028122070272853030102070043c30000c353f73024105070112c270282701071111300
0e980eb80085602430074113831007070182703825000a67000003f310070660707018270206112242013847024300e8410a8003c30000c60084300e8410e80213012054112a420070701827038611173401c530
13ae05070e8060e8650a8003c300000500443013c35084300e80213c72064111f10007430105300e8410e802130120505000a670000022140074300e8410a8003c30000c03054300e8411282213c420541126300
6600745c0e8410e8430e8020a8003c300008040543013420004303c4300e8410e80213012054110025007070182702025000a67000001f1200741105000070700c31108311083110831108311083110831108711
0a05640707006344301c16607007105303810607064304301816307070182703825000a67000001a240070660707018270382702061116300134420043028530128620e80413816004112b610070701827038611
29000efc128620e8041301301411263000741105000128620e8250e8020e861205111a350074111f100074111f1000707018270202701c206138750a43013420004300e8410e8020e86120511000100707014611
000712ac00000200001284713c4204411324001303600430134200043007430128030e80213c50024112900007070182703861132000145300e8410e84313423000050707018270202701c20613c010643013442
b8130a051303706070206112c7200e82113037064112f700074300e8410e8430e824130130141122300070260705000a67000003e3400743007430074303c530074300a8003c30000c5708430074300707018270
1388021308530128620e8661384002411263000741105000128620a8003c30000826084300e8410a8003c30000836084300e8410e8020a8003c30000c36084300e82113442000703c30000002000113871129220
1383030726100074110500007430070113025000a67000002c340070701825000a670000017600070701825000a670000018600070701825000a670000030340070112c6113c1100e8021386605070146113c110
0ea00e9c07070182703827004711082101381600430085300a8003c3000041109430074300743007067074300705000a670000010440074300743007430074300743007430074300743007430074300e8410e843
341379032c800074110601007042070701827020611224200a820094462e5300707018270382702025000a670000025440074112942007022070701825000a67000000f340070701861118550128030e8020e861
__music__
01 30130500
0a 0e18127c
00 00003400
0a 0e4c1248
0a 12481248
0a 12481248
0a 12481248
02 1248135c
00 06547807
02 4c7c0000
03 5f7f0750
09 7c000060
01 7f075c24
00 07746807
00 64200758
00 08076050
04 070e1813
08 2f070e18
00 133b0412
01 30130500
02 12301332
04 000e1813
08 6203122c
02 131c0112
05 2c0e2813
09 5600135f
08 06070e18
02 127c0000
08 34000a00
01 7c00006c
08 05076c00
04 070e140e
05 4c124812
01 48136600
02 78040774
08 6c070e50
00 130a0513
00 69030707
0a 0e14134f
04 000e4c0a
03 007c0000
01 4106070e
01 14130a05
00 13690307
00 07070707
0a 122c0e28
02 13560013
00 2c02070e
05 18127c00
00 0034000e
01 20130906
00 13050007
02 6c00070e
05 180e2013
08 50051300
08 01070e14
0a 0e4c135f
04 080e5013
08 0a051361
00 0707070e
05 14134f00
0a 0e4c135f
04 080e1413
08 0a051361
__meta:title__
keep:------------------------------------
keep: Please see 'Commented Source Code' section in the BBS
