pico-8 cartridge // http://www.pico-8.com
version 42
__lua__
function const(x) return function() return x end end
function deserialize(data)
	data = all(split(data, 0x4000, false))
	local pos, refs, chunk = 0x4000, {}

	local function advance()
		if (pos == 0x4000) chunk, pos = data(), 0
	end
	local function byte()
		advance()
		pos += 1
		return ord(chunk, pos)
	end
	local function short() return byte() | byte() << 8 end
	local function word() return byte() >>> 16 | byte() >>> 8 | short() end
	
	local function dive()
		local function hash(res)
			res = res or add(refs, {})
			for k,v in function()
				local key = dive()
				return key, key ~= nil and dive()
			end do res[k] = v end
			return res
		end

		local ctl = byte()
		local v = ctl&252 ~= 252 and ctl>>>2&63
		return select(ctl%4+1,
			function()
				return v and v-31 or word()
			end,
			function()
				local len, res = v and v>>>16 or word(), ""
				repeat
					advance()
					local consumed = min(len, 0x4000-pos>>>16)<<16
					res ..= sub(chunk, pos+1, pos+consumed)
					pos += consumed
					len -= consumed>>16
				until len <= 0
				return add(refs, res)
			end,
			function()
				local res = add(refs, {})
				for i=1,v or short() do res[i] = dive() end
				return hash(res)
			end,
			function()
				return select(v,
					const(), const(true), const(false),
					function()
						local id = short()
						return refs[id]
					end,
					hash)()
			end)()
	end

	return dive()
end
function ps8_asm(n, a, b, c)
	if (n>0) return ps8_ops[a[1]](unpack(a,2)), ps8_asm(n-1, b, c)
	return const(a), const(b), const(c)
end

function run_ps8(fir)
	ps8_inst, ps8_binder = {}, const
	return ps8_asm(1, fir)(ps8_binder())()(--[[$force-safe]]_ENV)
end

ps8_ops = {function(a)
	return function() return ps8_inst[a] end
end}

for i,n in inext, split"0,0,0,2,2,2,0,2,1,1,3,2,2,2,2,2,2,0,2,2,1,2,1,1,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,0,2,3,1,3,1,0"do
	add(ps8_ops, function(...)
		return const(add(ps8_inst,
			(select(i, ps8_runtime(ps8_asm(n, ...))))))
	end)
end

function ps8_runtime(--[[$rename::a]]a, --[[$rename::b]]b, --[[$rename::c]]c)
	local step = ps8_binder
	function ps8_binder()
		a, b, c = a(), b(), c()
		return step()
	end return function()return a end,
function()end,
function(f)return f end,
function(f)a(f)return b(f)end,
function(f)return a(f)(b(f))end,
function(f)return a(f),b(f)end,
function(f)return f[a][b]end,
function(f)f[c]={a(f)}return b(f)end,
function(f)return{a(f)}end,
function(f)return #a(f)end,
function(t,f)t[a(f)]=b(f)return c(t,f)end,
function(f)return a({b(f)},f)end,
function(f)return a(f)[b(f)]end,
function(f)local u={__index=a({}, f)}return function(...)return b(setmetatable({...},u))end end,
function(f)local o=a(f)return o[c](o, b(f))end,
function(...)return a(...)+b(...)end,
function(f)return a(f)==b(f)end,
function(f,v)return v end,
function(...)return a(...)*b(...)end,
function(f)return a(f)~=b(f)end,
function(f)return -a(f)end,
function(...)return a(...)^b(...)end,
function(f)return ~a(f)end,
function(f)return not a(f)end,
function(...)return a(...)..b(...)end,
function(f)return a(f)or b(f)end,
function(...)return a(...)<<b(...)end,
function(...)return a(...)/b(...)end,
function(...)return a(...)-b(...)end,
function(...)return a(...)>><b(...)end,
function(...)return a(...)&b(...)end,
function(...)return a(...)^^b(...)end,
function(...)return a(...)|b(...)end,
function(f)return a(f)>=b(f)end,
function(f)return a(f)and b(f)end,
function(...)return a(...)>>b(...)end,
function(f)return(a(f))end,
function(t,f)t[b]=f[c]return a(t,f)end,
function(f)return @a(f)end,
function(f)f[b]=a(f)end,
function(f)return f[a]end,
function(f)return a(f)>b(f)end,
function(f)if a(f)then return b(f)end return c(f)end,
function(f)f[b][c]=a(f)end,
function(f)local t,k=a(f),b(f)t[k]=c(f,t[k])end,
function(f)return a(f)[b]end,
function(f)return unpack(f,a)end end run_ps8(deserialize("ᵉま⁶☉⁷ᵉ…□ュ\0\0-\0\n██⁷█。ps8_asm⁷ᵉ…□ュ\0\0-\0⁙⁵\0█。run_ps8⁷ᵉ…□ュ\0\0-\0⁙⁵\0█!ps8_inst⁷ᵉ…□ュ\0\0-\0⁙⁵\0█)ps8_binder⁷ᵉ…□ュ\0\0-\0⁙⁵\0█。ps8_ops⁷ᵉ…□ュ\0\0-\0⁙⁵\0█-ps8_runtime⁷ᵉ…ᵉュ\0\0)\0ᵉう█■deli⁷x⁷ᵉ…□ュ\0\0-\0ᵉう█」printh⁷█‖print⁷ᵉ…ᵉ⬆️ᵉう█⁙゛\0⁷\n░=hello ᶜ7there♥ら⁷⁷ᵉ…□きᵉ▤\n░そ⁷ᵉ▤\n░て⁷ᵉ▤\n░ぬ⁷ᵉ▤\n░ひ⁷ᵉ▤\n░ま⁷ᵉ▤\n░も⁷ᵉ▤\n░ら⁷\n█オ⁷⁷⁷⁷⁷⁷⁷⁷ᵉ…□ュ\0\0-\0ᵉう|█⁷█⁵🐱⁷ᵉ…□ュ\0\0-\0ᵉう|░⁷█⁵あ⁷ᵉ…□ュ\0\0-\0ᵉう|☉⁷█⁵ョ⁷ᵉ…□ュ\0\0-\0ᵉう|😐⁷█⁵◝⁷ᵉ…□ュ\0\0-\0ᵉう|…⁷█⁵゛⁷ᵉ…□ュ\0\0-\0ᵉう|⬆️⁷█⁵゜⁷ᵉ…□ュ\0\0-\0ᵉう|▤⁷█⁵F⁷□ュ\0\0-\0ᵉう|う⁷█⁙P\0⁷⁷⁷⁷⁷⁷⁷⁷|⁷ᵉ…ᵉ⬆️ᵉう█⁵t⁷ᵉ⬆️ᵉう█■stat⁷ᵉ⬆️ᵉう█■band⁷⁙⁵\0⁷⁷⁷ᵉ…ᵉ⬆️\n█ュ\0\0005\0⁷⁙⁵\0⁷ᵉ…□ュ\0\0-\0\n░|⁷█⁵x⁷ᵉ…□ュ\0\0-\0\n█ュ\0\0<\0⁷█⁵b⁷ᵉ…\n█ュ\0\0>\0⁷ᵉ…ᵉ⬆️\n█て⁷\n░Athis is included⁷⁷ᵉ…ᵉ⬆️⁙l\0\n░}#[disable[[this for now/ever]]]⁷⁷ᵉ…ᵉュ\0\0)\0\nさᵉ▤\n░█⁷ᵉ▤\n░░⁷\n░☉⁷⁷⁷⁷t⁷ᵉ…ᵉ⬆️⁙l\0\nそ\nュ\0\0*\0t⁷⁷⁷ᵉ…ᵉ⬆️⁙l\0\nそ\n░Y#include notaninclude\n⁷⁷⁷ᵉ…ᵉュ\0\0)\0\n░5preserved_key⁷p⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n█ュ\0\0P\0⁷\n░ュ\0\0{\0⁷⁶😐⁷⁷⁙⁵\0⁷l⁷ᵉ…ᵉ⬆️⁙l\0ᵉひ\nュ\0\0*\0l⁷\nュ\0\0*\0p⁷⁷⁷ᵉ…ᵉュ\0\0)\0\n░9preserved_glob⁷h⁷ᵉ…□ュ\0\0-\0\n█ュ\0\0R\0⁷█⁙❎\0⁷ᵉ…ᵉ⬆️⁙l\0ᵉひ\nュ\0\0*\0█⁷\nュ\0\0*\0h⁷⁷⁷ᵉ…ᵉュ\0\0)\0\nさ⁙⁵\0⁷d⁷ᵉ…□ュ\0\0-\0⁙あ\0d!whatever⁷ᵉ…ᵉ⬆️⁙l\0ᵉうd⁙し\0⁷⁷ᵉ…□ュ\0\0-\0ᵉま⁙⁵\0⁙⁵\0⁷d。subfunc⁷ᵉ…\n█ュ\0\0h\0⁷ᵉ…ᵉ⬆️⁙l\0□も\nュ\0\0*\0d⁷⁙⁵\0⁙て\0⁷⁷ᵉ…ᵉュ\0\0)\0\n░\rkey⁷`⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n█ュ\0\0l\0⁷⁙あ\0\n█ュ\0\0S\0⁷⁷⁙⁵\0⁷\\⁷ᵉ…ᵉ⬆️⁙l\0ᵉひ\nュ\0\0*\0\\⁷\nュ\0\0*\0`⁷⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️ᵉう█‖split⁷\n░Ikey1,key2,key3,123⁷⁷X⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n░■key1⁷⁙あ\0□て\n░■key2⁷\n░ュ\0\0マ\0⁷□て\n░■key3⁷\n░ュ\0\0Y¹⁷⁙も\0⁷⁷⁷⁙⁵\0⁷T⁷ᵉ…ᵉ⬆️⁙l\0ᵉひ\nュ\0\0*\0T⁷ᵉうX░⁷⁷⁷ᵉ…ᵉュ\0\0)\0\n░■glob⁷P⁷ᵉ…□ュ\0\0-\0⁙あ\0█⁙ト\0⁷ᵉ…ᵉ⬆️⁙l\0ᵉひ\n█ュ\0\0^\0⁷\nュ\0\0*\0P⁷⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ▤\n░Ekey1:key2#~~key3,⁷\n░➡️!key1_still$key2█ア+123-key123\nif\nif◝⁷⁷L⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n░」assert⁷ᵉう█⁙リ\0⁷⁙も\0⁷⁙⁵\0⁷H⁷ᵉ…ᵉ⬆️ᵉうH⁙リ\0⁷\n░ᵇ⁷⁷□きᵉ⬆️ᵉう█\rall⁷\nさᵉ▤ᵉぬ□て\n░⁙c\0⁷\n█ュ\0\0C\0⁷⁙も\0⁷⁙⁵\0⁷ᵉぬ□て\n█ュ\0\0あ\0⁷\n█ュ\0\0D\0⁷⁙も\0⁷⁙⁵\0⁷⁷⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️ᵉうD█⁷ᵉ▤ᵉうD░⁷ᵉうD☉⁷⁷⁷@⁷□ュ\0\0,\0ᵉろ\nュ\0\0*\0@⁷⁙⁵\0⁷ᵉ…□ュ\0\0-\0\n█ュ\0\0g\0⁷█Usome_future_pico8_api⁷ᵉ…ᵉ⬆️ᵉう█⁙⁘¹⁷\n█ュ\0\0G\0⁷⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n░)preserved1⁷⁙²¹□て\n░)preserved2⁷⁙⁶¹⁙も\0⁷⁷⁙⁵\0⁷<⁷ᵉ…□ュ\0\0-\0ᵉらᵉう<⁙゛¹⁷⁙²¹⁷<⁙゛¹⁷ᵉ…ᵉ⬆️⁙l\0\n█ュ\0\000は\0⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️ᵉう█1setmetatable⁷ᵉ▤ᵉぬ□て\n░)preserved3⁷\n█ュ\0\0E\0⁷⁙も\0⁷⁙⁵\0⁷ᵉう█。my_meta⁷⁷⁷<⁷ᵉ…ᵉ⬆️⁙l\0ᵉう<⁙2¹⁷⁷ᵉ…□ュ\0\0-\0\n█ュ\0\0ね\0⁷█)g_my_table⁷ᵉ…□ュ\0\0.\0ᵉう█⁙<¹⁷\n█ュ\0\0と\0⁷ᵉら⁶っ⁷⁙²¹⁷⁷ᵉ…ᵉ⬆️⁙l\0ᵉュ\0\0/\0\n█ュ\0\0る\0⁷⁙゛¹⁷⁷ᵉ…□ュ\0\0-\0\n█ュ\0\0や\0⁷█⁙<¹⁷ᵉ…ᵉ⬆️⁙l\0ᵉュ\0\0/\0⁙F¹⁙2¹⁷⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n█ュ\0\0➡️\0⁷\n█ュ\0\0★\0⁷□て\n░\radd⁷ᵉう█⁙U¹⁷⁙も\0⁷⁷⁙⁵\0⁷8⁷ᵉ…ᵉュ\0\0)\0\nュ\0\0*\0008⁷4⁷ᵉ…ᵉ⬆️ᵉう4⁙リ\0⁷ᵉろᵉ⬆️ᵉう4⁙U¹⁷ᵉ▤\n█ュ\0\0b\0⁷⁙²¹⁷⁷⁙²¹⁷⁷ᵉ…ᵉュ\0\0)\0\n█ュ\0\0エ\0⁷0⁷ᵉ…ᵉ⬆️ᵉう0⁙リ\0⁷ᵉろᵉ⬆️ᵉう0⁙U¹⁷\n█ュ\0\0コ\0⁷⁷⁙²¹⁷⁷ᵉ…ᵉュ\0\0)\0⁙⁵\0,⁷□きᵉ⬆️\n█ュ\0\0▥\0⁷\nさᵉ▤ᵉぬ□て⁙⁵¹⁙²¹□て\n░⁵y⁷\n░…⁷⁙も\0⁷⁷⁙⁵\0⁷ᵉぬ□て⁙⁵¹⁙⁶¹□て\n█ュ\0\0ナ\0⁷\n░⬆️⁷⁙も\0⁷⁷⁙⁵\0⁷⁷⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️ᵉう(█⁷ᵉ▤ᵉう(░⁷ᵉう(☉⁷⁷⁷$⁷□ュ\0\0,\0ᵉろ\nュ\0\0*\0$⁷⁙⁵\0⁷ᵉ…ᵉ⬆️⁙R¹ᵉろ\nュ\0\0*\0,⁷⁙⁶¹⁷⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n█ュ\0\0y\0⁷⁙²¹□て\n█ュ\0\0z\0⁷⁙⁶¹□て\n░‖other⁷⁙3¹⁙も\0⁷⁷⁷⁙⁵\0⁷ ⁷ᵉ…□ュ\0\0-\0ᵉう ⁙ˇ¹⁷ ⁙ウ\0⁷□ュ\0\0,\0ᵉろ⁙²¹⁙f\0⁷\n█ュ\0\0ッ²⁷□ュ\0\0,\0\n█ュ\0\0◝\0⁷ᵉ…□ュ\0\0-\0ᵉう█\rcos⁷█\rsin⁷ᵉ…□ュ\0\0-\0ᵉう█⁙け¹⁷█⁙く¹⁷\n█ュ\0\0ン²⁷⁷⁷□ュ\0\0,\0ᵉろ⁙²¹⁙⁶¹⁷□ュ\0\0,\0\n█ュ\0\0⁶¹⁷ᵉ…\n█ュ\0\0¹¹⁷ᵉ…\n█ュ\0\0³¹⁷ᵉ…ᵉュ\0\0)\0ᵉ▤\nさ⁙²¹⁷\nさᵉ▤⁙²¹ᵉ▤⁙⁶¹ᵉ▤⁙3¹\n░😐⁷⁷⁷⁷⁷⁷、⁷ᵉ…ᵉュ\0\0)\0ᵉオ⁙²¹⁙⁶¹⁷「⁷ᵉ…ᵉュ\0\0)\0ᵉ▤⁙²¹ᵉ▤\n░ュ⁸<¹\0⁷ᵉ▤\n░ュ\0\0004□⁷ᵉ▤\n░ュxV4□⁷ᵉ▤\nケ⁙²¹⁷ᵉ▤\nケ\n█ュ\0\0■¹⁷⁷ᵉ▤\nケ\n█ュ\0\0⁙¹⁷⁷ᵉ▤\n░ュ\0\0⁸█⁷ᵉ▤\n░ュ\0ユ\0ユ⁷ᵉ▤\nケ\n░ュ\0\0あ▥⁷⁷\nケ\n░ュ◝◝◝◝⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁘⁷ᵉ…ᵉュ\0\0)\0ᵉ▤\n░	hi⁷ᵉ▤\n░‖hello⁷ᵉ▤\n░■\"hi\"⁷ᵉ▤\n░。'hello'⁷ᵉ▤\n█ュ\0\0*¹⁷ᵉ▤\n░■'hi'⁷ᵉ▤\n░¹⁷ᵉ▤\n█ュ\0\0-¹⁷ᵉ▤\n░\ra\nb⁷ᵉ▤\n░⁵\\⁷ᵉ▤\n░。\0¹²³⁴⁵⁶⁷ᵉ▤\n░。¹²³⁴⁵⁶⁷⁷ᵉ▤\n░」\\\\\\\\\\\\⁷ᵉ▤\n░」\n\n\n\n\n\n⁷\n░!¹²³⁴⁵⁶]]⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷▮⁷ᵉ…ᵉュ\0\0)\0ᵉ▤⁙ム¹ᵉ▤\n█ュ\0\0(¹⁷ᵉ▤\n█ュ\0\0,¹⁷ᵉ▤\n░」\"'hi'\"⁷ᵉ▤\n░Y\"\"\"\"\"'''''hi'''''\"\"\"\"\"⁷ᵉ▤\n░■♥♥♥♥⁷ᵉ▤⁙ム¹ᵉ▤\n░⁵\n⁷\n░U\\\\\\\\\\\\\\\\\\\n\n]]]=]]===]⁷⁷⁷⁷⁷⁷⁷⁷⁷ᶜ⁷ᵉ…ᵉュ\0\0)\0ᵉ▤\n░ュ\0\0\0◝⁷ᵉ▤ᵉア\n█ュ\0\0R¹⁷\n█ュ\0\0⁸¹⁷⁷ᵉ▤ᵉス⁙。²⁙゛²⁷ᵉ▤\nケ⁙。²⁷\nチ⁙。²⁷⁷⁷⁷⁷⁸⁷□ュ\0\0,\0\nナ\nュ\0\0*\0「⁷⁷ᵉ…ᵉュ\0\0)\0\n░x⁷「⁷ᵉ…□ュ\0\0-\0ᵉま⁙⁵\0ᵉノ\n░ュ33¹\0⁷ᵉノ⁙゛²ᵉノ\nュ\0\0000\0█⁷⁙f\0⁷⁷⁷⁷█%tokenhell⁷ᵉ…ᵉ⬆️⁙l\0ᵉ⬆️ᵉう█⁙2²⁷⁙3¹⁷⁷ᵉ…ᵉ⬆️⁙l\0ᵉヘᵉヘ⁙²¹⁙²¹⁷ᵉュ\0\0$\0⁙⁶¹ᵉュ\0\0#\0ᵉろ⁙3¹⁙゛²⁷ᵉュ\0\0\"\0⁙゛²ᵉュ\0\0!\0\n█ュ\0\0ニ\0⁷ᵉュ\0\0 \0ᵉヲᵉム\n█ュ\0\0ハ\0⁷⁙²¹⁷ᵉノ⁙²¹ᵉノ⁙⁶¹ᵉル⁙3¹ᵉユ\nケᵉス⁙²¹ᵉス⁙゛²⁙²¹⁷⁷⁷⁙²¹⁷⁷⁷⁷⁷\n░▤⁷⁷⁷⁷⁷⁷⁷⁷ᵉ…ᵉ⬆️⁙l\0ᵉスᵉス\nチᵉアᵉルᵉノᵉュ\0\0%\0ᵉュ\0\0 \0ᵉュ\0\0!\0ᵉュ\0\0\"\0ᵉ⬆️ᵉう█‖tonum⁷ᵉオᵉュ\0\0$\0ᵉヘ⁙3¹⁙゛²⁷⁙@²⁷⁙⁶¹⁷⁷⁙²¹⁷⁙⁶¹⁷⁙3¹⁷⁙²¹⁷⁙²¹⁷ᵉら⁙²¹⁙3¹⁷⁷⁙3¹⁷⁷⁙⁶¹⁷⁙²¹⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ▤ᵉュ\0\0/\0⁙a¹█⁷ᵉ⬆️⁙⁙¹⁙⁵\0⁷⁷⁴⁷□きᵉ▤\nュ\0\0&\0ᵉ⬆️\n█ュ\0\0²¹⁷ᵉ▤⁙²¹⁙⁶¹⁷⁷⁷\nュ\0\0&\0ᵉ⬆️\n█ュ\0\0\0¹⁷\nュ\0\0&\0ᵉ⬆️⁙m²⁙⁵\0⁷⁷⁷⁷⁷ᵉ…ᵉュ\0\0)\0\n█ユ⁷\0⁷ᵉ…ᵉュ\0\0)\0\n█ヲ⁷ュ\0\0ナ◝⁷□き\n█ュ\0\0▤¹⁷ᵉ…ᵉュ\0\0)\0⁙r²ュ\0\0ト◝⁷ᵉ…ᵉュ\0\0)\0⁙u²ュ\0\0テ◝⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n░\rord⁷ᵉう█⁙▒²⁷□て\n░\rpal⁷ᵉう█⁙✽²⁷⁙も\0⁷⁷⁙⁵\0⁷ュ\0\0ツ◝⁷ᵉ…ᵉュ\0\0)\0ᵉ▤ᵉ⬆️\n█ュ\0\0か¹⁷\n░\r123⁷⁷ᵉ▤ᵉ⬆️\n█ュ\0\0く¹⁷\nさ\n█ュ\0\0★¹⁷⁷⁷ᵉ▤□も\nュ\0\0*\0ュ\0\0ツ◝⁷\n█ュ\0\0お¹⁷⁙▒²⁷ᵉ▤□も\n█ュ\0\0ち¹⁷\n█ュ\0\0そ¹⁷⁙✽²⁷ᵉ⬆️⁙i²⁙²¹⁷⁷⁷⁷⁷ュ\0\0チ◝⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て⁙⁶¹⁙3¹□て⁙⁵¹⁙゛²⁙も\0⁷⁷ᵉ▤\nュ\0\0&\0ᵉ⬆️⁙⬅️²\n░⁵1⁷⁷⁷\n█ュ\0\0ほ¹⁷⁷⁷ュ\0\0タ◝⁷ᵉ…ᵉュ\0\0)\0ᵉら\nュ\0\0*\0ュ\0\0チ◝⁷⁙²¹⁷ュ\0\0チ◝⁷ᵉ…□き\n█ュ\0\0▥¹⁷ᵉ…\n█ュ\0\0あ¹⁷\n█ュ\0\0い¹⁷⁷|⁷ᵉ…□き⁙w²ᵉ…\n█ュ\0\0う¹⁷\n█ュ\0\0え¹⁷⁷|⁷ᵉ…□ュ\0\0-\0ᵉま□ュ\0\0'\0⁙も\0x█⁷ᵉ▤⁙²¹ᵉ▤⁙⁶¹ᵉ▤\nュ\0\0&\0ᵉ⬆️ᵉうx⁙▒²⁷\n█ュ\0\0ふ¹⁷⁷⁷\n█ュ\0\0わ¹⁷⁷⁷⁷⁷█\rxxx⁷□ュ\0\0,\0⁙ち¹□ュ\0\0,\0⁙ち¹\n█ュ\0\0ス²⁷□ュ\0\0,\0ᵉろ⁙²¹⁙²¹⁷□き\nュ\0\0&\0ᵉ⬆️⁙p¹⁙a¹⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️ᵉうュ\0\0ソ◝█⁷ᵉ▤ᵉうュ\0\0ソ◝░⁷ᵉうュ\0\0ソ◝☉⁷⁷⁷ュ\0\0セ◝⁷□ュ\0\0,\0ᵉろ\nュ\0\0*\0ュ\0\0セ◝⁷⁙⁵\0⁷ᵉ…ᵉ⬆️⁙l\0ᵉノ\n░■test⁷ᵉノ\nュ\0\0(\0\n█ア⁷⁷\n░\rstr⁷⁷⁷⁷ᵉ…ᵉ⬆️⁙l\0ᵉらᵉらᵉら\n█ュ\0\0め¹⁷ᵉヘᵉヘᵉュ\0\0$\0\n█ュ\0\0🅾️¹⁷ᵉュ\0\0/\0⁙a¹⁙8\0⁷⁷ᵉう█\r...⁷⁷\nュ\0\0&\0ᵉ⬆️ᵉう█⁙る²⁷⁙⁵\0⁷⁷⁷⁷⁙3¹⁷\nケ⁙3¹⁷⁷⁷ᵉ…ᵉ⬆️\n█ュ\0\0ほ\0⁷ᵉ▤⁙▥²ᵉぬ□て\n░‖__add⁷ᵉま□ュ\0\0'\0⁙も\0xュ\0\0ツ◝⁷\nュ\0\0*\0x⁷⁷□て\n░‖__sub⁷ᵉま\n█ュ\0\0る¹⁷ᵉうx⁙け¹⁷⁷⁙も\0⁷⁷⁙⁵\0⁷⁷⁷ᵉ…□ュ\0\0-\0ᵉま⁙◝²ᵉうx■sret⁷⁷█⁙⁵³⁷ᵉ…ᵉュ\0\0)\0ᵉ▤ᵉうュ\0\0ツ◝☉⁷ᵉ▤ᵉひᵉら⁙▥²⁙▥²⁷\n█ュ\0\0ン¹⁷⁷ᵉュ\0\0/\0ᵉュ\0\0/\0\nさ⁙▥²⁷█⁷░⁷⁷⁷ュ\0\0ス◝⁷ᵉ…ᵉュ\0\0)\0ᵉ▤⁙⬅️²ᵉュ\0\0/\0⁙\r³⁙✽²⁷⁷ュ\0\0シ◝⁷ᵉ…ᵉュ\0\0)\0ᵉ▤ᵉ⬆️⁙i²⁙3¹⁷ᵉ▤ᵉ⬆️ᵉル⁙▥²⁙▥²⁷⁙゛²⁷\nュ\0\0&\0ᵉ⬆️\nュ\0\0&\0ᵉ⬆️ᵉう█⁙⁵³⁷⁙⁵\0⁷⁷⁙⁵\0⁷⁷⁷⁷ュ\0\0サ◝⁷ᵉ…ᵉュ\0\0)\0ᵉぬ□て\n█ュ\0\0⁵²⁷⁙\r³□て⁙∧²⁙\r³⁙も\0⁷⁷⁙\r³⁷ュ\0\0コ◝⁷□きᵉ▤ᵉう█‖inext⁷\n█ュ\0\0H\0⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️ᵉうュ\0\0ケ◝█⁷ᵉ▤ᵉうュ\0\0ケ◝░⁷ᵉうュ\0\0ケ◝☉⁷⁷⁷ュ\0\0ク◝⁷□ュ\0\0,\0ᵉろ\nュ\0\0*\0ュ\0\0ク◝⁷⁙⁵\0⁷ᵉ…ᵉュ\0\0)\0ᵉらᵉ⬆️⁙i²⁙@²⁷⁙3¹⁷ュ\0\0キ◝⁷ᵉ…ᵉュ\0\0)\0⁙²¹ュ\0\0カ◝⁷□ュ\0\0,\0ᵉュ\0\0+\0\nュ\0\0*\0ュ\0\0カ◝⁷\nュ\0\0*\0ュ\0\0キ◝⁷⁷ᵉ…ᵉュ\0\0)\0ᵉら⁙\r³ᵉュ\0\0$\0⁙▥²⁙ハ\0⁷⁷ュ\0\0オ◝⁷□ュ\0\0,\0\n█ュ\0\0❎\0⁷ᵉ…ᵉ⬆️⁙l\0\n░\rsh1⁷⁷□ュ\0\0,\0⁙E³ᵉ…ᵉ⬆️⁙l\0\n░\rsh2⁷⁷□ュ\0\0,\0⁙E³□ュ\0\0,\0\n░ᶠ⁷□ュ\0\0,\0⁙E³□ュ\0\0,\0\n█ュ\0\0+²⁷ᵉ…□ュ\0\0-\0\n░1renaming bug⁷█⁵l⁷ᵉ…□ュ\0\0-\0ᵉま□ュ\0\0'\0⁙も\0ᶜ█⁷□き⁙⁵\0ᵉ…ᵉュ\0\0)\0⁙r²x⁷ᵉ…ᵉュ\0\0)\0⁙u²t⁷ᵉ…ᵉュ\0\0)\0\n█ュ\0\0!\0⁷p⁷ᵉ…ᵉュ\0\0)\0\n█ュ\0\0#\0⁷l⁷ᵉ…ᵉュ\0\0)\0\n█ュ\0\0%\0⁷h⁷ᵉ…ᵉュ\0\0)\0\n█ュ\0\0'\0⁷d⁷ᵉ…ᵉュ\0\0)\0\n█ュ\0\0)\0⁷`⁷ᵉ…ᵉュ\0\0)\0\n█ュ\0\0+\0⁷\\⁷ᵉ…ᵉュ\0\0)\0ᵉう|き⁷X⁷ᵉ…ᵉュ\0\0)\0ᵉう|さ⁷T⁷ᵉ…ᵉュ\0\0)\0ᵉう|そ⁷P⁷ᵉ…ᵉュ\0\0)\0ᵉう|て⁷L⁷ᵉ…ᵉュ\0\0)\0ᵉう|ぬ⁷H⁷ᵉ…ᵉュ\0\0)\0ᵉう|ひ⁷D⁷ᵉ…ᵉュ\0\0)\0ᵉう|ま⁷@⁷ᵉ…ᵉュ\0\0)\0ᵉう|も⁷<⁷ᵉ…ᵉュ\0\0)\0ᵉう|ら⁷8⁷ᵉ…ᵉュ\0\0)\0ᵉう|ろ⁷4⁷ᵉ…ᵉュ\0\0)\0ᵉう|っ⁷0⁷ᵉ…ᵉュ\0\0)\0ᵉう|ア⁷,⁷ᵉ…ᵉュ\0\0)\0ᵉう|オ⁷(⁷ᵉ…ᵉュ\0\0)\0ᵉう|ケ⁷$⁷ᵉ…ᵉュ\0\0)\0ᵉう|ス⁷ ⁷ᵉ…ᵉュ\0\0)\0ᵉう|チ⁷、⁷ᵉ…ᵉュ\0\0)\0ᵉう|ナ⁷「⁷ᵉ…ᵉュ\0\0)\0ᵉう|ノ⁷⁘⁷ᵉ…ᵉュ\0\0)\0ᵉう|ヘ⁷▮⁷ᵉうᶜ⁙Y³⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷█\rfff⁷ᵉ…ᵉ⬆️⁙l\0ᵉ⬆️ᵉう█⁙に³⁷⁙⁵\0⁷⁷ᵉ…\n█ュ\0\0=\0⁷ᵉ…□ュ\0\0-\0⁙²¹█⁙c\0⁷ᵉ…□ュ\0\0-\0ᵉま⁙⁵\0ᵉ▤ᵉう█)old_member⁷ᵉう░⁙や³⁷⁷⁷█!old_name⁷ᵉ…□ュ\0\0-\0ᵉま⁙⁵\0□き⁙⁵\0ᵉ…\n█ュ\0\0/²⁷ᵉ…\n█ュ\0\0000²⁷\n█ュ\0\0█²⁷⁷⁷|⁷⁷█⁙よ³⁷ᵉ…□ュ\0\0-\0ᵉま⁙⁵\0ᵉらᵉらᵉらᵉらᵉら⁙ハ\0\nュ\0\0*\0░⁷⁷\nュ\0\0*\0☉⁷⁷\nュ\0\0*\0😐⁷⁷\nュ\0\0*\0…⁷⁷\nュ\0\0*\0⬆️⁷⁷⁷█\rggg⁷ᵉ…ᵉ⬆️⁙l\0ᵉ⬆️ᵉう█⁙サ³⁷ᵉ▤⁙²¹ᵉ▤⁙⁶¹ᵉ▤⁙゛²ᵉ▤\n░う⁷ᵉ▤⁙チ²\n░ュ\0\0 \0⁷⁷⁷⁷⁷⁷⁷⁷□ュ\0\0-\0ᵉ⬆️⁙l\0\n░■END!⁷⁷█■done⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉ…ᵉ⬆️⁙l\0\n░\rsh4⁷⁷\n█ュ\0\0つ²⁷⁷⁷⁙ミ³⁷ᵉ…ᵉ⬆️⁙l\0\n░\rsh3⁷⁷\n█ュ\0\0ぬ²⁷⁷⁷⁙ユ³⁷⁷\n█ュ\0\0ふ²⁷⁷⁷\n█ュ\0\0ほ²⁷⁷⁷ᵉ…ᵉュ\0\0)\0ᵉら\n█ュ\0\0!²⁷⁙⁶¹⁷ュ\0\0カ◝⁷\n█ュ\0\0ゆ²⁷⁷⁷⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️\n█ュ\0\0‖²⁷ᵉ▤\n█ュ\0\0◀²⁷\n█ュ\0\0•²⁷⁷⁷ュ\0\0ク◝⁷\n█ュ\0\0わ²⁷⁷⁷⁷ュ\0\0ケ◝⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️\n█ュ\0\0ウ¹⁷ᵉ▤\n█ュ\0\0エ¹⁷\n█ュ\0\0ケ¹⁷⁷⁷ュ\0\0セ◝⁷\n█ュ\0\0ケ²⁷⁷⁷⁷ュ\0\0ソ◝⁷\n█ュ\0\0シ²⁷⁷⁷□ュ\0\0,\0⁙ち¹⁙わ²⁙わ²⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0ム²⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0ル²⁷⁷\n█ュ\0\0ワ²⁷⁷⁷⁷⁷⁷⁷ᵉ…□ュ\0\0-\0ᵉらᵉう$⁙c\0⁷ᵉらᵉう$⁙w¹⁷ᵉア\n█ュ\0\0◝²⁷\n█ュ\0\0◜²⁷⁷⁷⁷$⁙c\0⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️\n█ュ\0\0ミ¹⁷\nさ⁙⁶¹⁷⁷,⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️\n█ュ\0\0ム\0⁷ᵉ▤\n█ュ\0\0メ\0⁷\n█ュ\0\0ラ\0⁷⁷⁷$⁷\n█ュ\0\0\r³⁷⁷⁷⁷⁷⁷(⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉ…□ュ\0\0-\0ᵉらᵉう@⁙c\0⁷⁙²¹⁷@⁙c\0⁷ᵉ…ᵉュ\0\0)\0ᵉ⬆️\n█ュ\0\0け\0⁷ᵉ▤\n█ュ\0\0こ\0⁷\n█ュ\0\0そ\0⁷⁷⁷@⁷\n█ュ\0\0*³⁷⁷⁷⁷⁷D⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷"))
__meta:title__

$switch-compiler: parens8
