pico-8 cartridge // http://www.pico-8.com
version 42
__lua__

local real_assert = assert
function assert(cond, num)
    if (num == 38 or num == 68 or num == 69) return cond -- nothing serious, just undocumented minutae
    return real_assert(cond, num)
end--[[$lint: ps8_inst, ps8_val, ps8_binder]]function ps8_const(x) return function() return x end end

function ps8_decode(data)
	local pos = 0
	local function byte()
		pos += 1
		return ord(data, pos)
	end
	local function word()
		return byte() >>> 16 | byte() >>> 8 | byte() | byte() << 8
	end
	return function()
		local ctl, v = byte()
		v, ctl = ctl&252 ~= 252 and ctl>>>2&63, ctl%4
		if (ctl == 0) return v and v-31 or word()
		if (ctl == 3) return ({true, false})[v]
		local len = v or word()<<16
		pos += len
		return sub(data, pos-len+1, pos)
	end
end

do
local ps8_ops, ps8_argc = {function()
	local a = ps8_val()
	return function() return ps8_inst[a] end
end}, split"1,0,0,2,2,2,2,1,2,2,3,2,2,2,1,2,1,2,1,2,2,3,2,1,2,2,2,2,3,3,2,2,3,0,3,2,1,3,3"function run_ps8(bytecode)
	ps8_inst, ps8_val, ps8_binder =
		{}, ps8_decode(bytecode),
		function() ps8_inst, ps8_val, ps8_binder = nil end
	return ps8_ops[ps8_val()]()(ps8_binder())()(--[[$force-safe]]_ENV)
end

local function ps8_runtime(--[[$rename::a]]a, --[[$rename::b]]b, --[[$rename::c]]c)
	local step = ps8_binder
	function ps8_binder()
		a, b, c = a(), b(), c()
		return step()
	end return function()return a end,
function()end,
function(f)return f end,
function(f)return a(f),b(f)end,
function(f)return a(f)(b(f))end,
function(f)return a(f)==b(f)end,
function(f)return a(f)and b(f)end,
function(f)return{a(f)}end,
function(f)return f[a][b]end,
function(f)a(f)return b(f)end,
function(f)f[c]={a(f)}return b(f)end,
function(...)return a(...)+b(...)end,
function(...)return a(...)*b(...)end,
function(f)local u={__index=a({}, f)}return function(...)return b(setmetatable(pack(...),u))end end,
function(f)return(a(f))end,
function(f)return a(f)>b(f)end,
function(f)return -a(f)end,
function(f)f[b]=a(f)end,
function(f)return f[a]end,
function(f)return a(f)or b(f)end,
function(...)return a(...)-b(...)end,
function(t,f)t[a(f)]=b(f)return c(t,f)end,
function(f)return a({b(f)},f)end,
function(f)return #a(f)end,
function(...)return a(...)<<b(...)end,
function(...)return a(...)&b(...)end,
function(...)return a(...)^b(...)end,
function(f)return a(f)~=b(f)end,
function(f)local o=a(f)return o[c](o, b(f))end,
function(t,f)t[b]=f[c]return a(t,f)end,
function(...)return a(...)>>>b(...)end,
function(f)return a(f)<b(f)end,
function(f)if a(f)then return b(f)end return c(f)end,
function(f,v)return v end,
function(f)a(f)[c]=b(f)end,
function(f)return a(f)[b]end,
function(f)return unpack(f,a,f.n)end,
function(f)f[b][c]=a(f)end,
function(f)local t,k=a(f),b(f)t[k]=c(f,t[k])end end

for i,n in inext, split"0,0,0,2,2,2,2,1,0,2,2,2,2,2,1,2,1,1,0,2,2,3,2,1,2,2,2,2,2,1,2,2,3,0,2,1,0,1,3"do
	local function arg(p)
		return p < n
			and ps8_ops[ps8_val()]()
			or ps8_const(p < ps8_argc[i] and ps8_val())
	end
	add(ps8_ops, function()
		return ps8_const(add(ps8_inst, (select(i,
			ps8_runtime(arg(0), arg(1), arg(2))))))
	end)
end
end run_ps8('ま☉てア█そュ\0\0$\0さ████。run_ps8そュ\0\0$\0█☉░█⁵xそ⬆️ュ\0\0%\0█☉」assert…░⁷█…そ⬆️█▤…▤ュ\0\0%\0█☉⁵x█…░░そ⬆️█▤…▤░!\0ᶜ3\n	⁵Aa█も░ュ\0█²\0そ⬆️█▤…▤░■\'"\\\'█オ░☉そ⬆️█▤…▤░	]]█ノ░😐そ█⬆️そュ\0\0$\0█☉█…■e2e3そ⬆️█▤…う█て▤ュ\0\0%\0█☉■e2e3█…░…そ⬆️█▤…う▤░ュ\0ユᶠ\0█ュ\0\0&\0▤░ュ\0@²\0█ュ\0\0(\0░⬆️そて…█……き███スそュ\0\0$\0█☉さ|█⁵aそュ\0\0$\0█☉さ|░⁵bュ\0\0$\0█☉さ|☉⁵c|そて…ュ\0\0%\0█☉⁵c…█ぬ…█ムュ\0\0%\0█☉⁵aそ█ュ\0\0002\0そュ\0\0$\0ュ\0\0%\0█☉⁵b█ュ\0\0003\0⁵nそュ\0\0$\0█ュ\0\0?\0█ュ\0\0005\0█ュ\0\0$\0█☉さ|😐⁵c|そ⬆️█▤…ううう▤█ュ\0\0;\0█ス▤█ュ\0\0:\0█…▤ュ\0\0%\0█ュ\0\0?\0⁵n█ぬ▤ュ\0\0%\0█ュ\0\0?\0██ム░うそっぬ█ュ\0\0;\0█…xそ⬆️█▤…▤アx█ム░きそっひ█ュ\0\0V\0█ぬtそ⬆️█▤…▤アt█ュ\0\0Q\0░ュ▥」	\0そ⬆️█▤…█ュ\0\0H\0░ュ33	\0そっ█☉pそ⬆️█▤…▤アp█☉░さそっ██lそ⬆️█▤…▤アl░ᶠ░そそュ\0\0$\0█☉ま██…█……█ぬ█ス⁵fて…░|⬆️ュ\0\0%\0█☉⁵f██そっ█ュ\0\0001\0hそっ█ュ\0\0003\0dそっ█ュ\0\0005\0`そっ█ュ\0\0B\0\\そっさ|…Xそっさ|⬆️Tそ⬆️█▤…ううううう▤アh█ュ\0\0v\0▤アd█…▤ア`█ぬ▤ア\\█ス▤アX█ュ\0\0m\0▤アT█ュ\0\0m\0░てそュ\0\0$\0█☉ま██ュ\0\0&\0█⁵fそ⬆️█▤…▤⬆️█ュ\0\0w\0█ュ\0\0s\0█…░ぬそても⬆️█ュ\0\0w\0…█…█ぬそ█ュ\0\0002\0█ュ\0\0004\0|そ⬆️█▤…う▤█ュ\0\0;\0█…▤█ュ\0\0?\0█ュ\0\0m\0░ひそて…█ュ\0\0か\0█ス█ュ\0\0く\0|そ⬆️█▤…う█ュ\0\0こ\0▤█ュ\0\0?\0█ス░まそ⬆️█▤…▤ュ\0\0%\0⬆️ュ\0\0%\0█☉■pack⬆️█ュ\0\0w\0…█……█ぬ…█ュ\0\0m\0…█ス…█ュ\0\0m\0█ュ\0\0m\0⁵n█ュ\0\0+\0░もそュ\0\0$\0█☉ま██…█ュ\0\0∧\0…█ュ\0\0∧\0█ュ\0\0∧\0⁵fそ⬆️█▤…▤ュ\0\0%\0⬆️█ュ\0\0ぬ\0█ュ\0\0▥\0⁵n█ュ\0\0#\0░らそっ█…Pュ\0\0"\0らアP█スそ⬆️█▤…▤⬆️ュ\0\0%\0█☉」select…█ム█ュ\0\0▥\0█ぬ░っそュ\0\0$\0█☉█ュ\0\0v\0⁵jそっろ█ぬLュ\0\0"\0らアL█ュ\0\0v\0そっ█ュ\0\0#\0Hュ\0\0"\0らアH█…そ⬆️█▤…▤ュ\0\0%\0█☉⁵j█…░ュ\0█⁘\0そっ█ュ\0\0#\0Dュ\0\0"\0らアD█…そ█ュ\0\0カ\0て⬆️ュ\0\0%\0█☉」ipairsき…█ム█ュ\0\0#\0て⬆️さ@█…さ@░さ@☉そっ█ュ\0\0001\0<そっ█ュ\0\0003\0008ュ\0\0"\0▤ア<██そ⬆️█▤…▤█ュ\0\0セ\0█ぬ░ュ\0█◀\0ュ\0\0"\0█ュ\0\0モ\0そュ\0\0$\0█☉ぬ█ュ\0\0セ\0█…⁵jそ⬆️█▤…▤█ュ\0\0セ\0█ス░ュ\0█▶\0ュ\0\0"\0█ュ\0\0モ\0そ⬆️█▤…░ᵇ░チそ⬆️█▤…▤█ュ\0\0セ\0█ム░ュ▥▥「\0ュ\0\0"\0█ュ\0\0モ\0そ⬆️█▤…█ュ\0\0ヲ\0░ナそ⬆️█▤…▤█ュ\0\0セ\0█ュ\0\0#\0░ュ\0█」\0ュ\0\0"\0█ュ\0\0モ\0そ⬆️█▤…█ュ\0\0ヲ\0░ュアア」\0そ⬆️█▤…▤█ュ\0\0セ\0█ュ\0\0+\0░ュfヒ」\0ュ\0\0"\0█ュ\0\0\n¹そ█ュ\0\0カ\0そュ\0\0$\0█☉█…⁵jそ⬆️█▤…█ュ\0\0ソ\0░ヘュ\0\0"\0█ュ\0\0³¹そ⬆️█▤…█ュ\0\0ヲ\0░ムそ⬆️█▤…█ュ\0\0モ\0░ユそュ\0\0$\0█☉█…⁵kュ\0\0"\0ら█ュ\0\0セ\0█ュ\0\0v\0そュ\0\0$\0█☉ケ█ュ\0\0セ\0█…⁵jそュ\0\0$\0█☉ひュ\0\0%\0█☉⁵k█ぬ⁵k█ュ\0\0ゆ⁴そ⬆️█▤…う▤█ュ\0\0、¹█ム▤█ュ\0\0セ\0█ュ\0\0v\0░ルュ\0\0"\0ら█ュ\0\0、¹█ュ\0\0v\0そュ\0\0$\0█☉ケ█ュ\0\0、¹█…⁵kそ█ュ\0\0リ\0█ュ\0\0も⁴そ⬆️█▤…う█ュ\0\0ュ\0▤█ュ\0\0、¹█ュ\0\0v\0░ヲュ\0\0"\0█ュ\0\0」¹そ█ュ\0\0•¹そュ\0\0$\0█☉ぬ█ュ\0\0、¹█…⁵kュ\0\0"\0▤█ュ\0\0、¹█スそ⬆️█▤…う█ュ\0\0ソ\0█ュ\0\0003¹░ュ\0\0 \0そ█ュ\0\0リ\0そ█ュ\0\0)¹ュ\0\0"\0オ█ュ\0\0ソ\0█ュ\0\0ル\0そ⬆️█▤…う█ュ\0\0ル\0▤█ュ\0\0、¹█…░ュ\0\0!\0そュ\0\0$\0█☉ま████⁵fそュ\0\0$\0█☉█ュ\0\0>¹⁵gそ⬆️█▤…う▤█ュ\0\0x\0█ュ\0\0m\0▤ュ\0\0%\0⬆️█ュ\0\0ぬ\0█ュ\0\0x\0⁵n█ュ\0\0v\0░ュ\0\0"\0そ⬆️█▤…う▤⬆️ュ\0\0%\0█☉⁵g███ュ\0\0m\0▤ュ\0\0%\0⬆️█ュ\0\0ぬ\0█ュ\0\0J¹⁵n█ュ\0\0v\0░ュ\0\0#\0そュ\0\0$\0█☉█ュ\0\0❎\0⁵hそュ\0\0$\0█☉チス░⁵a█…ス░⁵b█ぬス█ュ\0\0⧗\0█ム😐…█……█ぬ…█ス…█ム⬆️ュ\0\0%\0█☉⁵h…█ュ\0\0#\0…█ュ\0\0+\0…█ュ\0\0m\0█ュ\0\0Q\0⁵aそ⬆️█▤…ううううう▤ュ\0\0%\0█ュ\0\0;\0██…▤ュ\0\0%\0█ュ\0\0;\0░█ぬ▤ュ\0\0%\0█ュ\0\0;\0☉█ス▤ュ\0\0%\0█ュ\0\0;\0😐█ム▤ュ\0\0%\0█ュ\0\0;\0…█ュ\0\0#\0▤ュ\0\0%\0█ュ\0\0;\0⬆️█ュ\0\0+\0░ュ\0\0$\0そ⬆️█▤…うううう▤ュ\0\0%\0█ュ\0\0;\0▤█ュ\0\0m\0▤ュ\0\0%\0█ュ\0\0;\0う█ュ\0\0Q\0▤ュ\0\0%\0█ュ\0\0;\0⁵a█…▤ュ\0\0%\0█ュ\0\0;\0⁵b█ぬ▤ュ\0\0%\0█ュ\0\0;\0て█ム░ュ\0\0%\0そュ\0\0$\0█☉ま██き█ュ\0\0∧\0⁵hそっ██4そっま██チス█ュ\0\0T¹█ス█ュ\0\0V¹█ュ\0\0∧\0004そ⬆️█▤…う▤ナ⬆️ア4█ュ\0\0お\0█…▤ュ\0\0%\0█ュ\0\0⧗¹⁵a█ス░ュ\0\0&\0そ⬆️█▤…▤ナ⬆️█ュ\0\0Z¹█ュ\0\0お\0█ぬ░ュ\0\0\'\0そ⬆️█▤…う▤ぬ█…ひ█ム█ュ\0\0#\0░オ▤ヘ░ュ\0\0ラ¹ノ░ュ\0\0◝\0█ム░ュ\0\0ユ¹░ュ\0\0(\0そ⬆️█▤…う▤ひぬ█…█ム█ュ\0\0#\0█ュ\0\0\0¹▤ノヘ█ュ\0\0す¹█ュ\0\0せ¹█ム░ュ\0\0 ᶠ░ュ\0\0)\0そ⬆️█▤…う▤ろム█ぬ█ムろ█ュ\0\0む\0▤ム█ュ\0\0キ\0█ム█ュ\0\0む\0░ュ\0\0*\0そ⬆️█▤…オうユ█…█ぬ█ュ\0\0わ¹⬆️█▤…█ュ\0\0ヲ\0░ュ\0\0+\0░ュ▥」+\0そっチス░⁵fま██さ█⁵zス░⁵z█ス█ュ\0\0V¹██\\そ⬆️█▤…う▤ル█ュ\0\0⌂\0██⁵f█ス▤⬆️さ\\⁵fチス█ュ\0\0カ¹█ム█ュ\0\0V¹███ム░ュ\0\0,\0そ⬆️ュ\0\0%\0█☉1setmetatable…█ュ\0\0⌂\0チス░。__indexま██ア░█ュ\0\0V¹██そ⬆️█▤…▤さ\\\rboo░\rboo░ュ\0\0-\0そュ\0\0\'\0█ュ\0\0⌂\0\\⁵gそュ\0\0$\0ュ\0\0%\0さ\\⁵g⁵gま███░⁵zそ⬆️█▤…▤⬆️さ\\⁵z█ュ\0\0ヲ\0█ュ\0\0ヲ\0░ュ\0\0.\0そュ\0\0$\0█ュ\0\0ヨ¹ま██…█░█ュ\0\0ネ¹\rzooそ⬆️█▤…う▤ル█ュ\0\0⌂\0█う\rzoo█ュ\0\0⌂\0▤⬆️█ュ\0\0ゅ\0…█ぬ█ュ\0\0ョ¹█う░ュ\0\0/\0そっ█…hそっぬ█ュ\0\0🐱\0█…hュ\0\0"\0▤█ュ\0\0🐱\0█ムそ⬆️█▤…█ュ\0\0	²░ュ\0\0000\0そっ█ュ\0\0v\0hて…ュ\0\0%\0█☉■nextき█ュ\0\0#\0て⬆️さ0█…さ0░さ0☉そっ█ュ\0\0001\0,そっ█ュ\0\0003\0(ュ\0\0"\0▤ア,██そ⬆️█▤…▤█ュ\0\0🐱\0█…░ュ\0█2\0て…ュ\0\0%\0█☉\raddチス░」assert█▤█ュ\0\0V¹██そっ█ュ\0\0001\0$そっ█ュ\0\0003\0 そ⬆️ア$…ア █スそ⬆️さ 」assert…▤さ ██ス░ュ\0\0003\0そっ██、そっまヲ█ュ\0\0V¹x█そュ\0\0\'\0█░x███、そっ█☉「そ⬆️ア、チス█ュ\0\0゜²█▤ス░\ruvw░ュ\0\0{\0█ュ\0\0V¹██そ⬆️█▤…▤ュ\0\0%\0█☉\ruvw█ュ\0\0008²░ュ\0\0004\0そ⬆️█ュ\0\0006²ア「そュ\0\0$\0█☉ま██…█ュ\0\0X\0…█ュ\0\0v\0█…⁵fそュ\0\0$\0█☉ま██⬆️█░██⁵sそュ\0\0$\0█☉ま██も█ュ\0\0H²⁵rそ⬆️█▤…う▤ュ\0\0%\0⬆️█ュ\0\0ぬ\0⬆️ュ\0\0%\0█☉⁵s█ュ\0\0w\0⁵n█ス▤ュ\0\0%\0⬆️█ュ\0\0ぬ\0⬆️ュ\0\0%\0█☉⁵r█ュ\0\0w\0⁵n█…░ュ\0\0005\0そっ░ュ\0\0H\0hそっケ█ュ\0\0🐱\0ひ█ム█ぬhそっュ\0\0 \0█ュ\0\0🐱\0█ュ\0\0む\0hそ⬆️█▤…▤█ュ\0\0🐱\0░ュ@\0\0\0░ュ\0\0006\0ュ\0\0"\0ュ\0\0!\0█ュ\0\0🐱\0█…ュ\0\0"\0█ュ\0\0⬇️\0そっ█ュ\0\0008²hそ⬆️█▤…█ュ\0\0d²░ュ\0\0007\0そっ█…⁘そっ█ュ\0\0>¹⁘そ⬆️█▤…▤ュ\0\0%\0█☉■zoom█ュ\0\0m\0░ュ\0\0008\0そ█ュ\0\0⁶²そっ█ぬ▮ュ\0\0"\0⬆️█▤…▤ア▮█ぬ░ュ\0\0009\0そっ█ぬᶜそっ█ス⁸ュ\0\0"\0⬆️█▤…▤ひアᶜア⁸█ュ\0\0+\0░ュ\0█9\0て██そュ\0\0\'\0ま███ス⁴█そ⬆️█▤…▤ぬろ⬆️さ⁴████ュ\0\0●²█ュ\0\0v\0░ュ\0\0:\0そっ██\0そっまヲ█ュ\0\0V¹x⁴さx█\0そ⬆️█▤…▤⬆️⬆️ア\0█████ス░ュ\0\0;\0て██そュ\0\0\'\0まヲ█ュ\0\0V¹tュ\0\0ナ◝て█░そっま█ュ\0\0000²そュ\0\0\'\0ぬ█ュ\0\0◆²█…x██ュ\0\0◆²xュ\0\0"\0う█ュ\0\0ネ¹ら█ュ\0\0ネ¹█ュ\0\0v\0…█ュ\0\0V\0⬆️さt█…ひ█☉█ぬケ█ュ\0\0ネ¹█…█ュ\0\0V\0█ュ\0\0ナ◝█て…⬆️さュ\0\0ナ◝██ュ\0\0h\0…⬆️█ュ\0\0て²░ア⬆️█ュ\0\0て²…█ュ\0\0$¹█…そっ█ュ\0\0001\0ュ\0\0ト◝そっ█ュ\0\0003\0ュ\0\0テ◝そっ█ュ\0\0005\0ュ\0\0ツ◝そっ█ュ\0\0B\0ュ\0\0チ◝そ⬆️█▤…ううううううううう▤⬆️アュ\0\0ト◝███ュ\0\0o\0▤⬆️アュ\0\0テ◝███ュ\0\0さ¹▤⬆️⬆️█ュ\0\0て²█ュ\0\0v\0███…▤⬆️アュ\0\0ツ◝███ュ\0\0.¹▤⬆️アュ\0\0チ◝██░ュ\0\0=\0▤█ュ\0\000み²█ュ\0\0⧗\0▤█ュ\0\0も²░ケ█ュ\0\0り²▤█ュ\0\0ろ²█ュ\0\0005¹▤█ュ\0\0っ²░ュ\0\0>\0░ュ\0\0<\0そュ\0\0$\0█☉█ュ\0\0ラ¹	uuそ⬆️█▤…う▤⬆️ュ\0\0%\0█☉	uu░	me█ュ\0\0チ²█ュ\0\0テ²█ュ\0\0ゃ²そュ\0\0$\0█☉チス░	uu█ュ\0\0ノ¹█ュ\0\0V¹██	uoそ⬆️█▤…う▤ルュ\0\0%\0█☉	uo█ュ\0\0チ²	uu█ュ\0\0チ²▤ナル█ュ\0\0ヒ²█ュ\0\0.\0	uu█ュ\0\0v\0█ュ\0\0ケ²ュ\0\0"\0█うュ\0\0"\0▤█…█…そっ█…ュ\0\0タ◝そュ\0\0$\0█☉まヲ█ュ\0\0V¹xュ\0\0タ◝█ュ\0\0V\0\rspaそっ█ぬュ\0\0ソ◝そ⬆️█▤…▤⬆️ュ\0\0%\0█☉\rspa███…░ュ\0\0?\0そっ█…ュ\0\0セ◝そュ\0\0$\0█☉まヲ█ュ\0\0V¹xュ\0\0セ◝█ュ\0\0V\0\rspbそっ█ぬュ\0\0ス◝そ⬆️█▤…▤⬆️ュ\0\0%\0█☉\rspb███…░ュ\0\0@\0て█ュ\0\0お\0そっ█ュ\0\0001\0ュ\0\0シ◝そっ█ュ\0\0003\0ュ\0\0サ◝そ⬆️█▤…▤アュ\0\0サ◝█ぬ░ュ\0\0A\0ュ\0\0"\0らアュ\0\0シ◝█…そ⬆️█▤…う▤⬆️ュ\0\0%\0█☉\rfff███ム█ュ\0\0	³░ュ\0\0B\0そっ█…ュ\0\0ケ◝てアュ\0\0ケ◝そっ█ュ\0\0ᶠ³\0そュ\0\0$\0█☉まヲ█ュ\0\0V¹xュ\0\0ク◝█ュ\0\0う²\rfffそっぬ█ュ\0\0▶³█…ュ\0\0ケ◝ュ\0\0"\0▤█ュ\0\0▶³█スそ⬆️█▤…うううう▤█ュ\0\0▮³█ス█ュ\0\0■³▤█ュ\0\0⧗²█ぬ▤█ュ\0\0▮³█ュ\0\0#\0▤█ュ\0\0⧗²█ス░ュ\0\0C\0ュ\0\0"\0█ュ\0\0ヤ²て█ュ\0\0v\0そュ\0\0$\0█☉まヲ█ュ\0\0000²tュ\0\0カ◝そ⬆️ュ\0\0%\0█ュ\0\0◆²」assert…▤█ュ\0\0く²█░░ュ\0\0D\0そュ\0\0\'\0ぬ█ュ\0\0く²█…t██ュ\0\0ネ¹\rordそっ█ュ\0\0.\0ュ\0\0オ◝そて…⬆️ュ\0\0%\0█☉\rord…█ぬ█ぬ⬆️⬆️█ュ\0\0007³…█ス█ュ\0\0⬇️²…⬆️█ュ\0\0007³…█ム█…⬆️█ュ\0\0007³…█ュ\0\0#\0█…そュ\0\0$\0⬆️█ュ\0\0007³…█ュ\0\0v\0アュ\0\0オ◝█ュ\0\0001\0⁵xュ\0\0$\0⬆️█ュ\0\0007³…█…█ュ\0\0C³█ュ\0\0003\0⁵x|そ⬆️█▤…▤さュ\0\0オ◝⁵x█ぬ░ュ\0\0E\0て█ュ\0\0お\0そっ█ュ\0\0001\0ュ\0\0エ◝そっ█ュ\0\0003\0ュ\0\0ウ◝そ⬆️█▤…▤アュ\0\0ウ◝█ぬ░ュ\0\0F\0そュ\0\0\'\0ま█ュ\0\0000²そ⬆️█ュ\0\0+³…▤█ュ\0\0ネ¹█ぬ░ュ\0\0G\0██⁴█そ⬆️█ュ\0\0✽²█ュ\0\0お\0そュ\0\0$\0█☉█ュ\0\0v\0\rffgそュ\0\0$\0█☉き…█ュ\0\0h\0█ュ\0\0な²\rfftそっま█ュ\0\0000²そュ\0\0$\0█ュ\0\0◆²ぬュ\0\0%\0█ュ\0\0◆²\rffg█…\rffg█ュ\0\0d³\0そュ\0\0(\0ュ\0\0%\0█☉\rfft█ュ\0\0⧗²ぬュ\0\0#\0█…そ⬆️█▤…う▤ュ\0\0%\0█ュ\0\0j³██ュ\0\0o\0▤ュ\0\0%\0█ュ\0\0j³░█ュ\0\0な²█ュ\0\0\\²そっ█ュ\0\0v\0ュ\0\0ウ◝そっぬ█ュ\0\0S³█ュ\0\0む\0ュ\0\0ウ◝そ⬆️█▤…▤█ュ\0\0S³█ュ\0\0む\0░ュ\0\0I\0そ⬆️█▤…▤░	[[█ュ\0\0|³░ュ\0█I\0ュ\0\0"\0█ュ\0\0ヤ²ュ\0\0"\0▤█ぬ█スそっ█…ュ\0\0ウ◝そ⬆️█▤…█ュ\0\0T³░ュ\0\0J\0ュ\0\0"\0▤█…█ぬュ\0\0"\0█ュ\0\0▒³そ█ュ\0\0🐱³そ⬆️█▤…▤█ュ\0\0S³█ス░ュ▥」J\0そュ\0\0$\0█☉█…⁵iュ\0\0"\0ュ\0\0!\0ュ\0\0%\0█☉⁵i█ュ\0\0h\0そュ\0\0$\0█☉ぬ█ュ\0\0😐³█…⁵iュ\0\0"\0▤█ュ\0\0😐³█ュ\0\0#\0そ⬆️█▤…█ュ\0\0…³░ュ\0\0K\0ュ\0\0"\0█ュ\0\0●³そ█ュ\0\0⬅️³そ⬆️█▤…▤█ュ\0\0😐³█ス░ュ\0\0L\0ュ\0\0"\0█ュ\0\0ヤ²ュ\0\0"\0▤█ぬ█ぬそっ█ムュ\0\0ウ◝そ⬆️█▤…▤█ュ\0\0S³█ム░ュ\0\0M\0そ█ュ\0\0u³ュ\0\0"\0█ュ\0\0●³そっ█ュ\0\0008²ュ\0\0ウ◝そ⬆️█▤…▤█ュ\0\0S³█ュ\0\0008²░ュ\0\0N\0てュ\0\0%\0█☉‖printそっ█ュ\0\0001\0ュ\0\0イ◝て█ュ\0\0003\0そュ\0\0$\0█☉まヲ█ュ\0\0V¹xュ\0\0ア◝█ュ\0\0002²‖printそ⬆️█ュ\0\0こ³█…そ⬆️█▤…▤さュ\0\0ア◝██…░ュ\0\0O\0そュ\0\0$\0█☉アュ\0\0イ◝‖printて██そっまヲ█ュ\0\0V¹xュ\0\0ょ◝█ュ\0\0002²ュ\0\0ゅ◝そ⬆️アュ\0\0ゅ◝█ぬそ⬆️█▤…▤さュ\0\0ょ◝██ぬ░ュ\0\0P\0そュ\0\0\'\0█…⁴█そュ\0\0$\0チス░⁵x█…█ュ\0\0V¹███ぬ⁵xそ⬆️█▤…▤█ュ\0\0✽²█…░ュ\0\0Q\0そュ\0\0\'\0き█…⁴█そ█ュ\0\0ゆ³そ⬆️█▤…▤ュ\0\0%\0█ュ\0\0✽²██…░ュ▥」Q\0そュ\0\0\'\0░⁵1⁴█そ█ュ\0\0ゆ³そ⬆️█▤…▤█ュ\0\0✽²█ュ\0\0ゅ³░ュ33Q\0そュ\0\0\'\0█ュ\0\0>¹⁴█そ█ュ\0\0ゆ³そ⬆️█▤…▤█ュ\0\0●²█ュ\0\0m\0░ュアLQ\0そ⬆️ュ\0\0%\0█☉」printh░■DONE██ュ\0\0ょ◝ュ\0\0ア◝|█ュ\0\0ヨ³そっ█ュ\0\0#\0ュ\0\0ウ◝█ュ\0\0ル³そっ█ュ\0\0+\0ュ\0\0ウ◝█ュ\0\0ル³ュ\0\0"\0▤█…█スそュ\0\0$\0█☉█ぬ⁵i█ュ\0\0ュ³そュ\0\0$\0█☉█ス⁵i█ュ\0\0ュ³█ュ\0\0⁸⁴█ュ\0\0⁵⁴そっ█ぬュ\0\0ウ◝█ュ\0\0\n⁴そっ█スュ\0\0ウ◝█ュ\0\0\n⁴そ█ュ\0\0ᶜ⁴█ュ\0\0□⁴そ█ュ\0\0ᶠ⁴█ュ\0\0□⁴|ュ\0\0カ◝█ュ\0\0+⁴█ュ\0\0002⁴ュ\0\0ク◝て█スそュ\0\0$\0█☉まヲ█ュ\0\0V¹xュ\0\0コ◝█ュ\0\0う²\rfffそっぬ█ュ\0\0\r³█…ュ\0\0シ◝█ュ\0\0>⁴ュ\0\0コ◝|█ュ\0\0I⁴█ュ\0\0I⁴|ュ\0\0ナ◝⁴█ュ\0\0_⁴█ュ\0\0b⁴█ュ\0\0g⁴そっ░ュ\0\0A¹h█ュ\0\0g⁴|そ⬆️█▤…う▤█ュ\0\0「²█…▤ア(█ュ\0\0#\0░ュ\0\0002\0そ█ュ\0\0⁸²て⬆️█ュ\0\0■²…█ュ\0\0□²█ュ\0\0「²█ュ\0\0…⁴||0█ュ\0\0∧⁴█ュ\0\0ふ⁴█ュ\0\0む⁴█ュ\0\0へ⁴そュ\0\0$\0█☉█ぬ⁵j█ュ\0\0ら⁴そ⬆️█▤…█ュ\0\0ヲ\0░ノ█ュ\0\0わ⁴そ█ュ\0\0リ\0█ュ\0\0イ⁴そ█ュ\0\0リ\0█ュ\0\0カ⁴ュ\0\0"\0█ュ\0\0ル\0そ█ュ\0\0リ\0█ュ\0\0コ⁴そ⬆️█▤…█ュ\0\0ヲ\0░ュ\0█「\0█ュ\0\0コ⁴そ⬆️█▤…█ュ\0\0ヲ\0░ス█ュ\0\0テ⁴そ⬆️█▤…オう▤█ュ\0\0ム\0█…▤ア8█ムう▤█ュ\0\0ム\0█ぬ▤█ュ\0\0フ⁴█ュ\0\0#\0█ュ\0\0ウ²そ█ュ\0\0リ\0て⬆️█ュ\0\0ハ\0…█ュ\0\0ヒ\0█ュ\0\0ム\0█ュ\0\0ワ⁴||@そ⬆️█▤…█ュ\0\0ヲ\0█ュ\0\0さ¹そっぬ█ュ\0\0ト\0█…D█ュ\0\0¹⁵そ█ュ\0\0ᵉ¹そ⬆️█▤…オオ▤█ュ\0\0シ\0█ュ\0\0#\0▤█ュ\0\0シ\0█ス▤█ュ\0\0シ\0█…█ュ\0\0な²そっぬ█ュ\0\0シ\0█ュ\0\0ケ\0H█ュ\0\0▮⁵そっ█ュ\0\0#\0ュ\0\0ゃ◝ュ\0\0"\0ュ\0\0!\0アュ\0\0ゃ◝█…█ュ\0\0³⁵そ█ュ\0\0ᵉ¹そ⬆️█▤…オオ▤█ュ\0\0⁙⁵█ュ\0\0#\0▤█ュ\0\0⁙⁵█ス▤█ュ\0\0⁙⁵█…█ュ\0\0な²そっぬ█ュ\0\0⁙⁵█ュ\0\0ケ\0ュ\0\0ゃ◝█ュ\0\0!⁵そ⬆️█▤…▤⬆️█ュ\0\0ゅ\0…█ュ\0\0っ\0█ュ\0\0▥\0█…░ろそっぬ█ュ\0\0っ\0█…P█ュ\0\0001⁵|█')
