pico-8 cartridge // http://www.pico-8.com
version 42
__lua__
function const(x) return function() return x end end
function deserialize(data)
	data = all(split(data, 0x4000, false))
	local pos, refs, chunk = 0x4000, {}

	local function advance()
		if (pos == 0x4000) chunk, pos = data(), 0
	end
	local function byte()
		advance()
		pos += 1
		return ord(chunk, pos)
	end
	local function short() return byte() | byte() << 8 end
	local function word() return byte() >>> 16 | byte() >>> 8 | short() end
	
	local function dive()
		local function hash(res)
			res = res or add(refs, {})
			for k,v in function()
				local key = dive()
				return key, key ~= nil and dive()
			end do res[k] = v end
			return res
		end

		local ctl = byte()
		local v = ctl&252 ~= 252 and ctl>>>2&63
		return select(ctl%4+1,
			function()
				return v and v-31 or word()
			end,
			function()
				local len, res = v and v>>>16 or word(), ""
				repeat
					advance()
					local consumed = min(len, 0x4000-pos>>>16)<<16
					res ..= sub(chunk, pos+1, pos+consumed)
					pos += consumed
					len -= consumed>>16
				until len <= 0
				return add(refs, res)
			end,
			function()
				local res = add(refs, {})
				for i=1,v or short() do res[i] = dive() end
				return hash(res)
			end,
			function()
				return select(v,
					const(), const(true), const(false),
					function()
						local id = short()
						return refs[id]
					end,
					hash)()
			end)()
	end

	return dive()
end
function ps8_asm(n, a, b, c)
	if (n>0) return ps8_ops[a[1]](unpack(a,2)), ps8_asm(n-1, b, c)
	return const(a), const(b), const(c)
end

function run_ps8(fir)
	ps8_inst, ps8_binder = {}, const
	return ps8_asm(1, fir)(ps8_binder())()(--[[$force-safe]]_ENV)
end

ps8_ops = {function(a)
	return function() return ps8_inst[a] end
end}

for i,n in inext, split"0,0,0,1,2,2,0,2,3,2,3,2,1,1,0,2,2,1,2,2,2,2,2,2,2,1,2,2,2,3,2,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,2,0"do
	add(ps8_ops, function(...)
		return const(add(ps8_inst,
			(select(i, ps8_runtime(ps8_asm(n, ...))))))
	end)
end

function ps8_runtime(--[[$rename::a]]a, --[[$rename::b]]b, --[[$rename::c]]c)
	local step = ps8_binder
	function ps8_binder()
		a, b, c = a(), b(), c()
		return step()
	end return function()return a end,
function()end,
function(f)return f end,
function(f)return{a(f)}end,
function(f)return a(f),b(f)end,
function(f)a(f)return b(f)end,
function(f)return f[a][b]end,
function(f)return a(f)(b(f))end,
function(f)a(f)[b(f)]=c(f)end,
function(f)return a(f)==b(f)end,
function(f)if a(f)then return b(f)end return c(f)end,
function(f)f[c]={a(f)}return b(f)end,
function(f)return #a(f)end,
function(f)f[b]=a(f)end,
function(f)return f[a]end,
function(f)return a(f)>b(f)end,
function(...)return a(...)+b(...)end,
function(t,f)t[b]=f[c]return a(t,f)end,
function(f)local u={__index=a({}, f)}return function(...)return b(setmetatable({...},u))end end,
function(f)return a(f)[b(f)]end,
function(f)return a(f)>=b(f)end,
function(f)return a(f)<=b(f)end,
function(f)return a(f)and b(f)end,
function(f)return a(f)or b(f)end,
function(...)return a(...)..b(...)end,
function(f)return not a(f)end,
function(f)return a(f)<b(f)end,
function(...)return a(...)-b(...)end,
function(f)return a(f)~=b(f)end,
function(t,f)t[a(f)]=b(f)return c(t,f)end,
function(f)return a({b(f)},f)end,
function(f)return(a(f))end,
function(f)return -a(f)end,
function(f)return ~a(f)end,
function(f)return @a(f)end,
function(f)return %a(f)end,
function(f)return $a(f)end,
function(...)return a(...)^b(...)end,
function(...)return a(...)*b(...)end,
function(...)return a(...)/b(...)end,
function(...)return a(...)\b(...)end,
function(...)return a(...)%b(...)end,
function(...)return a(...)<<b(...)end,
function(...)return a(...)>>b(...)end,
function(...)return a(...)>>>b(...)end,
function(...)return a(...)<<>b(...)end,
function(...)return a(...)>><b(...)end,
function(...)return a(...)&b(...)end,
function(...)return a(...)^^b(...)end,
function(...)return a(...)|b(...)end,
function(f)f[b][c]=a(f)end,
function(f)return a(f)[b]end,
function(f)a(f)[c]=b(f)end,
function(f)return unpack(f,a)end end run_ps8(deserialize(chr(peek(0, 17152)).."⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉ▤ᵉまᵉきᵉう,█⁷⁙⁷²⁷(⁷ᵉ▤ᵉき⁙(⁵\n░	in⁷⁷ᵉ▤ᵉまᵉき\n█ュ\0\0006	⁷⁙/⁵⁷$⁷ᵉ▤\n█ュ\0\0ナ⁸⁷ᵉ▤⁙iᵇ□ぬᵉきᵉう4⁙z³⁷\n█ュ\0\0⌂⁴⁷⁷ᵉ▤ᵉまᵉき\n█ュ\0\0s⁴⁷ᵉ⬆️ᵉう ░⁷ᵉう ☉⁷⁷⁷、⁷□てᵉそ\nも、⁷⁙⁵\0⁷ᵉ▤ᵉま\n█ュ\0\0ヌ⁸⁷「⁷ᵉ▤\n█ュ\0\0ノ⁸⁷ᵉ▤\n█ュ\0\0ハ⁸⁷ᵉア□っ□っ□っ□っ□っ□っ⁙f\0x⁘⁷d(⁷H0⁷X4⁷T「⁷t$⁷ᵉ▤ᵉまᵉき⁙ナ³ᵉ⬆️⁙)\0⁙R\0⁷⁷p⁷□て⁙エ\0ᵉ▤ᵉま⁙•\0l⁷ᵉ▤ᵉま\n…ᵉき⁙⁷²ᵉ⬆️ᵉうp░⁷ᵉうp☉⁷⁷⁷⁷h⁷□てᵉそ⁙(⁵⁙'⁴⁷⁙⁵\0ᵉ▤□ュ\0\0004\0⁙(⁵p☉⁷ᵉ▤ᵉま⁙g\n`⁷ᵉ▤\n█ュ\0\0N³⁷□て⁙y⁶□てᵉケᵉきᵉうX⁙ミ\n⁷⁙_\0⁷⁙_\0⁷ᵉ▤ᵉきᵉうX⁙ヤ\n⁷⁙⁵\0⁷ᵉ▤ᵉきᵉうX⁙¹²⁷\n█ュ\0\0す³⁷⁷□ぬᵉき⁙▒⁶⁙)\0⁷ᵉ▤\n█ュ\0\0ノ⁴⁷ᵉ▤\n█ュ\0\0ハ⁴⁷ᵉ▤ᵉきᵉうX⁙う⁶⁷⁙)\0⁷□て⁙ユ¹ᵉき⁙ひ⁵ᵉ⬆️⁙ユ¹⁙ョ¹⁷⁷\n█ュ\0\0y	⁷⁷⁷⁷⁷|⁷⁷⁷\n█ュ\0\0k	⁷⁷ᵉ▤□さ⁙ヒ\0\n█ュ\0\0X³⁷ᵉオ⁙ヌ\0⁙に⁴⁷⁷ᵉ▤⁙ひ⁶\n█ュ\0\0r	⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁙⁵\0⁷⁷⁷⁷⁷⁷ᵉ▤□さ⁙に⁵\n█ュ\0\0D	⁷⁙ひ⁵⁷ᵉ▤ᵉまᵉき⁙セᵇᵉ⬆️\n█ュ\0\0?	⁷⁙&ᶜ⁷⁷、⁷\n█ュ\0\0✽	⁷⁷⁷⁷⁷ ⁷⁷⁷⁷⁷⁷⁷⁷ュ\0\0ク◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ⁙f\0tX⁷x\\⁷p8⁷□てᵉナ\nヘ⁙ナ³⁷ᵉチ⁙j³ᵉム⁙ナ³⁙j³⁷⁷⁷ᵉ▤ᵉき⁙⁷²\n░Ubreak outside of loop⁷⁷ᵉア⁙⁵\0⁙エ\0⁷⁷\n█ュ\0\0▥	⁷⁷⁷ュ\0\0キ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ⁙f\0xX⁷`<⁷lt⁷dx⁷p8⁷H、⁷hh⁷\\P⁷D▮⁷t░⁷□てᵉチ\n█ュ\0\0⧗	⁷\n█ュ\0\0イ²⁷⁷ᵉ▤ᵉき⁙⁷²\n░ireturn outside of function⁷⁷□てᵉナᵉナᵉそᵉオ⁙ヒ\0⁙(⁵⁷\n█ュ\0\0\r⁴⁷⁷ᵉきᵉうd⁙E³⁷ᵉ⬆️\n█ュ\0\0つ	⁷ᵉうd⁙▥³⁷⁷⁷⁷ᵉチ⁙⁘⁶\n█ュ\0\0サ⁶⁷⁷⁷ᵉア□っ⁙f\0xd⁷ᵉき⁙⌂⁶⁙⁵\0⁷⁷□ぬ⁙_⁵ᵉ▤\n█ュ\0\0R⁴⁷ᵉ▤ᵉま⁙5\0T⁷ᵉ▤ᵉま⁙み¹P⁷ᵉ▤ᵉま\n…⁙😐²⁷L⁷□て\nュ\0\0!\0ᵉき⁙ひ⁵⁙0⁵⁷⁷ᵉ▤ᵉきᵉうd⁙¹²⁷ᵉ⬆️⁙ョ¹\nュ\0\0!\0⁙_⁵⁷⁷⁷\n█ュ\0\0タ	⁷⁷□てᵉチᵉチᵉそ\nひ⁙ョ¹⁷⁙_\0⁷⁙ユ¹⁷⁙ナ³⁷ᵉア□っ\n█ュ\0\0007⁷⁷ld⁷□ぬ⁙▮⁵ᵉ▤⁙4	ᵉ▤⁙6	□てᵉケᵉきᵉうl⁙ミ\n⁷⁙_\0⁷⁙_\0⁷ᵉ▤ᵉきᵉうl⁙ヤ\n⁷⁙⁵\0⁷ᵉア□っ□っ□っ⁙f\0tl⁷xt⁷pp⁷ᵉき⁙カ\0ᵉき\n█ュ\0\0し³⁷⁙サ\0⁷⁷⁷⁷\n█ュ\0\0カ	⁷⁷⁷⁷|⁷⁷ᵉア□っ⁙ᵇ⁴tL⁷\n█ュ\0\0N	⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷\n█ュ\0\0ニ	⁷⁷⁷ュ\0\0カ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ⁙f\0p$⁷`d⁷d8⁷h`⁷l@⁷x ⁷ᵉ▤ᵉま⁙_	t⁷ᵉ▤ᵉき⁙⁷²\n░	::⁷⁷□てᵉチᵉオ⁙ュ³⁙R\0⁷ᵉそᵉュ\0\0005\0\n█ュ\0\0ヤ	⁷‖depth⁷⁙(⁵⁷⁷ᵉ▤ᵉき⁙/⁵\n░Ulabel already defined⁷⁷ᵉ▤□さ⁙ュ³⁙R\0ᵉュ\0\0 \0□ヲ\n░‖e_len⁷⁙⁘⁶□ヲ\n░⁙てᶜ⁷⁙(⁵□ヲ\n░‖block⁷⁙)\0□ヲ\n░⁵i⁷⁙っ\0⁙f\0⁷⁷⁷⁷⁙⁵\0⁷⁷⁙⁵\0⁷⁷\n█ュ\0\0◝	⁷⁷⁷⁷⁷ュ\0\0オ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ⁙f\0ld⁷PX⁷T8⁷XH⁷\\x⁷p@⁷x ⁷ᵉ▤\n█ュ\0\0ム	⁷□ぬᵉ⬆️⁙⁷²⁙ュ³⁷ᵉ▤\n█ナ⁷ᵉ▤\n█ノ⁷□ぬ⁙み¹ᵉ▤ᵉき⁙を	ᵉ⬆️⁙\\⁵ᵉア□っ□っ□っ□っ□っ□っ⁙f\0tt⁷dd⁷xh⁷p`⁷hP⁷lT⁷ᵉ▤□ュ\0\0004\0ᵉオ⁙カ\0⁙R\0⁷p█⁷□て\nヘ⁙⁷²⁷ᵉ▤ᵉき⁙ュ³\n░=label not found⁷⁷□てᵉチ⁙(⁵ᵉムᵉュ\0\0005\0⁙⁷²⁙てᶜ⁷⁙(⁵⁷⁷ᵉ▤ᵉき⁙ュ³\n░agoto outside of function⁷⁷ᵉ▤ᵉまᵉナᵉオ⁙カ\0\n█ュ\0\0」\n⁷⁷⁙2¹⁷`⁷□てᵉチᵉらᵉュ\0\0005\0⁙⁷²⁙へᶜ⁷⁙5³⁷ᵉムᵉュ\0\0005\0⁙⁷²⁙ゆᶜ⁷\nひᵉュ\0\0005\0⁙⁷²⁙めᶜ⁷⁷⁷⁷ᵉ▤ᵉき⁙ュ³\n░=goto past local⁷⁷⁙⁵\0⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0,\n⁷⁷⁷\n█ュ\0\0.\n⁷⁷⁷⁷⁷⁷ᵉア□っ□っ⁙f\0x\\⁷t`⁷□て\n█ュ\0\0そ⁸⁷ᵉ▤\n█ュ\0\0ち⁸⁷ᵉ⬆️⁙て³⁙j³⁷⁷\n█ュ\0\0007\n⁷⁷⁷⁷`⁷⁷⁷|⁷⁷⁷ュ\0\0エ◝█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ⁙f\0\\ュ\0\0コ◝⁷80⁷th⁷\0ュ\0\0タ◝⁷Xュ\0\0ケ◝⁷⁴ュ\0\0イ◝⁷Dュ\0\0エ◝⁷d$⁷xt⁷ュ\0\0ト◝8⁷ュ\0\0ナ◝`⁷Tュ\0\0ク◝⁷lL⁷`ュ\0\0ス◝⁷⁸ュ\0\0チ◝⁷0P⁷Pュ\0\0キ◝⁷<\0⁷ ▮⁷$x⁷4ᶜ⁷Lュ\0\0カ◝⁷@ュ\0\0オ◝⁷ᶜ、⁷Hュ\0\0ソ◝⁷ᵉ▤⁙;⁷ᵉ▤⁙>⁴□てᵉそ⁙サ\0⁙Zᶜ⁷⁙⁵\0□てᵉそ⁙サ\0⁙gᵇ⁷ᵉ▤⁙シ\nᵉ▤ᵉき⁙/⁵⁙➡️\n⁷⁙ヌ\0⁷⁷□てᵉそ⁙サ\0\n░	if⁷⁷⁙aᶜ□てᵉそ⁙サ\0\n░‖while⁷⁷⁙_⁵□てᵉそ⁙サ\0\n░」repeat⁷⁷⁙✽\n□てᵉそ⁙サ\0\n░\rfor⁷⁷ᵉき⁙む⁶⁙⁵\0⁷□てᵉそ⁙サ\0\n░‖break⁷⁷⁙⁸	□てᵉそ⁙サ\0\n░」return⁷⁷ᵉ⬆️⁙iᵇ⁙エ\0⁷□てᵉそ⁙サ\0\n░‖local⁷⁷⁙そ\n□てᵉそ⁙サ\0\n░■goto⁷⁷\n█ュ\0\0゜⁴⁷□てᵉそ⁙サ\0\n█ュ\0\0メ	⁷⁷ᵉき⁙キ⁶⁙)\0⁷□てᵉチ\n█ュ\0\000み⁵⁷ᵉル⁙<⁴⁙c⁷⁷⁷ᵉきᵉう<█⁷⁙エ\0⁷□てᵉそ⁙サ\0\n░⁵?⁷⁷□ぬᵉ⬆️ᵉき⁙3⁶\n░‖print⁷⁷ᵉき\n█ュ\0\0l⁴⁷\n█ュ\0\0m⁴⁷⁷⁷ᵉ▤\n█ュ\0\0p⁴⁷ᵉ▤\n█ュ\0\0q⁴⁷ᵉア□っ□っ□っ□っ⁙f\0x,⁷p ⁷t$⁷l(⁷ᵉ▤\n█ュ\0\0た³⁷⁙⁵\0⁷⁷⁷⁷|⁷ᵉ▤⁙*	ᵉ▤ᵉま⁙j³、⁷□ぬᵉき⁙i\r⁙⁵\0⁷ᵉ▤ᵉま⁙2\0「⁷ᵉ▤ᵉま⁙5\0⁘⁷ᵉ▤ᵉま⁙み¹▮⁷□てᵉナᵉき\n█ュ\0\0➡️⁴⁷⁙0⁵⁷ᵉき⁙⬇️\r⁙ン²⁷⁷ᵉ▤□ュ\0\0004\0⁙&ᶜt█⁷ᵉき\n█ュ\0\0009⁵⁷⁙⁵\0⁷⁷□てᵉき\n█ュ\0\0J⁵⁷⁙<⁴⁷ᵉきᵉう\0█⁷ᵉ⬆️\nも「⁷\nも⁘⁷⁷⁷□てᵉチᵉスᵉうュ\0\0ナ◝█⁷⁙_\0⁷ᵉう$⁙A\0⁷⁷ᵉア□っ□っ□っ⁙f\0t「⁷x$⁷l▮⁷ᵉ▤ᵉまᵉき⁙⌂⁶⁙}ᵇ⁷p⁷□て\nヘᵉチ⁙ヒ\0ᵉそᵉうp⁙N³⁷⁙て³⁷⁷⁷ᵉ▤ᵉき⁙$\nᵉ⬆️ᵉうx%g_results⁷⁙サ\0⁷⁷ᵉ▤□ュ\0\0004\0⁙⁷²x⁙C\0⁷⁙⁵\0⁷⁷\n█ュ\0\0ち\n⁷⁷⁷⁷□て\nヘ⁙ろ⁶⁷ᵉ▤ᵉきᵉうュ\0\0ト◝█⁷\n░]statement has no effect⁷⁷ᵉア□っ⁙f\0x「⁷ᵉ▤⁙▮⁵⁙⁵\0⁷⁷⁷\n█ュ\0\0ふ\n⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ュ\0\0ウ◝█⁷ᵉ▤□ュ\0\0004\0ᵉア□っ□っ□っ□っ□っ□っ□っ□っ□っ□っ⁙f\0Pュ\0\0ウ◝⁷Xt⁷t@⁷xx⁷@⁘⁷D、⁷pd⁷\\h⁷l`⁷T<⁷ᵉ▤\n█ュ\0\0000³⁷ᵉ▤□さ⁙j³⁙ュ³⁙⁷²⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙ュ³⁙_\0⁷l█⁷ᵉ▤ᵉま⁙ュ³h⁷ᵉ▤ᵉまᵉナᵉチ⁙)\0\n░ュ\0\0◝○⁷⁷⁙⁷²⁷d⁷ᵉ▤ᵉま⁙•\0`⁷□てᵉチᵉチᵉス⁙V⁵\nひ⁙😐²⁷⁷\nヘᵉきᵉうx⁙E³⁷ᵉ⬆️ᵉオ⁙😐²⁙V⁵⁷ᵉうx⁙▥³⁷⁷⁷⁷⁷\nヘᵉチ⁙む⁶\n█ュ\0\0i\n⁷⁷⁷⁷□ぬᵉき⁙F\n⁙5³⁷ᵉ▤\n█ュ\0\0I¹⁷ᵉ▤\n█ュ\0\0J¹⁷□て⁙ョ¹ᵉ▤ᵉき⁙$\nᵉ⬆️⁙5³⁙ョ¹⁷⁷□て⁙웃²ᵉ▤ᵉき⁙に⁵⁙Zᶜ⁷□てᵉら⁙⁷²⁙2¹⁷ᵉ▤⁙ヌᵇ\n█ュ\0\0&ᵇ⁷⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙ュ³⁙_\0⁷l█⁷ᵉ▤\n█ュ\0\0:³⁷ᵉア□っ□っ□っ□っ⁙f\0`h⁷dx⁷p`⁷\\d⁷□ぬ⁙⁵\0ᵉ▤⁙ふ¹ᵉ▤⁙ほ¹□ぬᵉ⬆️⁙_\0⁙}	⁷ᵉ▤⁙a³ᵉ▤⁙c³□てᵉス⁙ヒ\0⁙ヌ\0⁷ᵉ▤□ぬᵉきᵉオ⁙サ\0⁙ヒ\0⁷⁙)\0⁷ᵉ▤⁙ふ¹⁙ほ¹⁷|⁷□て⁙カ\0□てᵉルᵉきᵉうd⁙♪³⁷⁙カ\0⁷\n█ュ\0\0▒⁵⁷⁷□てᵉら⁙っ\0⁙に⁴⁷ᵉ▤ᵉきᵉうd⁙う⁶⁷⁙)\0⁷\n█ュ\0\0ᵇᵇ⁷⁷ᵉ⬆️⁙カ\0⁙R\0⁷⁷□てᵉルᵉうt⁙てᶜ⁷⁙5³⁷⁙⁘ᵉᵉ▤ᵉまᵉうt⁙ゆᶜ⁷l⁷□てᵉら⁙っ\0ᵉうt⁙へᶜ⁷⁷ᵉ▤\n█ュ\0\0⁸ᵇ⁷\n█ュ\0\0◀ᵇ⁷⁷ᵉ▤□ぬ⁙'⁴\n█ュ\0\0¹ᵇ⁷|⁷ᵉ▤⁙♪⁵\n█ュ\0\0、ᵇ⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0⁘ᵇ⁷⁷⁷⁙⁘ᵉ⁷⁷⁷|⁷⁷⁷|⁷⁷⁷⁷⁷⁷\n█ュ\0\0.ᵇ⁷⁷⁷\n█ュ\0\0(ᵇ⁷⁷⁷⁷|⁷⁙ユ\r⁷⁷⁷⁷⁷⁷⁷⁷L█⁷ᵉ▤□ュ\0\0004\0ᵉナᵉチᵉうx⁙A\0⁷ᵉュ\0\0 \0□ヲ\n░⁙ノ³⁷⁙て³□ヲ\n░■_env⁷⁙て³□ヲ\n█ュ\0\0d\0⁷⁙て³⁙f\0⁷⁷⁷⁙⁵\0⁷⁷ᵉュ\0\0 \0□ヲ\n█ュ\0\0008ᵇ⁷⁙て³⁙f\0⁷⁙⁵\0⁷⁷D█⁷ᵉ▤ᵉま⁙iᵇュ\0\0ア◝⁷□てᵉス⁙(⁵\n█ュ\0\0フ³⁷⁷ᵉ▤ᵉき⁙3⁶\n░9unexpected end⁷⁷□ぬᵉきᵉうx⁙z³⁷⁙ひ⁵⁷ᵉ▤ᵉまᵉきᵉうュ\0\0ょ◝█⁷ᵉ⬆️ᵉうュ\0\0ょ◝░⁷ᵉうュ\0\0ょ◝☉⁷⁷⁷ュ\0\0ゅ◝⁷□てᵉそ\nもュ\0\0ゅ◝⁷⁙⁵\0⁷ᵉア□っ□っ⁙f\0xx⁷pュ\0\0ア◝⁷ᵉ▤ᵉまᵉナᵉチ\n█ュ\0\0007ᵇ⁷ᵉュ\0\0 \0□ヲ⁙9ᵉ⁙)\0□ヲ\n█ュ\0\0009ᵇ⁷⁙)\0□ヲ⁙6ᵉᵉうx⁙C\0⁷⁙f\0⁷⁷⁷⁙⁵\0⁷⁷ᵉュ\0\0 \0□ヲ⁙9ᵉ⁙)\0⁙f\0⁷⁙⁵\0⁷⁷t⁷ᵉ▤ᵉまᵉき⁙サ\0ᵉュ\0\0 \0□ヲ⁙て³⁙R\0⁙f\0⁷⁙⁵\0⁷⁷l⁷□て⁙ヒ\0ᵉき⁙し⁶⁙ヒ\0⁷⁙⁵\0⁷⁷⁷⁷ᵉ▤ᵉき\n█ュ\0\0Oᵇ⁷⁙⁵\0⁷ᵉ▤ᵉまᵉき\n█ュ\0\0Iᵇ⁷ᵉ⬆️\n█ュ\0\0Jᵇ⁷⁙iᵉ⁷⁷ュ\0\0ゅ◝⁷\n█ュ\0\0lᵇ⁷⁷⁷⁷⁷ュ\0\0ょ◝⁷⁷\n█ュ\0\0nᵇ⁷⁷⁷⁷⁷⁷ュ\0\0ウ◝⁷⁷ュ\0\0エ◝⁷⁷ュ\0\0オ◝⁷⁷ュ\0\0カ◝⁷⁷ュ\0\0キ◝⁷⁷ュ\0\0ク◝⁷⁷ュ\0\0ケ◝⁷⁷ュ\0\0コ◝⁷⁷ュ\0\0サ◝⁷⁷ュ\0\0シ◝⁷⁷ュ\0\0ス◝⁷⁷ュ\0\0セ◝⁷⁷ュ\0\0ソ◝⁷⁷ュ\0\0タ◝⁷⁷ュ\0\0チ◝⁷⁷ュ\0\0ツ◝⁷⁷⁷ュ\0\0テ◝⁷⁷ュ\0\0ト◝⁷⁷ュ\0\0ナ◝⁷⁷\0⁷⁷⁴⁷⁷⁸⁷⁷ᶜ⁷⁷▮⁷⁷⁘⁷⁷「⁷⁷、⁷⁷ ⁷⁷$⁷⁷(⁷⁷,⁷⁷0⁷⁷4⁷⁷8⁷<⁷@⁷D⁷H⁷|⁷L⁷P⁷|⁷T⁷X⁷\\⁷`⁷d⁷h⁷|⁷⁷⁷⁷|⁷⁷`‖parse⁷ᵉ▤□ぬᵉ⬆️⁙ホ⁷⁙⁙²⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ag_show_max_items⁷□ュ\0\0004\0⁙5\0`1g_hex_output⁷⁷|⁷ᵉ▤ᵉまᵉュ\0\0 \0□ヲ\n░⁵\0⁷\n░\r000⁷□ヲ\n░⁵ᵉ⁷\n░\r014⁷□ヲ\n░⁵ᶠ⁷\n░\r015⁷⁙f\0⁷⁷⁷⁙⁵\0⁷8⁷□ぬᵉきᵉう`⁙(\0⁷⁙▒⁶⁷□ぬᵉき⁙h\rᵉ⬆️ᵉう4░⁷ᵉう4☉⁷⁷⁷ᵉ▤ᵉま⁙2\0000⁷ᵉ▤ᵉま⁙5\0,⁷□てᵉそ\nも0⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0ᵉア□っ\n█ュ\0\0o\0⁷l8⁷ᵉ▤ᵉま⁙_\0x⁷□て⁙=²ᵉ▤ᵉまᵉき\n█ュ\0\0u\0⁷⁙:\n⁷p⁷ᵉ▤ᵉまᵉオ⁙ヒ\0⁙サ\0⁷h⁷□て⁙ヌ\0ᵉ▤ᵉまᵉノᵉき⁙/¹ᵉ⬆️⁙)\0ᵉ⬆️⁙_\0⁙░²⁷⁷⁷ᵉノ⁙ャ⁷ᵉノ⁙ヌ\0ᵉき⁙/¹\n█ュ\0\0p¹⁷⁷⁷⁷⁷█⁷ᵉ▤ᵉまᵉろ⁙カ\0⁙、\n⁷x⁷ᵉ▤⁙@²\n█ュ\0\0\0ᶜ⁷⁷⁷⁷\n█ュ\0\0ヲᵇ⁷⁷⁷⁷ᵉノ\n█ュ\0\0セ¹⁷ᵉノ⁙)\0⁙やᵉ⁷⁷⁷⁷⁷`。requote⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉル\n█ュ\0\0🅾️²⁷⁙I⁴⁷⁙⁙²□てᵉオᵉうx⁙v³⁷⁙)\0⁷⁙⁙²□てᵉナᵉそ⁙っ\0⁙て³⁷ᵉき\n█ュ\0\0j\0⁷ᵉき⁙★³\n█ュ\0\0⁸³⁷⁷⁷⁷⁙⁙²ᵉ▤ᵉま⁙っ\0t⁷ᵉ▤ᵉま⁙_\0p⁷□てᵉら⁙サ\0⁙R\0⁷⁙エ\0□て\nヘᵉきᵉうx⁙ぬ\0⁷ᵉき⁙★³\n█ュ\0\0と³⁷⁷⁷⁷⁙⁙²ᵉ▤\n█ュ\0\0&⁴⁷\n█ュ\0\0⁘ᶜ⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷`5is_identifier⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉま⁙わᵉt⁷□てᵉそ⁙R\0\n█ュ\0\0v⁵⁷⁷⁙フᵉ□てᵉそ⁙R\0\n░。boolean⁷⁷ᵉナᵉチ⁙)\0\n█ュ\0\0y⁵⁷⁷\n█ュ\0\0|⁵⁷⁷□てᵉそ⁙R\0⁙ᵉᵉ⁷ᵉきᵉうx‖tostr⁷ᵉ⬆️⁙)\0ᵉうx⁙zᵉ⁷⁷⁷□てᵉそ⁙R\0⁙I⁴⁷ᵉきᵉうx⁙よᵉ⁷⁙)\0⁷□てᵉチᵉそ⁙R\0⁙Z⁷⁷\n█ュ\0\0;¹⁷⁷ᵉ▤ᵉま⁙⁘	p⁷ᵉ▤ᵉま⁙て³l⁷ᵉ▤ᵉま⁙て³h⁷□ぬᵉ⬆️ᵉうx⁙Y³⁷⁙)\0⁷□ぬᵉき⁙/⁵ᵉ⬆️ᵉうd░⁷ᵉうd☉⁷⁷⁷ᵉ▤\n█ュ\0\0¥⁷⁷ᵉ▤\n█ュ\0\0•⁷⁷□てᵉそ⁙5³⁙⁵\0⁷ᵉノ⁙サ\0\n█ュ\0\0カ³⁷⁷□てᵉそ⁙ヒ\0ᵉうx⁙xᵉ⁷⁷ᵉ▤ᵉまᵉノ⁙サ\0\n░」,<...>⁷⁷p⁷\n█ュ\0\0006ᶜ⁷⁷□てᵉら⁙ヒ\0⁙て³⁷ᵉ▤ᵉまᵉノ⁙サ\0⁙0⁵⁷p⁷ᵉ▤ᵉまᵉきᵉうx1value_to_str⁷ᵉ⬆️⁙に⁴⁙_\0⁷⁷X⁷□てᵉそ⁙5³\n█ュ\0\0●⁷⁷⁷ᵉ▤ᵉまᵉノ⁙サ\0⁙😐²⁷p⁷ᵉ▤ᵉま⁙5³h⁷ᵉ▤⁙♪⁵□ぬᵉき⁙/⁵ᵉ⬆️\n█ュ\0\0001ᶜ⁷⁙5³⁷⁷\n█ュ\0\0fᶜ⁷|⁷⁷⁷⁷□てᵉきᵉうx⁙トᵉ⁷⁙5³⁷ᵉ▤ᵉまᵉノ⁙サ\0ᵉノ⁙5³ᵉノ⁙ン²⁙😐²⁷⁷⁷p⁷\n█ュ\0\0Kᶜ⁷⁷ᵉ▤ᵉまᵉノ⁙サ\0ᵉノ⁙-²ᵉノᵉき\n█ュ\0\0@ᶜ⁷ᵉ⬆️⁙5³⁙_\0⁷⁷ᵉノ\n░	]=⁷⁙😐²⁷⁷⁷⁷p⁷⁙?ᶠ⁷⁷⁷⁷⁷\n█ュ\0\0`ᶜ⁷⁷⁷⁷⁷⁷|⁷d⁷⁷⁷⁷ᵉノ\n█ュ\0\0l⁶⁷ᵉノᵉき\n█ュ\0\0#ᶜ⁷⁙R\0⁷⁙♪⁸⁷⁷⁷⁷⁷⁷⁷⁷⁷`⁙'ᶠ⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉそ⁙Z\0⁙'⁴⁷⁙)\0□て⁙a\nᵉ▤ᵉま⁙\n¹█⁷ᵉ▤ᵉまᵉきᵉうx\rmin⁷ᵉ⬆️\n░オ⁷⁙⬆️⁴⁷⁷t⁷ᵉ▤ᵉま⁙R\0p⁷ᵉ▤⁙s⁵□て⁙u⁵ᵉ▤\n█ュ\0\0と⁴⁷ᵉ▤ᵉま⁙⬆️⁴T⁷ᵉ▤ᵉま\n█ュ\0\0002\0⁷P⁷□て\n█ュ\0\0レ³⁷ᵉ⬆️⁙)\0⁙😐²⁷ᵉ▤□さ⁙😐²ᵉユ⁙ユ¹⁙R\0⁷ᵉオ⁙Z\0⁙ユ¹⁷⁷ᵉ▤\n█ュ\0\0ュ³⁷\n█ュ\0\0♥ᶜ⁷⁷⁷⁷⁷⁷⁷□てᵉら⁙っ\0⁙て³⁷ᵉ▤ᵉまᵉノ⁙)\0⁙웃¹⁷█⁷ᵉ▤ᵉま\n█ュ\0\0g³⁷h⁷□てᵉそᵉき⁙く⁶⁙ヌ\0⁷⁙Z⁷⁷ᵉ▤ᵉま⁙\n¹d⁷ᵉ▤ᵉまᵉうh⁙N³⁷`⁷ᵉ▤⁙³ᶜ□て⁙y⁶ᵉ▤ᵉまᵉノ⁙)\0⁙2¹⁷█⁷ᵉ▤⁙♪⁵\n█ュ\0\0なᶜ⁷⁷⁷□てᵉら⁙g\n⁙て³⁷ᵉ▤ᵉまᵉノ⁙2¹\n░	, ⁷⁷d⁷ᵉ▤ᵉまᵉノ⁙2¹ᵉき⁙Fᶠ\n█ュ\0\0n	⁷⁷⁷d⁷ᵉ▤⁙ひ⁶\n█ュ\0\0こᶜ⁷⁷⁷⁷\n█ュ\0\0きᶜ⁷⁷⁷⁷⁷⁷ᵉ▤ᵉまᵉノ⁙)\0⁙ヌ\0⁷█⁷\n█ュ\0\0∧ᶜ⁷⁷⁷⁷⁷\n█ュ\0\0つᶜ⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0ねᶜ⁷⁷⁷⁷`9results_to_str⁷ᵉ▤ᵉきᵉう`■poke⁷ᵉ⬆️\n░ュ\0\0-_⁷⁙_\0⁷⁷ᵉ▤ᵉきᵉう`\rcls⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0\n░	> ⁷`!g_prompt⁷ᵉ▤□ぬᵉ⬆️⁙\n¹ᵉ⬆️⁙_\0⁙て³⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`。g_input⁷ᵉ▤□ュ\0\0004\0⁙5\0`5g_input_lines⁷□ュ\0\0004\0⁙み¹`5g_input_start⁷⁷⁷|⁷ᵉ▤□ぬᵉ⬆️⁙_\0\n░ア⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`1g_cursor_pos⁷□ュ\0\0004\0⁙5\0`5g_cursor_time⁷⁷|⁷ᵉ▤□ぬᵉ⬆️\n…⁙\n¹⁷⁙_\0⁷ᵉ▤□ュ\0\0004\0⁙2\0`%g_history⁷□ュ\0\0004\0⁙5\0`-g_history_i⁷⁷|⁷ᵉ▤□ュ\0\0004\0⁙⁙²`。g_abort⁷ᵉ▤□ぬᵉ⬆️⁙て³⁙_\0⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ig_num_output_lines⁷□ュ\0\0004\0⁙5\0`」g_line⁷⁷|⁷ᵉ▤□ぬ\n█ュ\0\0ゅ⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ig_enable_interrupt⁷□ュ\0\0004\0⁙5\0`Eg_enable_autoflip⁷⁷|⁷ᵉ▤□ュ\0\0004\0\n…ᵉ⬆️⁙2⁸ᵉ⬆️⁙{⁸ᵉ⬆️⁙░⁸ᵉ⬆️⁙n⁸ᵉ⬆️⁙a⁸ᵉ⬆️⁙%⁸ᵉ⬆️⁙n⁸ᵉ⬆️⁙セ⁷ᵉ⬆️\n░ひ⁷ᵉ⬆️⁙2⁸ᵉ⬆️\n█ュ\0\0⬆️⁵⁷⁙n⁸⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷`‖g_pal⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉナᵉルᵉュ\0\0005\0ᵉき⁙⌂⁶\nュ\0\0007\0░⁷⁷⁙N³⁷⁙て³⁷\nヘᵉうx⁙トᶠ⁷⁷⁷ᵉきᵉうx⁙f\r⁷ᵉ⬆️⁙)\0\n█ュ\0\0ミᶜ⁷⁷⁷ᵉ▤ᵉき⁙$\nᵉ⬆️\n█ュ\0\0す\n⁷ᵉき⁙Pᶠ⁙)\0⁷⁷⁷⁙⁵\0⁷⁷⁷x⁙f\r⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉきᵉうx⁙しᶠ⁷ᵉ⬆️\n░ュ\0\0000_⁷⁙_\0⁷⁷⁙⁵\0⁷⁷`。unpause⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉア\n█ュ\0\0Qᵇ⁷□て\nュ\0\0!\0ᵉき\n█ュ\0\0す⁸⁷\n░ル⁷⁷⁷ᵉき⁙「▮\n░ヲ⁷⁷⁙⁵\0⁷⁷⁷`!get_keys⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙f\0l`⁷ᵉ▤\n█ュ\0\0ホᵇ⁷□ぬ\n█ュ\0\0け²⁷ᵉ▤⁙4	ᵉ▤⁙6	□て⁙a\nᵉ⬆️⁙カ\0\n█ュ\0\0▶⁷⁷⁷□て⁙=²ᵉ▤ᵉまᵉき\n█ュ\0\0⁷³⁷⁙:\n⁷h⁷ᵉ▤ᵉまᵉケ⁙ヌ\0\n█ュ\0\0g\0⁷⁷d⁷□てᵉケ⁙R\0ᵉナᵉチ⁙2¹\n█ュ\0\0⁶\r⁷⁷\n░ュ\0\0 \0⁷⁷⁷ᵉ▤⁙ツᵉᵉ▤ᵉま⁙て³t⁷□て⁙Z\0ᵉ▤ᵉき⁙Z\0ᵉ⬆️⁙カ\0ᵉ⬆️⁙ヌ\0⁙)▮⁷⁷⁷□てᵉそ⁙ヌ\0⁙웃¹⁷ᵉ▤⁙ツᵉᵉ▤\n█ュ\0\0◀\r⁷ᵉ▤⁙@²\n█ュ\0\0+\r⁷⁷⁷⁷ᵉ▤ᵉまᵉろ⁙R\0ᵉナᵉチ⁙2¹⁙)²⁷⁙_\0⁷⁷t⁷\n█ュ\0\0•\r⁷⁷⁷⁷\n█ュ\0\0#\r⁷⁷⁷⁷\n█ュ\0\0%\r⁷⁷⁷⁷\n█ュ\0\0\r\r⁷⁷⁷⁷⁷|⁷⁷⁷`!walk_str⁷ᵉ▤□ュ\0\0004\0ᵉア⁙S³□ぬ⁙$▮□ぬ⁙2\0□ぬ⁙5\0□ぬᵉきᵉうp⁙Q▮⁷ᵉ⬆️⁙)\0ᵉア□っ□っ⁙ ⁷x░⁷pt⁷□てᵉそ⁙カ\0⁙)\0⁷ᵉ▤□ぬᵉ⬆️⁙う¹⁙⁴¹⁷ᵉ▤□ュ\0\0004\0⁙2\0t█⁷□ュ\0\0004\0⁙5\0p█⁷⁷|⁷⁙⁵\0⁷⁙⁵\0⁷⁷⁷⁷ᵉ▤⁙a³ᵉ▤⁙c³ᵉ▤\n█ュ\0\0.¹⁷□てᵉケ⁙Z\0⁙ヒ\0⁷ᵉ▤□ぬᵉ⬆️⁙ヌ\0⁙2¹⁷ᵉ▤□ュ\0\0004\0⁙2\0x█⁷□ュ\0\0004\0⁙5\0t█⁷⁷|⁷□て\n█ュ\0\0ユ⁸⁷ᵉ▤ᵉまᵉろ⁙2¹⁙_\0⁷d⁷ᵉ⬆️⁙ナ³ᵉ⬆️⁙j³⁙2¹⁷⁷⁷\n█ュ\0\0J\r⁷⁷⁷\n█ュ\0\0L\r⁷⁷⁷⁷⁷|⁷t⁷x⁷|⁷⁷`!str_i2xy⁷ᵉ▤□ュ\0\0004\0ᵉア⁙S³□ぬ⁙_\0□ぬ⁙⁙²□ぬᵉき\n█ュ\0\0003\r⁷ᵉ⬆️⁙)\0ᵉア□っ□っ□っ□っ⁙f\0pt⁷lx⁷t░⁷x☉⁷□てᵉチᵉチᵉそ⁙カ\0⁙⁴¹⁷ᵉそ⁙R\0⁙う¹⁷⁷\n█ュ\0\0◀\n⁷⁷ᵉ▤□ュ\0\0004\0⁙)\0l█⁷ᵉ▤□ュ\0\0004\0⁙エ\0p█⁷□てᵉチᵉナᵉム⁙カ\0⁙⁴¹⁷ᵉチ\n█ュ\0\0\\\r⁷ᵉム⁙R\0⁙う¹⁷⁷⁷⁙…▮⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙)\0⁙_\0⁷l█⁷ᵉ▤\n█ュ\0\0a\r⁷⁙⁵\0⁷⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0k\r⁷⁷⁷⁷⁷ᵉ▤⁙a³ᵉ▤⁙c³ᵉ▤⁙j▮□て\nヘ⁙j³⁷ᵉ▤□ュ\0\0004\0ᵉナᵉチᵉケ⁙う¹⁙2¹⁷⁙ヒ\0⁷ᵉユ⁙ヒ\0⁙_\0⁷⁷x█⁷□て⁙t▮ᵉ▤\n█ュ\0\0H\r⁷ᵉ⬆️⁙ナ³⁙2¹⁷⁷\n█ュ\0\0x\r⁷⁷⁷\n█ュ\0\0z\r⁷⁷⁷⁷⁷|⁷t⁷x⁷⁷`!str_xy2i⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉそᵉき⁙く⁶⁙⁴¹⁷⁙⁵\n⁷ᵉ▤ᵉきᵉうx⁙Q▮⁷ᵉ⬆️⁙)\0ᵉア□っ□っ□っ□っ⁙f\0l😐⁷xx⁷t░⁷p☉⁷ᵉ▤ᵉき\n█ュ\0\0ラᶜ⁷ᵉ⬆️⁙Z\0ᵉ⬆️ᵉろ⁙R\0ᵉュ\0\0(\0⁙う¹⁙{⁸⁷⁷ᵉ⬆️ᵉろ⁙サ\0ᵉュ\0\0(\0⁙⁴¹⁙a⁸⁷⁷\n█ュ\0\0ぬ⁷⁷⁷⁷⁷⁷⁙⁵\0⁷⁷⁷⁷⁙⁵\0⁷ᵉ▤ᵉき⁙わ▮ᵉ⬆️ᵉチ⁙)\0ᵉノ\n░\r⁶rw⁷⁙)\0⁷⁷ᵉ⬆️⁙Z\0\n█ュ\0\0007\r⁷⁷⁷⁷⁙⁵\0⁷⁷⁷`%str_print⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙ˇ\0`p⁷□ぬᵉき\n█ュ\0\0い²⁷⁙)\0⁷ᵉ▤⁙4	ᵉ▤⁙6	ᵉ▤⁙8	ᵉ▤⁙U	□ぬ⁙_\0ᵉ▤ᵉきᵉうx⁙シ▮⁷ᵉ⬆️⁙)\0ᵉ⬆️⁙Z\0ᵉ⬆️⁙う¹ᵉア□っ□っ□っ□っ□っ□っ⁙f\0ht⁷ll⁷th⁷dx⁷\\`⁷xd⁷□てᵉチᵉス⁙ナ³⁙>ᵉ⁷ᵉムᵉオ⁙R\0⁙ナ³⁷⁙)\0⁷⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙ナ³⁙_\0⁷x█⁷\n█ュ\0\0ミ\r⁷⁷ᵉ▤ᵉま⁙⁵\0p⁷□てᵉチ\n█ュ\0\0て\r⁷ᵉスᵉオ⁙ヒ\0⁙ナ³⁷⁙)\0⁷⁷ᵉ▤ᵉまᵉオ⁙ヌ\0⁙ナ³⁷p⁷ᵉ▤ᵉまᵉュ\0\0005\0ᵉうd⁙ラᶠ⁷…⁷`⁷□てᵉそ⁙サ\0⁙⁙²⁷ᵉ▤ᵉまᵉュ\0\0005\0\n█ュ\0\000み\r⁷⬆️⁷`⁷⁙5³⁷□てᵉそ⁙サ\0⁙エ\0⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙\r■▤⁷`⁷⁙5³⁷□てᵉナᵉルᵉき\n█ュ\0\0³ᵇ⁷⁙サ\0⁷⁙I⁴⁷ᵉき\n█ュ\0\0と	⁷ᵉ⬆️⁙サ\0\n…ᵉ⬆️⁙フᵉᵉ⬆️⁙モᵉ⁙ヤᵉ⁷⁷⁷⁷⁷⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙\r■う⁷`⁷⁙5³⁷□てᵉオᵉうd⁙v³⁷⁙サ\0⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙\r■き⁷`⁷⁙5³⁷□て\nヘᵉきᵉうd⁙ぬ\0⁷ᵉきᵉうd⁙k\0⁷ᵉ⬆️⁙サ\0⁙_\0⁷⁷⁷⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙\r■さ⁷`⁷⁙5³⁷□てᵉオ⁙に⁴⁙サ\0⁷ᵉ▤ᵉまᵉュ\0\0005\0⁙\r■そ⁷`⁷⁙5³⁷⁙5³⁷⁷⁷⁷⁷⁷⁷⁷\n█ュ\0\0フ\r⁷⁷⁷⁷⁷⁷⁷⁷⁷⁙⁵\0⁷d⁷⁷⁷⁷⁷|⁷⁷`=str_print_input⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉきᵉうx■peek⁷\n░ュ\0\0%_⁷⁷t⁷□ぬᵉ⬆️ᵉきᵉうx‖peek2⁷\n░ュ\0\0(_⁷⁷ᵉき\n█ュ\0\0◜\r⁷\n░ュ\0\0*_⁷⁷⁷ᵉ▤⁙)ᵇᵉ▤\n█ュ\0\0て⁸⁷ᵉ▤ᵉきᵉうx」camera⁷⁙⁵\0⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア⁙⁘▮ᵉ▤ᵉきᵉうx」cursor⁷ᵉ⬆️⁙て³\n░ュ\0\0○\0⁷⁷⁷ᵉ▤ᵉま⁙)\0t⁷ᵉ▤\n█ュ\0\0ᶜᶜ⁷□て\n█ュ\0\0\rᶜ⁷⁙⁵\0ᵉ▤ᵉきᵉうx!rectfill⁷ᵉ⬆️⁙て³ᵉ⬆️ᵉュ\0\0(\0ᵉうx⁙セᶠ⁷⁙a⁸⁷ᵉ⬆️\n█ュ\0\0⁷ᵉ⁷ᵉ⬆️ᵉユᵉュ\0\0(\0ᵉろ\n█ュ\0\0ᶜᵉ⁷⁙_\0⁷⁙a⁸⁷⁙_\0⁷⁙て³⁷⁷⁷⁷⁷□てᵉム⁙o■\n█ュ\0\0zᶜ⁷⁷ᵉ▤□ュ\0\0004\0\n█ュ\0\0ᵉᵉ⁷x⁙セᶠ⁷ᵉ▤⁙ツᵉ\n█ュ\0\0゛ᵉ⁷⁷⁷ᵉ▤ᵉき⁙わ▮⁙\n¹⁷\n█ュ\0\0「ᵉ⁷⁷⁷⁷⁷⁷⁷⁷⁷h█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア□っ⁙f\0px⁷ᵉ▤ᵉま⁙)\0x⁷ᵉ▤⁙=³□て⁙?³⁙⁵\0□てᵉらᵉうp⁙セᶠ⁷⁙Z\0⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0&ᵉ⁷⁙_\0⁷p⁙セᶠ⁷ᵉ▤ᵉきᵉうp⁙d■⁷ᵉ⬆️⁙て³ᵉ⬆️ᵉュ\0\0(\0⁙⌂■⁙a⁸⁷ᵉ⬆️⁙j■ᵉ⬆️ᵉユᵉュ\0\0(\0ᵉろ⁙⌂■⁙_\0⁷⁙a⁸⁷⁙_\0⁷⁙て³⁷⁷⁷⁷⁷ᵉ▤⁙ッ¹\n█ュ\0\0008ᵉ⁷⁷⁷⁷\n█ュ\0\0005ᵉ⁷⁷⁷⁷⁷⁷d█⁷□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア⁙ ⁷ᵉ▤ᵉま⁙て³x⁷□てᵉら⁙カ\0⁙)²⁷⁙⁵\0ᵉ▤ᵉまᵉきᵉうt■pget⁷ᵉ⬆️ᵉろ⁙)\0⁙カ\0⁷ᵉろ⁙Z\0⁙n⁸⁷⁷⁷p⁷ᵉ▤ᵉきᵉうt■pset⁷ᵉ⬆️\n█ュ\0\0@ᵉ⁷ᵉ⬆️\n█ュ\0\0Aᵉ⁷ᵉナᵉチᵉそ⁙サ\0⁙て³⁷ᵉュ\0\0005\0ᵉうt⁙ラᶠ⁷て⁷⁷⁙て³⁷⁷⁷⁷ᵉ▤⁙@²\n█ュ\0\0Qᵉ⁷⁷⁷⁷⁷⁷⁷`█⁷ᵉ▤ᵉま⁙⁵\0\\⁷ᵉ▤ᵉまᵉア□っ□っ□っ□っ⁙f\0dh⁷xx⁷X`⁷Td⁷ᵉ▤ᵉまᵉノᵉうx⁙ぬᶠ⁷ᵉノᵉうx⁙ほᶠ⁷\n░⁵ ⁷⁷⁷t⁷□ぬᵉきᵉうx⁙|▮⁷ᵉ⬆️⁙R\0ᵉろ\nひ\n█ュ\0\0Zᵉ⁷⁷ᵉうx⁙れᶠ⁷⁷⁷⁷ᵉ▤⁙)ᵇᵉ▤⁙L■ᵉ▤ᵉま⁙み¹h⁷□てᵉら⁙ヌ\0ᵉうx⁙むᶠ⁷⁷ᵉ▤ᵉき⁙/⁵ᵉユ⁙ヌ\0\n█ュ\0\0gᵉ⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙ヌ\0x⁙むᶠ⁷ᵉ▤□ュ\0\0004\0ᵉきᵉうx\rmid⁷ᵉ⬆️ᵉうx⁙もᶠ⁷ᵉ⬆️⁙て³ᵉきᵉうx\rmax⁷ᵉ⬆️ᵉユ⁙タ■⁙r■⁷⁙て³⁷⁷⁷⁷⁷x⁙もᶠ⁷ᵉ▤ᵉまᵉろᵉユ⁙o■⁙タ■⁷\n█ュ\0\0mᵉ⁷⁷`⁷□てᵉムᵉろ⁙5³⁙ヒ\0⁷⁙て³⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙ヤ■⁙_\0⁷x⁙もᶠ⁷\n█ュ\0\000はᵉ⁷⁷□てᵉケ\n█ュ\0\0yᵉ⁷⁙r■⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙ヤ■⁙_\0⁷x⁙もᶠ⁷⁙ロ■⁷ᵉ▤ᵉまᵉュ\0\0(\0⁙5³⁙a⁸⁷\\⁷ᵉ▤ᵉき\n█ュ\0\0ᵇᵉ⁷ᵉ⬆️⁙て³ᵉ⬆️⁙に⁴ᵉ⬆️⁙j■ᵉ⬆️ᵉユᵉろ⁙に⁴ᵉュ\0\0(\0⁙タ■⁙a⁸⁷⁷⁙_\0⁷⁙て³⁷⁷⁷⁷⁷□てᵉら⁙タ■⁙r■⁷ᵉ▤ᵉき⁙²□ᵉ⬆️⁙て³ᵉ⬆️\n░ュ\0\0~\0⁷ᵉ⬆️⁙j■ᵉ⬆️⁙j■⁙て³⁷⁷⁷⁷⁷ᵉ▤ᵉきᵉうx⁙7■⁷ᵉ⬆️⁙R\0ᵉ⬆️⁙て³⁙に⁴⁷⁷⁷ᵉ▤ᵉき⁙わ▮ᵉ⬆️⁙エ■ᵉ⬆️⁙て³ᵉ⬆️⁙に⁴ᵉュ\0\0005\0ᵉうx⁙ラᶠ⁷😐⁷⁷⁷⁷⁷□てᵉチᵉチᵉケᵉうx⁙わᶠ⁷⁙ホ⁷⁷ᵉル⁙)\0⁙⁙²⁷⁷\nヘᵉうx-g_interrupt⁷⁷⁷ᵉ▤ᵉき⁙\\⁵ᵉ⬆️ᵉュ\0\0(\0⁙サ\0⁙{⁸⁷ᵉろ⁙に⁴ᵉュ\0\0(\0⁙ヒ\0⁙a⁸⁷⁷⁷⁷⁙⁵\0⁷⁙⁵\0⁷⁷⁷⁷\n█ュ\0\0てᵉ⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷□てᵉム⁙ヌ\0⁙タ■⁷ᵉ▤ᵉき⁙む⁶ᵉ⬆️ᵉユ⁙タ■⁙ヌ\0⁷⁙ヌ\0⁷⁷\n█ュ\0\0ふᵉ⁷⁷⁙5□⁷⁷⁷⁷⁷|⁷⁷⁷\\⁷ᵉ▤\n█ュ\0\0002¹⁷ᵉ▤ᵉまᵉア□っ⁙ˇ\ntx⁷ᵉ▤ᵉき⁙ナ³⁙_\0⁷ᵉ▤□ュ\0\0004\0ᵉユᵉうt⁙セᶠ⁷⁙_\0⁷t⁙セᶠ⁷ᵉ▤ᵉきᵉうt⁙f\r⁷ᵉ⬆️\n░a[enter] ('esc' to abort)⁷ᵉ⬆️⁙て³ᵉ⬆️ᵉュ\0\0(\0\n█ュ\0\0んᵉ⁷⁙a⁸⁷ᵉュ\0\0005\0\n█ュ\0\0Gᵉ⁷☉⁷⁷⁷⁷⁷□て⁙エ\0ᵉ▤ᵉきᵉうt■flip⁷⁙⁵\0⁷ᵉ▤ᵉきᵉうt⁙ᶠ▮⁷⁙⁵\0⁷□ぬᵉきᵉうt⁙、▮⁷⁙⁵\0⁷ᵉ▤ᵉま\n█ュ\0\0T	⁷l⁷□て\n█ュ\0\0r²⁷\n█ュ\0\0ルᵉ⁷□てᵉそ⁙ヒ\0\n░⁵•⁷⁷ᵉ▤□ュ\0\0004\0⁙エ\0t⁙カᶠ⁷ᵉ▤□ュ\0\0004\0⁙\n¹t1g_str_output⁷ᵉ▤□ュ\0\0004\0⁙•\0t⁙す\r⁷⁙⁙²⁷⁷⁷□てᵉナᵉそ⁙ヒ\0\n░⁵\r⁷⁷ᵉそ⁙ヒ\0⁙웃¹⁷⁷ᵉ▤□ュ\0\0004\0ᵉろᵉうt⁙シᶠ⁷⁙)\0⁷t⁙シᶠ⁷⁙エ\0⁷ᵉ▤ᵉまᵉき⁙⁷²ᵉ⬆️\n█ュ\0\0Q	⁷⁙ヒ\0⁷⁷l⁷\n█ュ\0\0ヤᵉ⁷⁷⁷⁷⁷⁷p⁷⁷⁷⁙⁵\0⁷⁷⁷⁷⁷X⁷□ぬ⁙⁵\0ᵉ▤\n█ュ\0\0◜⁸⁷ᵉ▤\n█ュ\0\0◝⁸⁷□てᵉナ⁙⁵▮ᵉうx⁙g□⁷⁷ᵉ▤□ぬᵉきᵉうx⁙は▮⁷ᵉ⬆️\n█ュ\0\0ッᵉ⁷ᵉ⬆️⁙て³ᵉうx⁙シᶠ⁷⁷⁷⁷ᵉ▤⁙|□⁙~□⁷|⁷□てᵉチᵉスᵉユ⁙ユ¹\n█ュ\0\0ョᵉ⁷⁷\n█ュ\0\0んᶜ⁷⁷⁙⁵▮⁷ᵉ▤□ぬᵉきᵉうx⁙くᶠ⁷ᵉ⬆️⁙♥□⁙⁵▮⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙g□⁷□ュ\0\0004\0⁙5\0x⁙す\r⁷⁷|⁷ᵉ▤\n█ュ\0\0²ᶠ⁷□てᵉチᵉそ\nひ⁙⁵▮⁷⁙て³⁷\n█ュ\0\0けᵉ⁷⁷ᵉ▤□ュ\0\0004\0⁙'⁴x⁙す\r⁷□て⁙か□ᵉ▤\n█ュ\0\0⁵ᵉ⁷□てᵉチᵉそ⁙◆□⁙て³⁷⁙か□⁷ᵉ▤ᵉき⁙に⁴\nヘ⁙♥□⁷⁷□て⁙♥□ᵉ▤ᵉまᵉき⁙|¹ᵉ⬆️⁙♥□⁙▒⁶⁷⁷L⁷ᵉ▤ᵉまᵉき\n█ュ\0\0yᶜ⁷ᵉ⬆️\n█ュ\0\0³ᶠ⁷⁙…□⁷⁷H⁷ᵉ▤ᵉき⁙(⁵⁙웃²⁷ᵉ▤ᵉき\n█ュ\0\0し\r⁷ᵉ⬆️⁙ョ¹ᵉ⬆️⁙て³ᵉ⬆️ᵉュ\0\0(\0ᵉユ⁙o■⁙웃²⁷⁙a⁸⁷ᵉュ\0\0005\0\n█ュ\0\0❎ᵉ⁷█⁷⁷⁷⁷⁷□てᵉム⁙웃²⁙ふ□⁷□て\nュ\0\0!\0ᵉき⁙😐²⁙웃²⁷⁷\n█ュ\0\0❎ᶠ⁷□て\n█ュ\0\0くᵉ⁷ᵉ▤ᵉき⁙(⁵⁙_\0⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙o■⁙_\0⁷x⁙セᶠ⁷ᵉ▤ᵉき⁙わ▮ᵉ⬆️⁙ゃ□ᵉ⬆️⁙て³ᵉ⬆️\n█ュ\0\0\rᵉ⁷ᵉュ\0\0005\0⁙り□☉⁷⁷⁷⁷⁷□てᵉうx!g_notice⁷ᵉ▤\n█ュ\0\0&ᶠ⁷ᵉ▤\n█ュ\0\0(ᶠ⁷ᵉ▤ᵉき⁙わ▮ᵉ⬆️\n█ュ\0\0.ᶠ⁷\n█ュ\0\0+ᶠ⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙'⁴x⁙ス□⁷□てᵉうx5g_notice_time⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0002ᶠ⁷⁙_\0⁷x⁙ヒ□⁷□てᵉそ⁙マ□⁙て³⁷ᵉ▤□ぬ⁙\n¹ᵉ▤□ュ\0\0004\0⁙2\0x⁙ス□⁷□ュ\0\0004\0⁙5\0x⁙ヒ□⁷⁷|⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0えᵉ⁷⁙_\0⁷x⁙わᶠ⁷□てᵉそ⁙レ□⁙て³⁷ᵉ▤□ュ\0\0004\0⁙…□x⁙わᶠ⁷ᵉ▤ᵉきᵉうx‖color⁷⁙R\0⁷ᵉ▤ᵉき\n█ュ\0\0⁴ᵉ⁷\n█ュ\0\000の⁸⁷⁷□てᵉス⁙o■⁙…□⁷ᵉ▤ᵉき\n█ュ\0\0⁶ᵉ⁷ᵉ⬆️⁙て³⁙ケ□⁷⁷⁙⁵\0⁷⁙⁵\0⁷⁷⁷⁷\n█ュ\0\0Gᶠ⁷⁷⁷⁷\n█ュ\0\0Jᶠ⁷⁷⁷⁙	⁙⁷⁷⁷⁷⁷\n█ュ\0\0Nᶠ⁷⁷⁷⁷⁷\n█ュ\0\0Sᶠ⁷⁷⁷□ぬᵉき\n█ュ\0\0`ᵉ⁷ᵉ⬆️ᵉうx9g_error_output⁷⁙て³⁷⁷ᵉ▤⁙へᵇᵉ▤⁙まᵇᵉ▤ᵉま⁙み¹<⁷ᵉ▤ᵉき⁙(⁵⁙#³⁷ᵉ▤ᵉき⁙む□ᵉ⬆️\n█ュ\0\0Yᶠ⁷ᵉ⬆️⁙て³ᵉ⬆️ᵉュ\0\0(\0ᵉユ⁙o■⁙#³⁷⁙a⁸⁷ᵉュ\0\0005\0⁙り□░⁷⁷⁷⁷⁷□て⁙ゃ□ᵉ▤□ュ\0\0004\0ᵉろ⁙◆□⁙웃²⁷x⁙シᶠ⁷\n█ュ\0\0Wᶠ⁷⁷ᵉ▤□ぬᵉ⬆️⁙\n¹ᵉ⬆️⁙て³ᵉ⬆️⁙て³\n█ュ\0\0よᶜ⁷⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙ほᶠ⁷ᵉ▤□ュ\0\0004\0⁙5\0x⁙むᶠ⁷ᵉ▤□ュ\0\0004\0⁙み¹x⁙もᶠ⁷ᵉ▤□ュ\0\0004\0⁙ね³x⁙れᶠ⁷ᵉ▤□ュ\0\0004\0⁙は³x⁙シᶠ⁷ᵉ▤□ュ\0\0004\0\n█ュ\0\0さ²⁷x⁙g□⁷□ュ\0\0004\0ᵉう|▤⁷x⁙■⁙⁷⁷⁷⁷⁷⁷⁷|⁷ᵉ▤ᵉき⁙に⁴⁙⁵\0⁷⁙%⁙⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁙%⁙⁷⁷\n█ュ\0\0웃ᶠ⁷⁷⁷\n█ュ\0\0⬅️ᶠ⁷⁷⁷\n█ュ\0\0♪ᶠ⁷⁷⁷⁷⁙?⁙⁷⁷⁙?⁙⁷⁷⁷|⁷⁷⁷⁷⁷⁷`⁷⁷d⁷⁷h⁷⁷⁷⁷|⁷⁷⁷`‖_draw⁷ᵉ▤□ぬᵉ⬆️⁙⁙²\n█ュ\0\0^¹⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0`Ig_in_execute_yield⁷ᵉ▤□ュ\0\0004\0⁙5\0`5g_in_mainloop⁷□ュ\0\0004\0⁙み¹`-g_from_flip⁷⁷⁷|⁷ᵉ▤□ュ\0\0004\0⁙•\0`9g_pending_keys⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤□ぬ⁙h¹ᵉ▤□ュ\0\0004\0⁙2\0x。g_error⁷□ュ\0\0004\0⁙5\0x-g_error_idx⁷⁷|⁷ᵉ▤ᵉきᵉうx」assert⁷ᵉ⬆️⁙⁙²⁙)\0⁷⁷⁙⁵\0⁷⁷⁷`⁙サ¹⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙ˇ\0tx⁷ᵉきᵉきᵉうx⁙rᵉ⁷ᵉ⬆️⁙)\0⁙う¹⁷⁷ᵉナ⁙Z\0⁙R\0⁷⁷⁷`-execute_raw⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉきᵉうx⁙h⁙⁷ᵉ⬆️ᵉノ\n░。return ⁷⁙)\0⁷ᵉ⬆️⁙Z\0⁙エ\0⁷⁷⁷⁷`!eval_raw⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉきᵉうx!cocreate⁷\n█ュ\0\0やᶠ⁷⁷t⁷□ぬᵉきᵉうx!coresume⁷ᵉ⬆️⁙R\0⁙)\0⁷⁷ᵉ▤⁙)ᵇᵉ▤⁙L■□てᵉチ⁙サ\0\n█ュ\0\0り\0⁷⁷\n█ュ\0\0ツᶠ⁷□て⁙c	ᵉ▤□ぬᵉ⬆️ᵉうx⁙W⁙⁷⁙⁙²⁷ᵉ▤⁙a³□ュ\0\0004\0⁙5\0x⁙W⁙⁷⁷|⁷⁙¹⁙⁷⁙¹⁙⁷⁷⁷⁷|⁷⁷⁷`%try_parse⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□ぬᵉき⁙ᵉ⁙⁙h¹⁷ᵉ▤⁙4	ᵉ▤⁙6	ᵉノ\n░‖line ⁷ᵉノ\n█ュ\0\0%⁴⁷ᵉノ\n░‖ col ⁷⁙jᶠ⁷⁷⁷⁷⁷|⁷⁷`)pos_to_str⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤□ぬᵉ⬆️⁙•\0⁙D⁙⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙す\r⁷ᵉ▤□ュ\0\0004\0⁙5\0x⁙カᶠ⁷□ュ\0\0004\0⁙み¹x⁙W⁙⁷⁷⁷|⁷ᵉ▤□ぬ\n█ュ\0\0たᶠ⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙G⁙⁷ᵉ▤□ュ\0\0004\0⁙5\0x⁙J⁙⁷□ュ\0\0004\0⁙み¹x⁙L⁙⁷⁷⁷|⁷ᵉ▤ᵉまᵉき\n█ュ\0\0アᶠ⁷ᵉア□っ\n█ュ\0\0ま²⁷xx⁷ᵉ▤ᵉき\n█ュ\0\0ろᶠ⁷⁙R\0⁷⁙⁵\0⁷⁷⁷t⁷□ぬ⁙⁵\0ᵉ▤⁙)ᵇᵉ▤⁙L■□て⁙エ\0ᵉ▤□ぬᵉき\n█ュ\0\0エᶠ⁷⁙R\0⁷ᵉ▤⁙)ᵇ⁙L■⁷|⁷□てᵉそᵉきᵉうx!costatus⁷⁙R\0⁷\n░■dead⁷⁷□てᵉそ\n█ュ\0\0クᶠ⁷⁙'⁴⁷□て⁙Z\0ᵉ▤ᵉま\n░Yunexpected end of code⁷l⁷□て⁙エ⁙ᵉ▤□ぬᵉノ⁙エ⁙ᵉノ\n░■\nat ⁷ᵉきᵉうx⁙か⁙⁷ᵉ⬆️⁙)\0ᵉうx⁙Y⁙⁷⁷⁷⁷⁷\n█ュ\0\0サᶠ⁷|⁷ᵉ▤□ュ\0\0004\0⁙ヒ\0x⁙■⁙⁷ᵉ▤□ュ\0\0004\0⁙•\0x⁙O⁙⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0⁘▮⁷⁷⁷ᵉ▤□ぬ⁙'⁴ᵉ▤⁙a³\n█ュ\0\0\nᶠ⁷⁷|⁷\n█ュ\0\0◀▮⁷⁷⁷⁙マ⁙⁷□てᵉチ\n█ュ\0\0ヤᶜ⁷\nヘᵉうx⁙J⁙⁷⁷⁷ᵉ▤□ュ\0\0004\0\n░urunning, press 'esc' to abort⁷x⁙'□⁷ᵉ▤ᵉきᵉうx⁙@⁙⁷⁙⁵\0⁷ᵉ▤ᵉきᵉうx⁙R□⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0⁙'⁴x⁙'□⁷□ぬᵉきᵉうx⁙、▮⁷⁙⁵\0⁷ᵉ▤ᵉまᵉき⁙(⁵ᵉ⬆️ᵉうh░⁷ᵉうh☉⁷⁷⁷d⁷□てᵉそ⁙2¹⁙⁵\0⁷□てᵉうx⁙カᶠ⁷ᵉ▤ᵉま\n░Mcomputation aborted⁷l⁷\n█ュ\0\0、▮⁷⁷\n█ュ\0\0Y▮⁷⁷□てᵉそ⁙2¹\n█ュ\0\0セᵉ⁷⁷ᵉ▤□ュ\0\0004\0⁙エ\0x⁙カᶠ⁷ᵉ▤ᵉまᵉき⁙(⁵ᵉ⬆️\n█ュ\0\0)▮⁷⁙2¹⁷⁷d⁷\n█ュ\0\0@▮⁷⁷⁷ᵉ▤ᵉき⁙$\nᵉ⬆️ᵉうx⁙O⁙⁷⁙2¹⁷⁷\n█ュ\0\0009▮⁷⁷⁷⁷⁷h⁷⁷⁷⁷⁷□てᵉチᵉチᵉうx⁙ニᶠ⁷\n█ュ\0\0゛▮⁷⁷\nヘᵉうx⁙L⁙⁷⁷⁷ᵉ▤\n█ュ\0\0%▮⁷□てᵉチ\nヘ\n█ュ\0\0G▮⁷⁷ᵉうx%holdframe⁷⁷ᵉ▤ᵉき\n█ュ\0\0M▮⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0⁙⁙²x⁙L⁙⁷\n█ュ\0\0B▮⁷⁷⁷\n█ュ\0\0Q▮⁷⁷⁷\n█ュ\0\0S▮⁷⁷⁷⁷⁷⁙\r⁘⁷⁷⁷|⁷⁷⁷⁷⁷`。execute⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤□ュ\0\0004\0⁙エ\0x⁙G⁙⁷ᵉ▤ᵉきᵉうx‖yield⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0⁙⁙²x⁙G⁙⁷⁙⁵\0⁷⁷⁷⁷`⁙ヤ\n⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉき⁙⌂⁶ᵉき\n█ュ\0\0$▮⁷⁙ゆ\n⁷⁷t⁷ᵉ▤□ュ\0\0004\0⁙エ\0x⁙L⁙⁷ᵉ▤⁙⁸\rᵉき⁙し⁶⁙R\0⁷⁷⁷⁷⁷x⁙R□⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0ᵉ▤ᵉまᵉき⁙⌂⁶ᵉき⁙ろ⁙\n█ュ\0\0リᶜ⁷⁷⁷t⁷□てᵉうx⁙G⁙⁷ᵉ▤\n█ュ\0\0d▮⁷ᵉ▤ᵉまᵉき⁙⌂⁶ᵉき⁙ろ⁙⁙)\0⁷⁷t⁷\n█ュ\0\0█▮⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙⁙²x⁙W⁙⁷\n█ュ\0\0o▮⁷⁷⁷⁷⁷x⁙█⁙⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉそ⁙)\0\n█ュ\0\0³\r⁷⁷ᵉナᵉら\nひ\n█ュ\0\0;▮⁷⁷⁙て³⁷ᵉき⁙「▮⁙U⁘⁷⁷□てᵉそ⁙)\0⁙7▮⁷□て\n█ュ\0\0●▮⁷ᵉき⁙4ᵇᵉ⬆️⁙k⁘⁙_\0⁷⁷ᵉ▤ᵉま\n█ュ\0\0♥▮⁷t⁷□てᵉそ⁙R\0⁙■⁘⁷ᵉ▤\n█ュ\0\0005▮⁷⁙R\0⁷⁙R\0⁷⁷⁷⁙u⁘⁷⁷⁷x⁙ミ\n⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉうx!_set_fps⁷ᵉ▤ᵉき\n█ュ\0\0∧▮⁷ᵉナᵉチᵉう█%_update60⁷\n░ュ\0\0<\0⁷⁷⁙g⁘⁷⁷□てᵉう█‖_init⁷ᵉ▤ᵉき\n█ュ\0\0う▮⁷⁙⁵\0⁷ᵉ▤□ュ\0\0004\0⁙エ\0x⁙J⁙⁷□て⁙エ\0□てᵉうx=_update_buttons⁷ᵉ▤ᵉき\n█ュ\0\0か▮⁷⁙⁵\0⁷□て⁙0⁘ᵉ▤\n█ュ\0\0O▮⁷□て\n█ュ\0\0❎▮⁷ᵉ▤ᵉき⁙い⁘⁙⁵\0⁷□てᵉう█⁙@⁙⁷ᵉ▤ᵉき\n█ュ\0\0け▮⁷⁙⁵\0⁷ᵉ▤⁙'⁘ᵉ▤\n█ュ\0\0n▮⁷ᵉ▤⁙⁸\r\n█ュ\0\0ふ▮⁷⁷⁷⁷⁷\n█ュ\0\0す▮⁷⁷⁷□てᵉう█。_update⁷ᵉ▤ᵉき\n█ュ\0\0ち▮⁷⁙⁵\0⁷\n█ュ\0\0そ▮⁷⁷⁙に⁘⁷⁷⁷\n█ュ\0\0な▮⁷⁷⁷\n█ュ\0\0ぬ▮⁷⁷ᵉ▤□ュ\0\0004\0⁙⁙²x⁙J⁙⁷⁙⁵\0⁷⁷⁷⁷\n█ュ\0\0へ▮⁷⁷⁷\n█ュ\0\0ま▮⁷⁷⁷`-do_mainloop⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙ˇ\0hx⁷□てᵉき\n█ュ\0\0フ\n⁷ᵉ⬆️⁙)\0\n…ᵉ⬆️\n█ュ\0\0ヲ	⁷\n░%interrupt⁷⁷⁷⁷⁷⁙メ⁙□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵f⁷\n░⁙R□⁷⁷⁷⁷⁷⁙+⁘□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵r⁷\n░■repl⁷⁷⁷⁷⁷⁙Wᵉ□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	mi⁷\n░%max_items⁷⁷⁷⁷⁷\n█ュ\0\0007ᶜ⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵h⁷\n░\rhex⁷⁷⁷⁷⁷\n█ュ\0\0$ᶜ⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	cl⁷\n░」colors⁷⁷⁷⁷⁷⁙り□□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵c⁷\n░■code⁷⁷⁷⁷⁷ᵉ▤ᵉまᵉュ\0\0 \0□ヲ⁙て³\n█ュ\0\0[ᵉ⁷⁙f\0⁷⁙⁵\0⁷t⁷ᵉ▤ᵉまᵉユ\nひᵉうx⁙アᶠ⁷⁷⁙_\0⁷p⁷ᵉ▤⁙s⁵□て⁙u⁵⁙R\0ᵉ▤□さ⁙R\0⁙ヒ\0ᵉオ\n█ュ\0\0マ▮⁷ᵉユ\n█ュ\0\0ミ▮⁷⁙ヒ\0⁷⁷⁷ᵉ▤⁙♪⁵\n█ュ\0\0リ▮⁷⁷⁷⁷⁷⁷⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	cm⁷\n░。compile⁷⁷⁷⁷⁷ᵉア⁙⁘▮ᵉきᵉうx⁙◆⁙⁷⁙)\0⁷⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n█ュ\0\0😐\0⁷\n░■exec⁷⁷⁷⁷⁷ᵉア⁙⁘▮ᵉ▤ᵉき⁙も⁙⁙h¹⁷⁙⁵\0⁷⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵v⁷\n░■eval⁷⁷⁷⁷⁷ᵉア⁙⁘▮ᵉきᵉうx⁙s⁙⁷⁙h¹⁷⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░⁵p⁷\n█ュ\0\0{\n⁷⁷⁷⁷⁷ᵉア\n█ュ\0\0わᵉ⁷ᵉ▤ᵉき⁙わ▮ᵉ⬆️ᵉきᵉうt⁙'ᶠ⁷⁙)\0⁷⁙¹▮⁷⁷⁙⁵\0⁷⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░	ts⁷\n░⁙ルᵉ⁷⁷⁷⁷⁷ᵉア⁙⁘▮ᵉき⁙Fᶠ⁙)\0⁷⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…ᵉ⬆️\n░\rrst⁷\n░‖reset⁷⁷⁷⁷⁷ᵉ▤ᵉきᵉうx\rrun⁷⁙⁵\0⁷⁙⁵\0⁷□てᵉき⁙や⁘ᵉ⬆️⁙)\0\n…\n░⁙W‖⁷⁷⁷⁷ᵉ▤ᵉきᵉうx⁙へ⁘⁷⁙ヌ\0⁷⁙⁵\0⁷ᵉ▤ᵉき\n█ュ\0\0ふᶠ⁷ᵉ⬆️⁙⁙²\n░Eunknown \\-command⁷⁷⁷⁙⁵\0⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷`⁙へ⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙S³□ぬ⁙⁵\0ᵉ▤□ュ\0\0004\0ᵉア⁙⁵\0ᵉナᵉチᵉチ⁙)\0ᵉル⁙)\0⁙て³⁷⁷⁙エ\0⁷⁙⁙²⁷⁷x█⁷□ぬ⁙⁵\0□てᵉきᵉうp⁙E³⁷\n█ュ\0\0り▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア□っ⁙⁘▮tp⁷ᵉ▤□ュ\0\0004\0⁙m⁷t⁙トᶠ⁷⁙⁵\0⁷⁷t█⁷ᵉ▤ᵉまᵉュ\0\0 \0□ヲ\n░)__newindex⁷ᵉア⁙g⁶ᵉ▤ᵉき⁙ナ³⁙う¹⁷⁙⁵\0⁷⁷⁙f\0⁷⁙⁵\0⁷l⁷ᵉ⬆️ᵉきᵉうp⁙t⁴⁷ᵉ⬆️⁙ヒ\0⁙ヒ\0⁷⁷⁙て³⁷⁷⁷□てᵉき\n█ュ\0\0N■⁷\n█ュ\0\0ん▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア\n█ュ\0\0P■⁷ᵉ▤□ュ\0\0004\0⁙m⁷t⁙ニᶠ⁷⁙⁵\0⁷⁷t█⁷\n█ュ\0\0`■⁷⁷□てᵉき⁙⬅️‖\n█ュ\0\0イ▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙…‖ᵉ▤□ュ\0\0004\0⁙m⁷t⁙A\0⁷⁙⁵\0⁷⁷t█⁷⁙⧗‖⁷□てᵉき⁙⬅️‖\n█ュ\0\0ク▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア\n█ュ\0\0Q⁷⁷ᵉ▤□ュ\0\0004\0ᵉナᵉきᵉうx⁙メ\0⁷⁙)\0⁷\n█ュ\0\0c⁷⁷⁷x⁙xᵉ⁷⁙⁵\0⁷⁷t█⁷⁙⧗‖⁷□てᵉき⁙⬅️‖\n█ュ\0\0セ▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙…‖ᵉ▤□ュ\0\0004\0⁙m⁷t⁙zᵉ⁷⁙⁵\0⁷⁷t█⁷⁙⧗‖⁷□てᵉき⁙⬅️‖\n█ュ\0\0ト▮⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙け‖ᵉ▤□ュ\0\0004\0⁙)\0x⁙ラᶠ⁷⁙⁵\0⁷⁷t█⁷⁙⧗‖⁷ᵉ▤ᵉきᵉうp⁙]⁙⁷ᵉ⬆️⁙⁙²\n░aunknown \\-command assign⁷⁷⁷⁙⧗‖⁷⁷⁷⁷⁷⁷⁷t⁷⁷x⁷⁷`⁙も⁷⁷ᵉ▤□ュ\0\0004\0ᵉき\n█ュ\0\0リ⁸⁷⁙{⁸⁷`1g_prev_paste⁷ᵉ▤□ぬᵉ⬆️⁙て³⁙⁙²⁷ᵉ▤□ュ\0\0004\0⁙2\0`)g_key_time⁷□ュ\0\0004\0⁙5\0`。g_lower⁷⁷|⁷ᵉ▤ᵉき\n█ュ\0\0ほᶜ⁷ᵉ⬆️\n░ュ\0\0\\_⁷ᵉ⬆️⁙ホ⁷⁙)²⁷⁷⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□てᵉき⁙「▮ᵉ⬆️\n░ム⁷⁙)\0⁷⁷□てᵉル⁙)\0ᵉうx)g_key_code⁷⁷ᵉ▤□ぬᵉ⬆️⁙)\0⁙て³⁷ᵉ▤□ュ\0\0004\0⁙2\0x⁙チ‖⁷□ュ\0\0004\0⁙5\0x⁙ゃ‖⁷⁷|⁷ᵉナᵉそᵉうx⁙ゃ‖⁷⁙て³⁷ᵉチᵉケ\n█ュ\0\0そ■⁷⁙ホ⁷⁷ᵉそᵉュ\0\0+\0⁙ヘ‖⁙)²⁷⁙て³⁷⁷⁷⁷\n█ュ\0\0な■⁷⁷□てᵉそ\n█ュ\0\0く■⁷⁙)\0⁷ᵉ▤□ュ\0\0004\0⁙'⁴x⁙チ‖⁷⁙⁵\0⁷⁙⁵\0⁷⁷⁷`■keyp⁷ᵉ▤□ュ\0\0004\0ᵉア⁙S³□ぬ⁙⁙²ᵉ▤ᵉま⁙⁵\0t⁷ᵉ▤ᵉまᵉア⁙け‖□ぬᵉき⁙ᵉ⁙ᵉ⬆️ᵉノ⁙エ■⁙◝⁘⁷\n█ュ\0\0cᵉ⁷⁷⁷ᵉ▤⁙4	ᵉ▤⁙6	ᵉ▤⁙8	□てᵉうx%g_ideal_x⁷ᵉ▤ᵉま\n█ュ\0\0も■⁷t⁷ᵉ▤ᵉまᵉろ⁙サ\0⁙)\0⁷p⁷□て\nヘᵉチᵉケ⁙サ\0⁙て³⁷ᵉム⁙サ\0⁙ヒ\0⁷⁷⁷⁙⁙²ᵉ▤□ュ\0\0004\0ᵉき\n█ュ\0\0nᵉ⁷ᵉ⬆️ᵉユᵉき\n█ュ\0\0ュᵉ⁷ᵉ⬆️\n█ュ\0\000み■⁷⁙)▮⁷⁷\n█ュ\0\0aᵉ⁷⁷⁙_\0⁷⁷x⁙れᶠ⁷ᵉ▤□ュ\0\0004\0⁙R\0x⁙⁵◀⁷ᵉ▤\n█ュ\0\0=ᶠ⁷⁙エ\0⁷⁷⁷⁷⁷⁷\n█ュ\0\0エ■⁷⁷⁷⁷⁷|⁷⁷t⁷ᵉ▤ᵉま⁙⁵\0l⁷ᵉ▤ᵉまᵉア□っ⁙け‖lx⁷□ぬ\n█ュ\0\0め■⁷ᵉ▤⁙4	ᵉ▤⁙6	ᵉ▤ᵉまᵉナᵉチᵉら⁙)\0⁙て³⁷\n░ュ\0\0d\0⁷⁷⁙て³⁷t⁷ᵉ▤\n█ュ\0\0ゃ■⁷ᵉ▤□ュ\0\0004\0⁙エ\0l█⁷⁙⁵\0⁷⁷⁷⁷⁷|⁷⁷l⁷ᵉ▤ᵉま⁙⁵\0h⁷ᵉ▤ᵉまᵉア□っ⁙け‖tx⁷ᵉ▤□さ⁙\n‖ᵉうx⁙ウᶠ⁷⁙◝⁘⁷ᵉ▤□ュ\0\0004\0ᵉろ\n█ュ\0\0マ■⁷⁙)\0⁷x⁙ウᶠ⁷ᵉ▤□ュ\0\0004\0ᵉオ⁙\n‖⁙A◀⁷x⁙ほᶠ⁷□てᵉム⁙)\0⁙て³⁷ᵉ▤□ュ\0\0004\0ᵉろ\nひ⁙◝⁘⁷⁙_\0⁷x⁙れᶠ⁷ᵉ▤□ュ\0\0004\0⁙エ\0t█⁷⁙⁵\0⁷⁷ᵉ▤□ュ\0\0004\0ᵉき⁙⁘◀ᵉ⬆️ᵉユᵉき⁙「◀ᵉ⬆️⁙¥◀ᵉ⬆️\n█ュ\0\0⁙\r⁷⁙て³⁷⁷⁷⁙•◀⁷⁙_\0⁷⁷x⁙れᶠ⁷ᵉ▤ᵉまᵉき⁙★³ᵉ⬆️⁙◝⁘\n█ュ\0\0bᵉ⁷⁷⁷p⁷□てᵉチᵉル⁙サ\0⁙\n¹⁷ᵉル⁙サ\0⁙웃¹⁷⁷ᵉ▤□ュ\0\0004\0ᵉユ⁙Z◀⁙_\0⁷x⁙れᶠ⁷\n█ュ\0\0レ■⁷⁷⁙b◀⁷⁷⁷⁷⁷⁷⁷⁷h⁷ᵉ▤ᵉま⁙⁵\0d⁷ᵉ▤ᵉまᵉア\n█ュ\0\0ホ■⁷□てᵉら\n█ュ\0\0ヨ■⁷⁙て³⁷□てᵉら⁙ᶜ‖\n░ュ\0\0002\0⁷⁷ᵉ▤ᵉきᵉうx\rdel⁷ᵉ⬆️⁙\n‖ᵉュ\0\0005\0⁙\n‖█⁷⁷⁷ᵉ▤□さ⁙\n‖⁙ᶜ‖⁙◝⁘⁷ᵉ▤ᵉき⁙$\nᵉ⬆️⁙\n‖⁙\n¹⁷⁷ᵉ▤□ュ\0\0004\0⁙ᶜ‖x⁙ウᶠ⁷⁙b◀⁷⁷⁷⁷\n█ュ\0\0゛□⁷⁷⁙⁵\0⁷⁷d⁷ᵉ▤ᵉま⁙⁵\0`⁷ᵉ▤ᵉまᵉア⁙h◀□てᵉらᵉろ⁙Z◀⁙)\0⁷⁙て³⁷ᵉ▤□ュ\0\0004\0ᵉノᵉき⁙|¹ᵉ⬆️⁙◝⁘ᵉ⬆️⁙_\0ᵉユ\n█ュ\0\0%□⁷⁙_\0⁷⁷⁷⁷ᵉき⁙|¹ᵉ⬆️⁙◝⁘ᵉろ⁙😐◀⁙_\0⁷⁷⁷⁷x⁙ほᶠ⁷ᵉ▤□ュ\0\0004\0⁙😐◀x⁙れᶠ⁷⁙b◀⁷⁷⁙⁵\0⁷⁷`⁷ᵉ▤\n█ュ\0\0Uᵉ⁷ᵉ▤ᵉまᵉア⁙h◀ᵉ▤□ュ\0\0004\0ᵉノᵉき⁙|¹ᵉ⬆️⁙◝⁘ᵉ⬆️⁙_\0\n█ュ\0\0⁴□⁷⁷⁷⁷ᵉノ⁙)\0ᵉき⁙|¹\n█ュ\0\0◜■⁷⁷⁷⁷x⁙ほᶠ⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙Z◀⁙っ\0⁷x⁙れᶠ⁷⁙b◀⁷⁷⁷\\⁷ᵉ▤ᵉまᵉナᵉきᵉうp⁙ミ\n⁷ᵉ⬆️\n█ュ\0\0お■⁷\n░ュ\0\0ナ\0⁷⁷⁷ᵉき\n█ュ\0\0C□⁷ᵉ⬆️⁙ち◀\n░ュ\0\0ノ\0⁷⁷⁷⁷X⁷ᵉ▤ᵉまᵉナᵉき⁙と◀ᵉ⬆️⁙ち◀\n░ュ\0\0ニ\0⁷⁷⁷ᵉき⁙と◀ᵉ⬆️⁙ち◀\n░ュ\0\0ハ\0⁷⁷⁷⁷T⁷ᵉ▤ᵉま⁙そ‖P⁷□てᵉきᵉうp⁙ヨ‖⁷\n░ュ\0\0P\0⁷⁷□てᵉらᵉうp⁙れᶠ⁷⁙_\0⁷ᵉ▤□ュ\0\0004\0ᵉユ\n█ュ\0\0X□⁷⁙_\0⁷p⁙れᶠ⁷ᵉ▤□ュ\0\0004\0⁙エ\0x█⁷ᵉ▤ᵉまᵉき⁙と◀⁙{⁸⁷L⁷□てᵉナᵉル⁙ョ¹ᵉうp⁙れ‖⁷⁷ᵉそ⁙ユ¹\n░ュ\0\0コ\0⁷⁷⁷ᵉ▤ᵉき⁙に⁴⁙ョ¹⁷ᵉ▤□ュ\0\0004\0⁙ョ¹p⁙れ‖⁷□てᵉナᵉそ⁙ユ¹\n░ュ\0\0る\0⁷⁷ᵉそ⁙ユ¹\n░ュ\0\0シ\0⁷⁷⁷□てᵉチᵉルᵉうp⁙ほᶠ⁷⁙\n¹⁷ᵉル\n█ュ\0\0k□⁷\n█ュ\0\0_□⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙ナ◀p⁙れ‖⁷ᵉ▤ᵉきᵉうp」printh⁷ᵉ⬆️⁙ナ◀\n░‖@clip⁷⁷⁷□て\n█ュ\0\0i□⁷ᵉ▤□ュ\0\0004\0⁙\n¹p⁙ほᶠ⁷ᵉ▤□ュ\0\0004\0⁙_\0p⁙れᶠ⁷ᵉ▤□ュ\0\0004\0\n░}press again to put in clipboard⁷p⁙ス□⁷□てᵉき⁙と◀\n░ュ\0\0x\0⁷⁷ᵉ▤ᵉま⁙⁵\0H⁷ᵉ▤ᵉまᵉきᵉうp」serial⁷ᵉ⬆️\n░ュ\0\0\0⁸⁷ᵉ⬆️\n░ュ\0\0█_⁷\n░ュ\0\0█\0⁷⁷⁷⁷H⁷ᵉ▤ᵉき⁙に⁴ᵉきᵉうp⁙◝\0⁷ᵉきᵉうp⁙?■⁷ᵉ⬆️\n█ュ\0\0}□⁷⁙웃²⁷⁷⁷⁷□てᵉそ⁙웃²⁙て³⁷□て⁙ナ³ᵉ▤□ぬ⁙…□ᵉ▤□ュ\0\0004\0⁙2\0p⁙わᶠ⁷□ュ\0\0004\0⁙5\0p⁙⁵◀⁷⁷|⁷ᵉ▤□ュ\0\0004\0ᵉろᵉうp⁙ゃ‖⁷⁙_\0⁷p⁙ゃ‖⁷ᵉ▤ᵉきᵉうp⁙ᶠ▮⁷⁙⁵\0⁷⁙⁵\0⁷⁷⁷\n█ュ\0\0⬆️□⁷⁷\n█ュ\0\0▥□⁷⁷⁷⁷⁷\n█ュ\0\0∧□⁷⁷⁷⁷⁷\n█ュ\0\0う□⁷⁷⁷⁷ᵉ▤□ュ\0\0004\0⁙\n¹p⁙ス□⁷\n█ュ\0\0い□⁷⁷⁷⁙!▶⁷⁷⁷\n█ュ\0\0し□⁷⁷⁷⁷⁷\n█ュ\0\0た□⁷⁷□てᵉき\n█ュ\0\0U□⁷\n░ュ\0\0O\0⁷⁷□てᵉス⁙わ◀\nひ⁙ナ◀⁷⁷ᵉ▤□ュ\0\0004\0ᵉろ⁙わ◀⁙_\0⁷p⁙れᶠ⁷\n█ュ\0\0ち□⁷⁷⁙#▶⁷□てᵉき⁙&▶\n░ュ\0\0R\0⁷⁷□てᵉチᵉナ⁙😐²\nヘᵉき⁙R\0⁙そ‖⁷⁷⁷ᵉらᵉうp⁙ウᶠ⁷⁙_\0⁷⁷ᵉ▤ᵉき⁙ヌ\0⁙そ‖⁷⁙#▶⁷⁙#▶⁷□てᵉき⁙&▶\n░ュ\0\0Q\0⁷⁷□てᵉチᵉナ⁙😐²\nヘᵉき⁙R\0⁙_\0⁷⁷⁷ᵉム\n█ュ\0\0む□⁷\nひᵉうp⁙アᶠ⁷⁷⁷⁷ᵉ▤ᵉき⁙ヌ\0⁙_\0⁷⁙#▶⁷⁙#▶⁷ᵉ▤ᵉまᵉき⁙と◀⁙7▮⁷D⁷ᵉ▤ᵉまᵉきᵉうp\rord⁷⁙}²⁷P⁷□てᵉそ⁙}²⁙■⁘⁷□てᵉそ\n█ュ\0\0に□⁷⁙て³⁷ᵉ▤ᵉきᵉうp」extcmd⁷\n░‖pause⁷⁷⁙#▶⁷ᵉ▤□ぬ⁙•\0ᵉ▤□ュ\0\0004\0⁙2\0p⁙す\r⁷□ュ\0\0004\0⁙5\0p⁙■⁙⁷⁷|⁷ᵉ▤ᵉき⁙2¹⁙⁵\0⁷⁙#▶⁷⁷⁷□てᵉナᵉそ⁙}²\n█ュ\0\0ニᵉ⁷⁷ᵉそ⁙}²⁙웃¹⁷⁷□て⁙▒⁶ᵉ▤ᵉき⁙に⁴⁙웃¹⁷⁙#▶⁷ᵉ▤ᵉきᵉうp⁙6⁘⁷⁙ナ◀⁷□て\nヘᵉうp⁙す\r⁷⁷\n█ュ\0\0ネ□⁷\n█ュ\0\0チ□⁷⁷⁷⁷□てᵉチ⁙😐²ᵉき⁙&▶\n░ュ\0\0(\0⁷⁷⁷ᵉ▤ᵉき\n█ュ\0\0ノ□⁷ᵉ⬆️⁙ナ◀⁙エ\0⁷⁷⁙r▶⁷□てᵉチᵉチᵉル⁙}²⁙\n¹⁷ᵉケ⁙ユ¹⁙U◀⁷⁷ᵉム⁙ユ¹\n░ュ\0\0あ\0⁷⁷⁷□てᵉチᵉうp⁙ょ‖⁷ᵉケ⁙ユ¹\n█ュ\0\0~□⁷⁷⁷ᵉ▤ᵉまᵉき\n█ュ\0\0⬇️□⁷ᵉユ⁙ユ¹\n░ュ\0\0?\0⁷⁷⁷D⁷ᵉ▤ᵉき⁙に⁴⁙}²⁷⁙#▶⁷⁷\n█ュ\0\0◝□⁷⁷□てᵉそ⁙ユ¹\n░ュ\0\0り\0⁷⁷⁙q▶□てᵉそ⁙ユ¹\n░ュ\0\0ら\0⁷⁷ᵉ▤ᵉき⁙ヒ\0⁙そ‖⁷⁙#▶⁷□てᵉそ⁙ユ¹\n░ュ\0\0ろ\0⁷⁷ᵉ▤ᵉき⁙ヒ\0⁙_\0⁷⁙#▶⁷□てᵉそ⁙ユ¹\n░ュ\0\0ょ\0⁷⁷ᵉ▤□ュ\0\0004\0\nヘ\n█ュ\0\0ワ□⁷⁷p⁙ょ‖⁷ᵉ▤□ぬᵉ⬆️ᵉノ\n░Ishift now selects ⁷ᵉナᵉチ⁙こ▶\n░!punycase⁷⁷\n░。symbols⁷⁷⁷\n█ュ\0\0ミ□⁷⁷ᵉ▤□ュ\0\0004\0⁙2\0p⁙ス□⁷□ュ\0\0004\0⁙5\0p⁙ヒ□⁷⁷|⁷⁙#▶⁷⁷□てᵉき⁙&▶\n░ュ\0\0J\0⁷⁷□て⁙😐²ᵉ▤\n█ュ\0\0u□⁷⁙.▶⁷\n█ュ\0\0⁷⁙⁷⁷□てᵉき⁙&▶\n░ュ\0\0M\0⁷⁷□て⁙😐²ᵉ▤□ュ\0\0004\0ᵉろ⁙U▶⁙_\0⁷p⁙れᶠ⁷⁙.▶⁷\n█ュ\0\0ᵇ⁙⁷⁷□てᵉき⁙&▶\n░ュ\0\0*\0⁷⁷ᵉ▤ᵉき⁙5³⁙そ‖⁷⁙#▶⁷□てᵉき⁙&▶\n░ュ\0\0L\0⁷⁷ᵉ▤ᵉき⁙5³⁙て³⁷⁙#▶⁷⁙#▶⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷x⁷⁷`⁙つ⁘⁷ᵉ▤□ュ\0\0004\0ᵉア⁙ˇ\0□ぬᵉき⁙ろ⁙ᵉき⁙へ⁙⁙Z\0⁷⁷ᵉ▤⁙4	ᵉ▤⁙6	□て⁙Pᶜᵉ▤ᵉきᵉうx⁙フ◀⁷ᵉノ\n░。error #⁷ᵉノ⁙)\0ᵉノ\n░	: ⁷⁙サ\0⁷⁷⁷⁷ᵉ▤ᵉき⁙わ▮ᵉノ\n█ュ\0\0V⁙⁷ᵉノ⁙)\0\n░ョP\0\0\0\npico8 broke something again,\nthis cart may not work.\npress any button to ignore⁷⁷⁷⁷□てᵉそᵉきᵉうx■btnp⁷⁙⁵\0⁷⁙て³⁷ᵉ▤⁙'⁘\n█ュ\0\0g⁙⁷⁷ᵉ▤ᵉきᵉうx⁙つᶠ⁷⁙⁵\0⁷⁙⁵\0⁷⁷⁷⁷⁙⁵\0⁷⁷⁷|⁷⁷`!selftest⁷ᵉ▤ᵉきᵉう`⁙ヨ▶⁷ᵉ⬆️⁙_\0ᵉア⁙ˇ\0ᵉ▤ᵉき⁙b‖ᵉそᵉュ\0\0005\0ᵉき⁙⌂⁶ᵉき\n█ュ\0\0ᵉ■⁷\n░ね(function (...) return ... end)(1,2,nil,nil)⁷⁷⁷⁙N³⁷⁙{⁸⁷⁷⁙⁵\0⁷⁷⁷⁷ᵉ▤ᵉき\n█ュ\0\0p⁙⁷ᵉ⬆️⁙)²ᵉア⁙ˇ\0ᵉ▤ᵉき⁙b‖ᵉそᵉきᵉき⁙ョ▶\n░ョJ\0\0\0function() local temp, temp2 = {max(1,3)}, -20;return temp[1] + temp2; end⁷⁷⁙⁵\0⁷\nュ\0\0\"\0\n░ら⁷⁷⁷⁷⁙⁵\0⁷⁷⁷⁷ᵉ▤ᵉきᵉう`⁙フ◀⁷\n░!finished⁷⁷ᵉ▤ᵉきᵉう`■stop⁷⁙⁵\0⁷□て⁙エ\0□てᵉう`⁙-⁘⁷ᵉ▤ᵉき\n█ュ\0\0⬅️⁙⁷⁙⁵\0⁷ᵉ▤ᵉきᵉう`⁙つ⁘⁷⁙⁵\0⁷ᵉ▤ᵉきᵉう`⁙@⁙⁷⁙⁵\0⁷ᵉ▤ᵉきᵉう`⁙R□⁷⁙⁵\0⁷\n█ュ\0\0▤⁙⁷⁷⁷⁷⁷\n█ュ\0\0ˇ⁙⁷⁷⁙⁵\0⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷□て\nヘᵉきᵉう`⁙a\0⁷ᵉ⬆️\n█ュ\0\0ヒᵇ⁷\n░	'\n⁷⁷⁷⁷ᵉ▤□さ⁙⁶³\n█ュ\0\0웃⁴⁷⁙-「⁷□ぬᵉき⁙h\rᵉ⬆️\n█ュ\0\0ナᵇ⁷⁙-「⁷⁷\n█ュ\0\0サ⁙⁷|⁷⁷\n█ュ\0\0カ⁙⁷⁷⁷⁷⁷|⁷4⁷⁷⁷⁷⁷⁷<⁷ᵉ▤□さᵉう`⁙v³⁷⁙░³⁙エ\0⁷ᵉ▤ᵉまᵉき⁙に⁵ᵉ⬆️\n█ュ\0\0♥²⁷⁙░³⁷⁷@⁷\n█ュ\0\0ヒ⁙⁷⁷⁷⁷⁷D⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷⁷ᵉ▤□さ⁙▒⁶ᵉオ⁙に⁴⁙ョ¹⁷ᵉオ⁙😐²⁙ョ¹⁷⁷ᵉ▤\n█ュ\0\0ウ⁴⁷\n█ュ\0\0ヲ⁙⁷⁷⁷⁷⁷⁷⁷⁷⁷|⁷⁷⁷⁷⁷ᵉ▤□さ⁙R\0⁙ヌ\0⁙2¹⁷□てᵉそᵉきᵉう█⁙♪³⁷⁙2¹⁷⁙⁵\n⁷ᵉ▤□さ⁙サ\0⁙ヌ\0⁙エ\0⁷□ぬᵉき⁙ュ³ᵉ⬆️\n█オ⁷⁙ヌ\0⁷⁷\n█ュ\0\0▮⁘⁷|⁷⁷\n█ュ\0\0\n⁘⁷⁷⁷⁷⁷⁷|⁷l⁷⁷⁷⁷|⁷⁷⁷⁷⁷⁷⁷⁷"))
__gfx__
e0cc608870e08921cf00004300a008087008d1073783f51637d670e08921cf0000430031500008d12757e6f507378370e08921cf000043003150000812073783
f596e6374770e08921cf000043003150000892073783f52696e646562770e08921cf0000430031500008d1073783f5f6073770e08921cf0000430031500008d2
073783f52757e64796d65670210be049a0cb0870e049a00931500070a0080a707070e089e08be0c9c708708770e089e08be0c9c748704770e089e08be0c9c788
700770210be00ae0c90851071696273770a008c97070210be00ae0c9c60870e049e0c9c64870e0c9c688707070e089e08ba008ca708670e089e08ba0084b7046
7021cae08aa0cb867031500070e089e08ba0cb47700670e089210ba048b070e08921cf00004300312300065376f556e61626c656f5275607c67021cf00004300
315300061376f5c6163747f56716c657567070c770e08921cf00004300e0cc218c60c870070670e089e08ba04ba0cb4870708770e089e08ba0480870477021ca
e00ca0080f70a0cb87707031500021cae08ae00ae0c907d037572670e049a008cf0000620070e04931250031250070707031920070312500e089e08be04c3125
00a008cf0000920070704770a008cf000063007070707070707006d19637f6e656f66670e08921cf00004300e0cc218ca008cf0000420070870670e00ae0c987
31850070e049319200e04931a50031a5007070707006113757261370210be049e00ae0c906513707c6964770a0485816c226c266c2e6c227c247c267c2c5c222
c272c2a0c2a2c232c2d2c2c7c2b2c2e57070e00aa008cf0000240070a0485870c280c2c0c2a0c2d0c290c2b0c2c5c222c272c2a0c210c220c230c240c250c260
707070e089e08b312300c570e089e08b3153008570e089e08b31b1004570e089e08ba04ba0cbc570700570e089e08b31f500c47021cae00ca0cbc470a0cb0570
70e08921cf00004300e0cc315000e0cde04d319200a04850037070e08d319200a04850937070707006d19637469676964770e08921cf00004300e0cca008cf00
00b30070e00ee00ee00ee00ee0cde04d319200a04850147070e08d319200a04850a5707070e0cde04d319200a04850167070e08d319200a04850a770707070e0
8a319200a04850f5707070e04d319200a0485008707070e00ae0c9873119007031920070707006d1963716c6e657d670e08921cf00004300e0cc218c218c3166
00470670864570e089e08ba0481070877021cae08d31a500a04b3192007070e089e08be00ae0c94731b60070e04931920031a5007070077021cae08aa0cb0770
a0cb88707021cae00c31a500a008cf000037007070e089e00aa0cbc870e049a048d457e6475627d696e6164756460237472796e67670a0088f707070e049a008
cf0000b20070e04c31a50031f500707070a008cf00002800707021cae08aa008cf0000970070a04850c57070e089e08ba008cf00001800704870e089e08ba008
cf0000770070c670e089e08be00da0088e70a0cbc67070077021cae08aa008cf0000980070a04850877070e089e08be00ae0c9475147f6e657d670e04ea04890
038770e00ae0c94731850070e049319200e04931bd00e04c31a500a0484870707070707070c67021ca316e00e089e08ba008cf00002900704870e089e08be00a
e0c947d036862770316e0070077021caa08e316d0070e089e00aa008cf0000d70070e04ea0481326164602563736160756a30270316e007070e089e08ba008cf
00001700700770e089e08be04e311d00316d00708770e089a008cf0000780070a008cf0000de007070707070a008cf00005a0070707070e089e00a314010a048
9326164602865687025637361607567070a008cf00009a007070707021cae00ae0c94731190070316e0070e089e08b31a500467021cae0cda008cf00001b0070
e0ce31a500e04ca0cb4670a0488870707070e08931f010e089a008cf0000880070a008cf0000bc00707070e089e08be00f31a50031f500704870e089e08be00a
a008cf0000e80070e00aa008cf0000090070e049319200e049a008cf00003b007031a50070707070c67021cae00ea08e316e0070e04d316e00a048cf00000010
707070e089e00a314010a048942616460246563696d616c602563736160756707031611070316110707070707021cae08a316e00a008cf000006007070e08931
f010e08931521021caa08ee00ae0c94731160070e049316e00a0489102d090c0b0a07070707021cae08a316e0031a01070e089e00a31401031500070e089a008
cf00001a0070e089a008cf0000bb0070a008cf00008a0070707070a008cf00006d007070a008cf0000bd007070707021caa008cf00003d0070e089a008cf0000
4d0070e08931d41031051070703105107070707070707021cae08a316d00a04850a07070e089e00a314010a008cf0000e7007070a008cf000048007070311110
7070707031f51070707006d146561757f6475670e08921cf00004300e0cc31590021cae08ae00ae0c98731b60070a008cf000067007070a04850b57070e08931
f010e089e08b31a500477021cae08aa008cf00002f0070a04850d37070e08931f010a008cf000022107070e089e08be04ea04850d570e04ee00aa008cf0000c3
0070e049319200e049312500a008cf0000ab0070707070a008cf00009f007070700770e089e08ba04b316d0070c67021caa008cf00004f0070e08931f01021ca
e08a310710a008cf00005e007070e08931f010e089e08b31a500867021cae0cda008cf0000470070e04fe00a31c710e049319200e04931a500e00fe04c31a500
316e007031f50070707070316d007070e08931f010a008cf00004110707021cae04d31a500318c0070e089e00aa008cf0000a7007031500070e049e00a31c710
e049319200e049312e0031f710707070a008cf00004010707070a008cf000011107070707070a008cf0000511070707021ca314010e089e00a31c910a0485596
e66716c6964602c6f6e6760226271636b65647377070e04960487031a5007070a008cf0000c1107070707070707070a008cf0000e11070707006534656c6f6e6
7626271636b6564770e08921cf00004300e0cc218c316600450670210be04931f50031f50070e089a0080b70e089a0088b70210ba008cb70210be04931b100e0
4931b100a0084a707070e089e08b312300c670e089e08b3153008670e089e08b319b104670e089e08be0c9c7c8700670210be0c9c70970e089e08b3150008570
e089e08be0cc218c218c218c218c316600474570c6c57087487007077021ca311d00e089e00ae0c947d3f6e6f536f6d60796c656f5661696c670e049319200e0
c90708707070e08921cf00004300e0cd319200a08e31a5007070c608703150007070a008cf0000e310707070857021cae08d311d00318c0070e08921cf000043
00311d00070870e089e08be00ae0c94531b60070e049319200311d0070700570210b315000e089e08b312300c470e089e08b315300847021cae00ae0c9453116
0070e049a008cf0000050070a008cf0000fc00707070e089e08be04c311d0031f500708770e089e08b31fc00c47021cae08a310f1031981070e089a008cf0000
33007021caa08ea008cf0000f4007070e089e00ae0c945d016464670e049312e003125007070e089e00aa008cf0000351070e049312310a008cf000083107070
70e089e00a315020e049a0cb0670e00f311d0031f50070707021cae0c9c50870e089210be049a048f070a008cf0000d5107070e089214a316e00a04b316e0070
3123007021cf00004300315300c5087070c770a008cf0000b420707031812070707070a008cf00005610707070a008cf000096107070707021cae0cde08a310f
10a04850d27070e08ae00aa008cf0000541070e049319200a008cf0000e410707070a008cf0000e610707070e089e08be04c311d00a008cf0000190070708770
21cae08aa008cf0000741070a008cf00003f007070e089210be00ae0c94531da1070e049319200e049311d00a0cb8570707070e089e08b3123008470e08b3153
00877070c77021caa08ea0cb84707021cae0cda008cf0000341070e04f31c2203198107070e089a008cf0000f41070a008cf0000a810707021ca31a500e089a0
08cf000005107031a12070e089e00a315020e049316e0031fc00707031a120707070a008cf00009810707070a008cf0000b81070707021cae00ee00ae0c94531
190070310f1070e0cde08a310f10a04850e27070e00aa008cf0000f81070a008cf0000171070707070210be049a04892031323334353637383937031fc0070e0
89e08b3123004470e089e08b315300047021cae0cde08a310f10a008cf000025007070e00aa008cf0000b41070e049314520a04890878570707070e089e08be0
4ea0cb4470a0481314162426343644465456646670704470e089a008cf000057107021ca31fc00e089a008cf000084107021cae0cda008cf0000291070a0cb04
7070e089e08b3131200470e089310420a008cf00000c1070707021caa08ee00a312620e049310f10a008cf0000f91070707070e089e08be00ae0c94531850070
e049319200e049317020a008cf0000951070707070847021caa08ee00ae0c94531de0070a008cf00000810707070e089e00aa008cf0000871070a04892261646
02e657d62656277070e089e08b3106208470e089e00a315020e049316e00a008cf00001b1070707031a120707070a008cf00008b10707070a008cf00006a1070
707070a008cf0000cb107070707021cae0cda008cf0000a91070e00a312620e049314520a04890262470707070e089e08ba048900313704470a008cf00001c10
707031872070707070c77021cae00ae0c945310b0070310f107021cae00aa008cf0000fc107031c22070e089310420a008cf00006d107070e089e00a315020e0
49316e00a008cf0000ea1070707031a120707021cae00ee08a310f10a04850727070e08a310f10a0485022707070e089210be00ae0c94531061070e049319200
e049314220e049310f1031c82070707070a008cf0000e71070c770e089e00a315020e049316e00e0cf00000200218fa048d03747277031982031660070315000
70707031a120707021cae0cde08a310f1031d22070e00a312620e049314520a04890d3b570707070e089210be00aa008cf0000771070e049319200e049311d00
e04931c82031fc007070707031fb20c770a008cf00007e107070e089310420210be00ae0c9459157e6071636b670e00ae0c94531070070e049e00aa008cf0000
ba1070e049319200e049311d00a008cf000047107070707031a010707070e089e08b312300c370e089e08b3153008370e089e08b319b10437021cae0cde0cde0
8aa0cbc370310f1070e08aa0cb8370310f107070e00a312620e049310f10a04890e2e370707070e08931d62021cae0cde08aa0cb4370a008cf00006f007070e0
0a312620e049310f10a04850e370707070e089310420a008cf00005d10707031ff20707021cae0cde0cde0cda008cf0000002070e04fa008cf0000102070310f
107070e00a312620e049310f10a04890c3e370707070e00a312620e049316030a008cf0000312070707070e08931d62021caa008cf0000902070a008cf0000e0
207031ff20707021cae0cd314030e00a312620e049310f10a04851e2a3e5c3e370707070e08931042021cae0cde08a316030319f2070e00a312620e049310f10
a04811e2e5c3e37070707031113031ff20707021cae0cde08aa008cf0000ff1070319f2070e00a312620e049310f10a04893b2d2a2f2c552e562c7c3e3d3e712
7070707031113021cae00a312620e049310f10a048d6b2d2a2f2c552e562c7c3e3d3e7328292b7d7b5d5b3c2f30442e2a370707031ff20e089e00a31c820e04e
a048922616460236861627a30270310f10707031ff20707070707070707070c770707070707070707070c7707070e049316e00e049312e00e049312310a008cf
0000851070707070707070c57070707070c77007707070c77070061247f6b656e696a75670e08921cf00004300e0cc315000e089a008cf0000820070e089a008
cf0000a2007021caa008cf0000c2007031500021cae08ae00d31a5003125007031920070312500e08931af10a008cf0000e520707070707070700611963796e6
70e08921cf00004300e0cc315900e00ae0c98731ad2070e049319200e04931f500e0c90850e6707070707006914656071636b670e08921cf00004300e0cca008
cf0000520070e089e08b31b1008770210be049e0c90711e65687477031920070210be00ae0c9470870e049e0c9474870e0c94788707070e089a008cf0000c210
70e089a008cf0000d2107021cae08a316e0031500070311d00e089214a311d00316e00312e0070210be00aa008cf0000d62070e049a008cf0000e62070316e00
7070a008cf0000a72070c77070707070c77047707070061136f6079770e089e08be00a314700a048dff600000016e646c226275616b6c246f6c256c63756c256
c637569666c256e646c26616c63756c266f627c26657e6364796f6e6c276f647f6c29666c296e6c2c6f63616c6c2e696c6c2e6f647c2f627c2275607561647c2
2756475727e6c2478656e6c247275756c257e64796c6c2778696c65670708470e08921cf0000430031b10006d2b6569777f62746f5d6160770210be00ae0c906
d016c6c67031982070e089e08be00ae0c9440870e049e0c9444870e0c94488707070047021cae08aa008cf00003a107031500070210b315000e08921cf000043
00e0cc315900e0cde08ae00ae0c98711479707567031920070a0489137472796e6767070e08ae00aa008cf00001f0070e049319200318c007070319f20707070
c30870e08921cf00004300e00a314700a0485556e646c256c63756c256c637569666c257e64796c67070069256e646f547f6b656e63770e08921cf00004300e0
cc218c315900cf0000dcffc370210be00ae0c98731633070e04931920031fc007070e089e08b3123004770e089e08b3153000770e089e08b319b10c670210be0
4931f500e049a048c770a008cf00001a20707070210b312300210b315300210b319b10210ba008cf0000f21070210ba008cf0000131070210be0c9c74970210b
315000210b312300210b315300210b31b100210b312300210b315300210b319b10210b311b30210b315000e08921cf00004300e0cc218c218c218c3166000786
7047c670878770e089e00ae0c987316d1070e049319200e00ee00d312500e00f31702031f500707031f5007070703150007070830870210b315000e08921cf00
004300e0cc315000e0cc218c316600870870311d007070430870210b315000e08921cf00004300e0cc218c316600874470210be00de0c98708703192007021ca
31a630e0cc218c218c316600470870874770e00de00d319200a008cf00006b2070703125007070e08921cf00004300e0cf00005300310e3011f554e465704708
70e0cca008cf00009b2070e00de0cf00005300a008cf0000ab2070314e307031250070707070477070030870210b315000e08921cf00004300e0cc218c218c21
8c218c316600074570868770c68370874470e089e08be0cf00005300310e30d0e2e2e270477021cae00ea08e31250070e04f3125003170207070e089e00aa008
cc70a0481457e656870756364756460272e2e2e2727070e0cc218c218c316600878670474770e00ae0c98731f43070e0cf00005300e00d31920031250070315f
3070707070a008cf00008d2070707070c20870210b315000e08921cf00004300e0cca008cf00005b2070210ba008cf00007b207021ca31a630e0cc316e30e049
319e303125007070e089a008cf0000eb2070e0cc316e30e049a008cf0000fb207031250070707070477070820870210b315000e08921cf00004300e0cc218c21
8c218c316600478670874770c68370e089e08be00d311d0031a630700770e08921cf00004300e04c31a63031f5007047087021cae08a316d0031920070315000
21cae08a316d00a008cf0000b1107070e089e00a31cf3031500070e089e00a31cf30e04ea048925687075636475646a3027031920070703150007070a008cf00
004f20707070707070420870210b315000e08921cf00004300e0cc218c218c218ca008cf00007e2070c6877087477007837021caa08e31920070e089e08ba008
cf0000ae20700870e089a008cf0000de207021cae08a31920031724070e089e00a3170203150007021cae0cde0cde08ae00ae0c9c631d8307031920070a008cf
0000f8207070e00ae0c9c6310b0070e00ae0c9c631b60070e04931920031f50070707070a08ee00de0c9c63167307031920070707031920021caa008cf000050
3070e089e00a317020e04ea0481596e66716c6964602964656e6479666965627a302703192007070e089e00a317020a048d4964656e647966696562702568707
563647564670703150007070a008cf0000513070707070a008cf0000813070707070a008cf0000a130707070020870210b315000e08921cf00004300e0cc218c
218c31660087477047867021cae08a31c34031920070e08931e34031fc00703150007070c10870210b315000e08921cf00004300e0cc218c218c218c31660047
4470878770074670e08921cf00004300e00ae0c98713375647d6564716471626c65670e04931b100e0cf00000200218fa048d1f5f596e64656877031a6303166
0070315000707070470870e08921cf00004300e04c31702031f50070070870315000707070810870210b315000e08921cf00004300e0cca008cf0000923070e0
8921cf00004300e0cf00005300e00ae0c98713765647d6564716471626c6567031a6307031974070470870e08921cf00004300a008cf00009a20700708703150
00707070410870210b315000e08921cf00004300e0cc218c316600868770e089a008cf0000a62070e089e08ba008cf00007200704770e089e08be00f31250031
f500700770e089e08b31f500c67021cae00c316e00316d007021cae00c31250031ca3070e089e08be00ae0c98611071636b670e00aa008cf0000a52070319200
7070467021cae04fe0c94631e4307031f50070e089e08ba008cf0000b430700670e089e08b31f500c57021cae00ca008cf0000b4007031533070e089e08be04c
312500e00f31aa4031f50070704770e08921cf000043003125008731e43070311d007070e089214a311d00e00fe04c31250031fa407031f50070e00d31231031
fa407070e089e08be04c31fa4031f50070c570a008cf0000e530707070707070e089214a311d00312500e0c946087070a008cf0000453070707070312c4070e0
89214a311d00316e00e00ae00d31a500316e00703192007070e089e08be04c316e0031f50070c670a008cf0000e630707070707070707070010870210b315000
e08921cf00004300e0cc218c218c31660047877007c170e089311940e089e00ae0c94731102070e049311d00a0cf00001200e00a3192003150007070707021ca
e00a317020a04850c27070a008cf0000f73070311d0070707070c00870210b315000e08921cf00004300e0cc218c218c218c218c218c316600c6c17046427086
0570478770070170e08931194021ca31c910e089e00aa008cf0000773070e049311d0031c910707021ca31a500e049e0cc218c218c218c218ca008cf00001b20
70074870468770860770c64770e089e08be00a311d00319200704770e00ae00d312500316d0070e049312500e00ae0c9c631f43070e00ae0c9860870e0493192
0031231070707070707070e04931fc00e049317240e0cca008cf0000d83070e089a008cf0000f83070e049a008cf0000093070e00ae0c9c6312a4070a008cf00
0069307070707070707070e049e0cc218c218c218c313f40c68770070770474770e00aa008cf0000e83070e00ae0c94731f43070e00a317020e049319200316e
007070707070e04931fc00e049317240e0cc218c218c313f40470770078770e049310150e00a31a630e049319200316d0070707070707070707021caa08ee00a
31cf30a048509270707021ca31fc00e089e00a31ae40e049311d00a0cf00001200e00aa008cf00002930703150007070707021caa0cf00001200a008cf00007b
307070a008cf00004b3070e089e00aa008cf0000163070a008cf0000c7307070a008cf00002c307070707031c2507031c25070707070800870210b315000e089
21cf00004300e0cc218c218c218c218c218c218c218c218c31660086c170854270440270844370c50570458770c48670054770210b31db10e089315b10e08931
7b10210b31f500e089e08b3123000770210b31530021caa08ee00a318250a04850d7707070e08921cf00004300317240c60870210b315000e089e08b31230046
70e089e08b315300067021cae00a31825031d22070e089e08be00aa008cf0000c51070315000704670e089e00ae0c985087031081070e089e00aa008cf0000ad
3070319f2070e089e08ba008cf00008d30700670e089e00a315020e049311d003123107070e089e00a315020e049312500315330707021caa0cf00001200a008
cf00002d307070e0cc218c218c218c218c31660046457086c670064770478770e089311940e089e08ba04b312500700770e089a008cf000044307021caa008cf
0000543070311d0021cae08a316e0031825070210be049e00ae00d312500316e007031920070e00ae0c946312a4070e00ae00d315330316e0070319200707070
e089a008cf0000840070e089a008cf0000940070e089e08be0c98531e430704570e089e08b31f500057021cae00c310f10a0cb457070e089a008cf0000b63070
a008cf000080407070e089214a311d00e00fe04c31fa40310f107031f50070e00d31c820310f107070e089e08be04c310f1031f500700570a008cf0000ff3070
70707070707070c770e089214a311d00a008cf0000be3070a008cf0000ee307070a008cf00006f30707070707070707021caa08ee00a318250a04850b3707070
e089e00a31c55031035070a008cf000043407070314a50707070707070707021cae08ae00d310f10e04ce0c9c4087031f5007070319f2070e089e08be00ae0c9
840870e00aa008cf000068207031500070704670a008cf000071407070e089e08be00aa008cf0000e14070316d00704670e089a008cf0000dd3070e089e08be0
4c316d0031f500700770e08921cf00004300e04ca04b311d007031f50070c60870a008cf00005140707070707070707070c77070a008cf0000c0407070c67070
__map__
7c0707077c070704800712b01305000e9812fc000034000ecc12c812c812c812c812c812c812c812c812c812c812c812c812c812c812c812c81366006c18073458070c14076044075c28071c4c07083007507807443807481c076464074c240730540768200720600738480712b013050012b01332000e9813b70112b013b901
12ac13290012ac135a000e980a80fc0000f002070e9812fc000034000a80fc0000b903077880070e9812a40e9c60800713e003132f05070e9812fc000034000ea013560513e0030770800712b0131b000e980eb8133200580712b013350012ac1352000e980ea00e9c50130102070e94138c020a841173656c660707070e980e
a00a80fc00001a04070a840528070712ac0ae80ea013b4050a80fc0000b60307070712ac13cf0012ac0afc000021000ea013b4050a8413f5030707070e9812fc0000340013cf0054800712ac0afc000021000a80fc0000590407070e9813db0512b00ea00e9c50137a0307138c02070e980eb80ea00e9c4080070e940e9c4084
070e9c40880707073c0712ac0ea81323031305000712ac0e9c5480070e9812fc000036000a80fc00004e0407132f0513f5030712b00e940e9c3880070e940e9c3480070e9c30800707070e980eb81332002c070e980eb813350028070e980eb813b90124070e9812b00e94131b000e940ec40e9c208007135f0007132f050707
0e9812fc000034001332003880070e9812fc0000340013350034800712fc0000340013b90130800707077c070e980eb80ea00e9c1c800713050007180712b00ea00a80fc00006004070a80fc00006b0407070e980eb80ea00e9c1480070e940e9c1484070e9c1488070707100712ac0ea80abc1007130500070e9812b00e940a
bc2c070e940abc28070abc240707070a80fc00007b04077c070e980ea013f2050a840d656e6407070e980ea00e9c0c8007130500070ecc12c812c812c812c812c812c80a80fc0000e3030754700758800774500768580760180778840712ac13d1000e980ea013ea040e94132900131b0007070e980eb80ea00e9c74136e0307
1329000770070e980a80fc00000101070e980eb80ecc12c812c812c812c812c80a80fc0000200307686c077070074460074864075468070e980eb80ea00e9c7813a204070afc0000370080070774070e980eb813d6006c0712ac0ef40a80fc00005f010713e200070e980eb8131b0064070e980eb813e20060070e980eb813ac
035c0712ac0a80fc00004f03070e980eb81332016c070e980eb8131b0058070e980eb80ab40a80fc0000f403070750070e980a80fc00004e000712ac0a80fc000051000712ac13b4050e9812fc000034000ea00a80fc0000a304070ea00a80fc00006302070e941352000e940ec40a80fc0000ae0407135f00070e9c74134e03
07070707075813f503070e980ea00e9c78130102070e9413e600138c0207070e980eb80ea0137d0213e6000740070e980ea00e9c781164656c690713e6000712ac13840312ac0ea80ea00a80fc00008d0207138403070a84157461626c6507070ea00a80fc0000d40207138403070ea013840313050007071305000707070707
0a80fc0000c70407070e9812a4138c020ed013810613fd01070ed013520013fd0107070e980eb80ec413fd01135f00074c070a80fc0000d10407070707070707070e9812a413320113af040ed013e60013af0407070e980a80fc00005b03070a80fc0000da04070707070707070a80fc0000d40407070707075c0712ac138c02
12b00ea00a80fc0000690407132900070e980eb813320050070e980eb81335004c070e9812a413f00113fd0113af04071305000707077c0713af0407070707070a80fc0000ee040707070707070e980ea00a80fc0000870407130500070e980eb80ea00a80fc00008104070e940a80fc000082040713c406070710070a80fc00
00fb040707070707140707070707077c07070a80fc0000030507070e9812a4131406132303132f05070e980eb80ea00a80fc00006204070e940a80fc000063040713230307073c070a80fc00000c0507070707074007070e980ea013f2051330050712ac13ba060e980ea013af050a8471756e65787065637465642070617261
6d20616674657220272e2e2e2707070a80fc00001c05070713dd06070707070e980ea00a80fc00005304070e94138c0213de0507070a80fc000016050707070a80fc00000f05070713e3060707070a80fc00001e0507075407077c07070707070e9812fc000034000a9013de050778800712ac0afc000021000ea013b4050a80
fc000091010707070e980ea013e0060e9413e00313de0507070a80fc00005f05070712ac0afc000021000ea013b4050a84053a0707070e980a80fc00002d05070e980eb813cf00740712ac0ea80ab413e00307135f00070e9812fc000034000ea01356050efc0000350013e0038007077080070a80fc00002305070712b00ea0
0e9c0880070a80fc0000350507070e980eb80ef00a80fc0000330507135f000700070e980eb8132902fc0000e0ff0712ac0ec00abcfc0000e0ff070abc0007070e9812fc000034000ecc12c812c81366007804077478070e940ea013e003132900070ed0136a030ab4136a0307070707708007130007070e980eb80e9c048007
fc0000dfff070e9812fc000034000ecc12c812c80a80fc000075030770fc0000e0ff0778fc0000dfff070ed01310050ed0136a0313d6000707070480070e980eb80ec40a80fc00003e0507135f0007fc0000e0ff070a80fc000057050707070707070704070707070a80fc00005b0507070707071300070770070778077c0707
00800712b01305000e9812fc000034000ecc12c812c812c812c812c812c812c812c812c812c812c812c812c81366006434077874074c2c075c04075000074430076078076838075424077468075850074028074820070e980a80fc0000eb02070e98133e0412b013050012ac0a80fc0000ef02070e9813de0512ac0ea813d600
0a840d6e696c07070ea0132f051305000712ac0ea813d6000a84117472756507070ea0132f0513cf000712ac0ea813d6000a841566616c736507070ea0132f051313020712ac0ea80ea00e9c60138d030713d600070a84196e756d62657207070ea0132f0513d6000712ac0ea80a80fc00008005070a80fc0000bf0407070ea0
132f050e9c7013c602070712ac0ea813d6000a84057b0707135f0512ac0ea813d6000a80fc0000570407070e9812fc000034000ea0135c05130500076c80070e980ea013ba0613f805070e940ecc12c8136600786c070afc000021000a80fc0000430507070713cf0007070712ac0ea813d600132502070e9812fc000034000e
a0135c050a84a807076c80070ecc0a80fc00008d05070afc00002200136d0707070712ac0ea813d6000a84057e07070e980a80fc00009605070ecc1375070afc00002300136d0707070712ac0ea813d6000a840d6e6f7407070e98137c070ecc1375070ae8136d0707070712ac0ea813d6000a84052307070e98137c070ecc13
75070ab4136d0707070712ac0ea813d6000a84054007070e98137c070ecc1375070afc00002400136d0707070712ac0ea813d6000a84052507070e98137c070ecc1375070afc00002500136d0707070712ac0ea813d6000a84052407070e98137c070ecc1375070afc00002600136d0707070712ac0ea813d6000a842166756e
6374696f6e07070ea00e9c5080071305000712ac0ea813d6000a80fc00005b0407070ea013f2051305000712ac0a80fc00008600070e9812fc000034000ea013b405130500076c80070e940ecc12c8139500746c070ea00e9c7821636d645f6578656307136a0307070e9413cf000ecc0a80fc0000c005070ea00e9c7829636d
645f61737369676e07136a03070707070712ac0afc000021000a80fc0000230407070e940ea013af0513d600070e9413cf000ea013d20613d6000707070e980ea01328050ee40a8449756e657870656374656420746f6b656e3a200713d600070713050007070707070707070707070707070707070707070a80fc0000e40507
076c07070707fc0000e0ff800712b01305000e9812fc000034000ecc13050012b013050012ac0edc0ea81329000a84055e07070ed8135a000a84ac0707070e9812fc000034000ea01304010a80fc0000ee0507077880070ecc12c812c81366007888077478070efc000027001310050ea0136a031329000707070712ac0edc0e
a81329000a84052a07070eec135a000a84a40707070e9812fc000034000ea01304010a80fc0000fb0507077880070ecc0a80fc0000f405070efc000028001310050a80fc0000f5050707070712ac0edc0ea81329000a84052f07070a80fc0000fc0507070e980a80fc0000ff05070ecc13eb070efc0000290013100513ed0707
070712ac0edc0ea81329000a80fc00008500070713f307070e9813f5070ecc13eb070efc00002a0013100513ed0707070712ac0edc0ea81329000a80fc0000ae05070713f307070e9813f5070ecc13eb070efc00002b0013100513ed0707070712ac0edc0ea81329000a84052b07070eec135a000a84a00707070e9812fc0000
34000ea01304010a80fc0000150607077880070ecc13eb070ec413100513ed0707070712ac0edc0ea8132900132502070a80fc0000160607070e980a80fc00001906070ecc13eb070ef013100513ed0707070712ac0edc0ea81329000a84092e2e07070ed8135a000a849c0707070e9812fc000034000ea01304010a80fc0000
240607077880070ecc13eb070ee413100513ed0707070712ac0edc0ea81329000a84093c3c07070eec135a000a84980707070e9812fc000034000ea01304010a80fc00002e0607077880070ecc13eb070efc00002c0013100513ed0707070712ac0edc0ea81329000a84093e3e07070a80fc00002f0607070e980a80fc000032
06070ecc13eb070efc00002d0013100513ed0707070712ac0edc0ea81329000a840d3e3e3e0707133a08070e98133c080ecc13eb070efc00002e0013100513ed0707070712ac0edc0ea81329000a840d3c3c3e0707133a08070e98133c080ecc13eb070efc00002f0013100513ed0707070712ac0edc0ea81329000a840d3e3e
3c0707133a08070e98133c080ecc13eb070efc0000300013100513ed0707070712ac0edc0ea81329000a84052607070eec135a000a84940707070e9812fc000034000ea01304010a80fc0000500607077880070ecc13eb070efc0000310013100513ed0707070712ac0edc0ea81329000a84095e5e07070eec135a000a849007
07070e9812fc000034000ea01304010a80fc00005a0607077880070ecc13eb070efc0000320013100513ed0707070712ac0edc0ea81329000a84057c07070eec135a000a848c0707070e9812fc000034000ea01304010a80fc0000640607077880070ecc13eb070efc0000330013100513ed0707070712ac0edc0ea81329000a
84053c07070eec135a000a80fc0000b4000707070e9812fc000034000ea0130401138408077880070ecc13eb070eec13100513ed0707070712ac0edc0ea81329000a80fc00000a0207070a80fc00006e0607070e980a80fc00007106070ecc13eb070ec013100513ed0707070712ac0edc0ea81329000a84093c3d0707138e08
__gff__
070e981390080ecc13eb070ed813100513ed0707070712ac0edc0ea81329000a84093e3d0707138e08070e981390080ecc13eb070ed413100513ed0707070712ac0edc0ea81329000a84093d3d0707138e08070e981390080ecc13eb070ea813100513ed0707070712ac0edc0ee00ea81329000a84097e3d07070ea81329000a
8409213d070707138e08070e981390080ecc13eb070ef413100513ed0707070712ac0edc0ea81329000a840d616e6407070eec135a0013290207070e9812fc000034000ea0130401132902077880070ecc13eb070edc13100513ed0707070712ac0edc0ea81329000a84096f7207070eec135a00135f0007070e9812fc000034
__sfx__
0513ed07024300e8411286700000340000e80213021064110500007066006300e8410e80213035054110060007070142700c7112b3400e80513001054112d730074300e82113c74000700c7112b3400e82113001
000ef013074300743007430128620a8003c30000c40054300e80213065054111a100070112c2702035000a6700000086200707028270202701c22513c60034301383500430130550743007070182113c30000023
0a80fc002a51013475004303490007070182703825000a67000003b6200704607070206111c5200e8211305500070146112702013816004300743007430128620e842138350005000a67000002f420074300e841
9413fc0300c5406430128620e8060e842130630405000a670000007620074300e8420e8020a8003c300008160643013063044301305507430070701825000a67000002833007070206111c5200e8211305500070
070707481381600430074300707018270206111652013416074300e8021306505070146111a100138670343007430074300e8410e8430e802138170507014611163000e8211344200070146111a1001302106430
0034000e070112c25000a670000001600070701825000a670000027330074110921007411092100743007430074300705000a67000000443007430070660706707430074303c300008753fb0007070182113c300
980eb8130c311083110871126100389670000020f77070263c300008753f730128030e802138060341105000070701825000a67000001e210070701825000a67000001f210070701825000a67000002021007070
070e980e31610285301286213c740001130270206112f4200e8210e80613442004112c6100707014611121001383500430074300e8410e8431301300006070701827038611350001c5300e8410e84313c4301045
0e981338386113161014530128620a84613423034300e82113015000701461126300138160043007070182113027014611354100e82113c7204070146110c21013c0006430074300e84113023090701861136440
12c812c80905000a67000001543007430074303c5300a8003c30000472074300743007430074303c5300a8003c300000020743007430074300706707430109000701130611050000e8411286700000340000e864
6f2076611303600047105302c143070113025000a6700000144300707018611344400e84113033090112c25000a67000001d2000707018270206113c7100a82019516211762e5763410221517335462717620027
00ddff072c52725530074111630007411163000743007067074303c30000c653fb000701130611050000e8411286700000340000e86412844128441284412844128441284413036000662443038160070273c300
135f00072014707065104302810507070182703827020611207101305603430305300e8410e8021386703411393100707018270382702061120710130420543024530128620e8650e8420a8003c3000000001430
050007070e8420a82313013014301347500430070700c31108311087112610038107070662453012803134660707018611344400e84113033090701821124611121001383500070206113c710134420043007411
0013e60007067074300e8641284412844128441284413036000451c5301412607065205303010707011306113d6000e84113c230107018611376000e841130750607018270386111f10028530128620e80413816
02135f00070701827038270206111c5200e82113442004110123007430105300e8410e8430a867000002200013475004300c530128620e80413c67014112c6100707018270386113d54008530128620e80413c40
980eb81307411050000e841128220e80513c05004110921007070107111210013c40024300e805138070141109210074300e8410e8430e82413c40024113d700070440705000a670000030530074300743007070
070a80fc3d54004530128620e86613467024111f10007411050000e841128220e80513c05004113d11007070107111210013467024300e80513807014113d110074300e8410e8430e82413467024113d70007024
00de0307000003c53007430074300743007430128030e8020e8051383500411223000741129000070701825000a670000015710070701825000a6700000167100707018270202701c26513400024300a8003c300
07fc000007070182702025000a6700000036300705000a670000020710074300e8410e8430e82413816004111f100070460705000a67000000e6300743007430074303c530074300743007067074300743007430
b80ea00e1cf7700630128031342000070182113c30000023000700c3110831108311083110831108711271301814307027285302c147070263c30000c753f7302010507070186113b4300e841130730407018270
070707071c26613045004300e8211383500070146111f1000a867000002200013442024300743007046070701827038270206112f4200e8211381600070146112c6100e82113442000700c711152001347509430
12b013101c530128620a84613c72044300e8410e80213065050500466629176365062c54624102235762d1072f5272e1262040633517295362e5662517634530070700c3110835000a67000000c330070661c530
1305000e0507018611344400e841130330907018211246111210013835000702061126300134420043007411050000743007067074300705000a67000003663007430074300743007867000001bf770063012803
0ea013e0182113c30000023000700c31108311083110831108311083110831108311083110831108711261001c141070640453034100070443853038161070070c43010126070662043004101070261053012862
050707130305000a670000038620074300e8021305603070146110f30013c740043007070182703827020611070101386703430285300e8410e8430e8060e8650e80213806034113931007070206110701013472
133503071b0000700607070186111f5200e8410e8430a8231381600430185300e8410e8431347500025070112c27000711012301386002430128620e8650e8420a8003c30000c150743013475004300e8420a823
070707131347500430070700c3110831108711370203814407007205300e8410e8020a8003c30000c33044300e82113442000703c3000000200011387112a5100e80213430024112900007411261000741105000
600712ac05000074300e8641284412844128440a8003c30000432034301c1440700720530281460707018611112200e8410e8430a8003c30000872034302c5300e8410e843130610a0260707018270386111f100
135f00070e804134230341132400070701827020611067400a8003c30000034014300741105000070701821124611113000e80513816004113541007070107112630013423034300707018270382700471135410
01080707205300a8003c300008270743007430074300743007430070701821124611327200e8051381600411012300705000a67000003a620074300e8410e8430e82413c00064111f100070250705000a6700000
d013d1000743007430074300743007867000001af7700630128031342000070182113c30000023000700c3110831108311083110831108711261002c163070263453038107070463843034146070701827038270
0713db050a8003c30000836064300700707070182113c30000023000700c3110831108711204303810707007345300e82713c050007010711121001343002430074302c900070112c2702035000a67000003f310
ff800712070701827020611284200e8060e8650e845130560305000a67000000e530074300a8203501621126204172857632127285062e1260743013432044300741105000074110500007430074303c30000c45
fc0000d930611050000e8411286700000340000e86412844128441284412844128441284412844128441284413036000443c43038127070651c430109670000018f7707025244303414607066105301816407064
00008a053f7300e8410e8430e842130630441123530070070707018270386111b7202853012803134200001130611320001280313423000112c27020611165200a82011027285262e53007070182113025000a67
13ba060a07070182113c30000023004113200024900070113c30000023004113500020900074303c530128620e8021303505050046012516633526074300e84112867000003400013c200a006006300e8410e802
0a84196500a67000000f220074300e86412844128440a8003c30000815024303412607007205301286213001054112d73012862134300205000a67000001d73007411050000743007430070112c2702061116520
800712ac2c517255462653007070182113c300000230041108440209000705000a67000003d040074300a8003c3000007308430074300707018270206113272013835004300e84112867000003400013c200a026
0764077c0e8650a8460a8003c30000873054300705000a670000036040074300e8410a8003c30000433084300e84112867000003400013432040440063013c710a4300705000a67000000c140074300743007006
0000310307430074303c300008453fb000701130611050000e8411286700000340000e86412844128441284413036000660c53030106070471c5300e8410e843138060302707070182113c300000230005000a67
34000ecc07047006300e8410e8430e802138670305000a67000002422007430285300e841128670000034000130150004700630138160043007430074303c30000c353fb000701130611050000e8411286700000
0024080713420000112c270286112900013c7400430134200041128500074303c300008353fb000701130611050000e8411286700000340000e86412844128441284412844128441284412844128440a8003c300
a013140614147070053c300008353f7302016107045244303414607066105301c9670000017f77070643c30000c453f7300e8410a8003c30000462084300e8410a8003c30000072084301280313420000112c270
0ed40ea00a820090262f53007070182113c30000023004111f520249000707018270206111c52013c010a4300e8641284412844128440a8003c300004130143030126070261053038146070112c6111042012862
a0132f050e861345013312721127074111f100074111f1000707018270202701c22735447295262c1261f52638526235273452607411050000701130611182500e84113406030701861123510128621383600070
00004b080a8003c30000471074300705000a67000000624007430074303c5300705000a67000000324007430134200043007430070701825000a670000007140070701825000a670000035140070701825000a67
d6ff075c0705000a67000000724007430074300702607430074303c30000c253fb000701130611050000e8411286700000340000e864128441284412844128441284412844128441303600046244301496700000
13e3086014430241050704538530309670000017f7707047245300e8410a8003c30000065084300e8410e8430e80213430024110f30007066070701827020611284200a820154272e12729166074300e8410e843
7813eb0a070112c270007112071013015004300e841134750505000a67000003f240074300e8641284412844128441284412844130360002634530341660704620530201250704718530128620e8250e8020e861
a013e200074111f100074111f1000707018270202701c24713c760a4301342000430128030e802130150041129000070701825000a670000010710070701827038611350002c5301286213416090701827038270
13e6001313442004302c530128620e80413844004113240007070182702025000a67000003c22007411290000705000a6700000362400743012862138350007020611140300e8211383500411263000743012862
c812c812050000a8003c30000c63084300743007430134230b430074303c5300705000a67000003b24007430074300743007430078670000014f7700630128031342000070182113c30000023000700c31108311
0768240708311083110831108311083110831108311083110831108311083110831108711261000c141070253443038127070240453014001070620c430308670000016f77070233853038021070451c43008126
980a80fc341460700720430009670000017f770702610530128620e8420e80513c050005000a67000002c3100743013c47024300e8410e8430a8003c30000010034302c5300e8410e80213042054113931007070
0a80fc00000001e2400707018270206112842013003054300e8410e84313c1608065070701827038270203701c35000a670000010020074112334007070206113a23013475004300700507070182702061128420
00070ecc0041708430070701825000a67000003d6200707018211246112f620138360041134620070701827038270206111233013420004303c4300e8410e8021304205411112500707018270206113303013420
076807121284412844128441284412844128441284413036000271c53020123070652c5303010507047205300c103070453c4300e8410e8430a8003c30000c52084302c5300e8410e8430e802138350041129000
071305002c270007112230013862034300e8410e8431300105026070112c2700071132400138360043013420000112c27014370202701c20613c560a430134750043013475004300e8410e8020e861205112f350
b81335000707018270202701c20613400024300e82113442000703c3000000200011387112f2201301301411261000741105000074300701130270206110c21013442004300e8410e84313013000250707018270
077c0707105300e8410e8020e861205111c2300741129000070112c611012300e80213817050701461101230138070143007070182703827004711324001381600430245300a8003c30000470094300743007430
f808070e0705000a67000000c44007430074300e8410e8431300105044070112c2702c71109210138360043013420000112c25000a670000035340070701825000a67000003734007070182702025000a6700000
0001090714611290000e86700000200001284713c7204411092101303600430134200043007430128030a8003c30000c67084300e8410a8003c30000841014300e8410a8003c30000c41014300e8410a8003c300
0707070712862134670207020611327200e821134670241104610074300e8410e8430e82413c400241122300070440705000a6700000244400743007430074303c530074300a8003c30000402094300743007430
__music__
04 000e2013
00 0401135f
08 00077800
04 070e4c13
09 6b070e60
00 13100513
01 6d070707
00 07130500
00 07070707
00 07070707
00 07070707
00 07070707
00 07070707
00 07070707
08 7807077c
0c 00005f7f
09 00071230
00 1305000e
05 18127c00
00 0034000e
05 4c124812
05 48124812
05 48124812
05 48124812
01 48136706
00 5478074c
09 7c00005f
09 7f07507c
0c 0000607f
00 075c2407
00 74680764
00 20075808
00 07605007
02 0e18133b
04 070e1813
08 3e041230
00 13050012
01 30133200
02 0e181363
04 03122c13
09 1c01122c
0a 0e281356
04 00136b06
04 070e1812
01 7c000034
0c 000a007c
00 00007805
04 076c0007
0a 0e140e4c
0a 12481248
00 13660078
01 0407746c
04 070e5013
00 1005136a
00 0307070e
05 14134f00
0a 0e4c0a00
09 7c00004d
08 06070e14
00 13100513
00 6a030707
00 07070712
05 2c0e2813
01 5600132d
__meta:title__
keep:------------------------------------
keep: Please see 'Commented Source Code' section in the BBS
